{"words": [{"id": 21377, "name": "A", "definition": "<p>To see the letter &#34;A&#34; in your dream represents the beginning of a new stage. You are moving on to something new and grand. Alternatively, the letter &#34;A&#34; invokes feelings of superiority and grandeur. It may indicate the name or initial of a person.<br/></p>", "deleted": false}, {"id": 21378, "name": "Aardvark", "definition": "<p>To see an aardvark in your dream indicates that you are being very secretive and cautious about your business. <br/></p>", "deleted": false}, {"id": 21379, "name": "Abacus", "definition": "<p>To see or use an abacus in your dream refers to your outdated views. You  have an old fashion perspective on certain issues.<br/></p>", "deleted": false}, {"id": 21380, "name": "Abalone", "definition": "<p>To see or eat abalone in your dream indicates a transitional period in your life. The symbol may also be a play on words to indicate feelings of &#34;loneliness&#34;.<br/></p>", "deleted": false}, {"id": 21381, "name": "Abandonment", "definition": "<p>To dream that you are abandoned suggests that it is time to leave behind past feelings and characteristics that are hindering your growth. Let go of your old attitudes. A more direct and literal interpretation of this dream indicates you have a fear of being deserted, abandoned, or even betrayed. It may stem from a  recent loss or a fear of losing a loved one. The fear of abandonment may manifest itself into your dream as part of the healing process and dealing with losing a loved one. It may also stem from unresolved feelings or problems from childhood. Alternatively, the dream indicates that you are feeling neglected or that your feelings are being overlooked. Perhaps the dream is a metaphor that you need to approach life with &#34;reckless abandon&#34; and live more freely. <br/></p><p>To abandon others in your dream suggests that you are overwhelmed by the problems and decisions in your life. <br/></p>", "deleted": false}, {"id": 21382, "name": "Abbey", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\"><font size=\"3\">To see</font> <font face=\"Arial\" size=\"3\">an abbey in your dream signifies spirituality, peace of mind and freedom from anxiety. You are in a state of contentment and satisfaction. Help for you is always around the corner. </font></font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\" size=\"3\">To see an abbey in ruins indicates feelings of hopelessness. You have a tendency to not finish what you started.</font></p>", "deleted": false}, {"id": 21383, "name": "Abbot", "definition": "<p>To see an abbot in your dream suggests that someone has power over you and are making you do things that you do not necessarily want to do. You are feeling confined or restricted. The dream indicates that you will experience many obstacles and setback before achieving success and prestige.<br/></p>", "deleted": false}, {"id": 21384, "name": "Abbreviation", "definition": "<p>To see abbreviations in your dream may represent the initials of someone in your life. The abbreviations could stand for an organization or a common acronym or it may spell out some hidden message or advice. The dreaming mind likes to make use of puns, as well as shorthand messages. For example, &#34;CD&#34; could be a pun on a &#34;seedy&#34; situation. &#34;AA&#34; could stand for Alcoholics Anonymous and thus point to the dangers or your excesses and negative behaviors. &#34;Inc&#34; may represent an &#34;inkling&#34;, hunch or suspicious you have about a situation. The initails DM may refer to a direct message or perhaps that you need to check Dream Moqds for your dream anaylsis.<br/></p>", "deleted": false}, {"id": 21385, "name": "Abdomen", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\" size=\"3\">To see your abdomen in a dream refers to your natural instincts and repressed emotions. There is something in your real life that you &#34;cannot stomach&#34; or have difficulties accepting. You need to get it out of your system. Alternatively, the dream symbol may be strictly physiological and you may just be experiencing constipation or indigestion. </font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\" size=\"3\">To dream that your abdomen is exposed represents issues you have with trust and feelings of vulnerability. You are expressing your primal emotions and instincts.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\" size=\"3\">To dream that your abdomen is swollen indicates that some new project is in the works. </font></p>", "deleted": false}, {"id": 21386, "name": "Abduction", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\" size=\"3\">To dream of being abducted indicates that you are being manipulated by your circumstances or by someone. You lack control of your own life.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\" size=\"3\">To witness an abduction in your dream signifies feelings of helplessness.   </font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are abducting someone implies that you are holding on to something that you need to let go. You may be forcing your views and opinions on others.</font></p>", "deleted": false}, {"id": 21387, "name": "Abhorrence", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\" size=\"3\">To dream that you abhor a person represents your waking dislike for that person. You are harboring feelings of resentment or aggression and feel that this person has acted in a less than honorable way.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\" size=\"3\">To dream that you are abhorred by others suggests that you may be forcing your views and opinions on others. You are rubbing others the wrong way.</font></p>", "deleted": false}, {"id": 21388, "name": "Abnormal", "definition": "<p><font size=\"3\" style=\"font-size: medium;\">To dream of some abnormality or of abnormal objects indicate that the problems that have been preoccupying your mind will soon be resolved.</font><span style=\"font-size: medium;float: none;\"> </span><font face=\"Arial\" size=\"3\" style=\"font-size: medium;\">Note that anything appearing abnormal draws attention to that particular aspect. Something in your life may not be consistent with how you feel things should be.</font><br/></p>", "deleted": false}, {"id": 21389, "name": "Aborigine", "definition": "<p>To see an Aborigine in your dream represents both your untamed, natural self and your pure, innocent side. You need to be more in touch with your intuition and inner forces.  It also suggests that you are being overindulgent or overly emotional. You may be harming yourself and jeopardizing your well-being due to your unrestraint.<br/></p>", "deleted": false}, {"id": 21390, "name": "Abortion", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\" size=\"3\">To dream that you have an abortion suggests that you are hindering and blocking your own growth. You may be hesitant in pursuing a new direction in your life due to fear, pressure, personal conflict or moral obligation. The dream may also be a reflection of your own real-life abortion and thus serves as  a way of healing from the trauma and working towards self-acceptance. Alternatively, this dream may also be a message for you to take care and look after your health.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\" size=\"3\">To dream that someone has an abortion refers to an aspect of your relationship with this person is not growing or maturing. If you do not know this person, then the dream may be about your own personal views on abortion.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\" size=\"3\">To dream that you or someone has an illegal or unsafe abortion indicates that you are desperate to keep things the exact same way. You hate change. If the abortion results in death, then it means that your approach to a problem is all wrong.</font></p>", "deleted": false}, {"id": 21391, "name": "Above", "definition": "<p>To see something above you in your dream suggests that you need to set your goals higher. Aim high! Alternatively, the dream indicates that you are feeling inferior or inadequate. <br/></p>", "deleted": false}, {"id": 21392, "name": "Abraham Lincoln", "definition": "<p>To see Abraham Lincoln in your dream refers to your solid character and leadership ability. Known as &#34;Honest Abe&#34;, the dream may also be telling you to be truthful or to come clean about something.<br/></p>", "deleted": false}, {"id": 21393, "name": "Abroad", "definition": "<p>To dream of being or going abroad  indicates unbalance and chaos in your current situation and condition. Consequently, your dream may represent your need for a change in scenery or a desire to escape from a current situation. You need to make some drastic changes in your life. Alternatively,  the dream may suggest that you need to expand your horizons or experience a new sense of spirituality.<br/></p>", "deleted": false}, {"id": 21395, "name": "Abscess", "definition": "<p>To dream that you have an abscess suggests that there is something that you need to express and get out into the open.<br/></p>", "deleted": false}, {"id": 21396, "name": "Abscond", "definition": "<p>To dream that you have absconded with something indicates your failed accomplishments. You may also be feeling insecure about your achievements. You feel that you are never good enough. Consider the significance or value of what you have absconded.<br/></p>", "deleted": false}, {"id": 21394, "name": "Absence", "definition": "<p>To dream that someone is absent, especially if you expect to find them, suggests that you are looking for something that is already lost to you. Alternatively, you may be looking to fill a void in your life. Something is missing from your life.<br/></p>", "deleted": false}, {"id": 21397, "name": "Absorb", "definition": "<p>To be absorbed in whatever you are doing suggests that you may be too focused on your own thing and risk alienating others around you. The dream may also be a metaphor that you need to integrate and adapt to your various surroundings.<br/></p>", "deleted": false}, {"id": 21398, "name": "Abstinence", "definition": "<p>To dream that you practice abstinence from drinking, sex  or any other sort of sensual temptation is a warning against being over confidant.  You need to take things more slowly. <br/></p>", "deleted": false}, {"id": 21399, "name": "Abundance", "definition": "<p>To dream of having an abundance of a certain item indicates that you need to conserve your resources and energies. This dream may be a compensatory dream for something that you are lacking in life.<font face=\"Arial\" size=\"3\" color=\"#000000\" style=\"font-size: medium;\"><font face=\"Arial\" size=\"3\">  More directly, abundance signifies happiness.</font></font><br/></p>", "deleted": false}, {"id": 21400, "name": "Abuse", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\" size=\"3\">To dream you are abusing someone suggests that your past actions will come back to haunt you. You may be expressing some regret or remorse over your actions.</font></p><p style=\"font-size: medium;text-align: left;\"><font size=\"3\" face=\"Arial\">To dream you are being verbally or physically abused suggests that you are feeling victimized in  a waking situation. You are being taking advantage of. <font face=\"Arial\" size=\"3\" color=\"#000000\"><font face=\"Arial\" size=\"3\"> </font></font></font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\" size=\"3\">Dreaming of animals being abused indicates that your own primal desires are being suppressed. You are unable to fully express an important part of who you are. Alternatively, the dream represents your helplessness in a situation.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\" size=\"3\">To see children being abused in your dream implies that you are lacking a voice for your own inner child. You feel that a part of your own childhood is lost.</font></p>", "deleted": false}, {"id": 21401, "name": "Abyss", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\" size=\"3\">To dream of an abyss signifies an obstacle that is creating much anxiety for you. You need to work through the difficulty and overcome this obstacle in your life.  Perhaps you are afraid of  &#34;taking the plunge&#34;.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\" size=\"3\">To dream that you are falling into an abyss symbolizes the depths of your subconscious.  You are afraid and/or uncertain as to what you will discover about yourself and about your hidden feelings and fears. The abyss may also represent your primal fears and feelings of &#34;falling into a pit of despair&#34;. Perhaps you are in a state of depression or wallowing in your negative feelings. Alternatively, the dream could denote your lack of spirituality.</font></p>", "deleted": false}, {"id": 21402, "name": "Acacia", "definition": "<p>To see an acacia tree in your dream symbolizes your attitudes with death and your sense of mortality.<br/></p>", "deleted": false}, {"id": 21403, "name": "Academy", "definition": "<p>To dream of an academy signifies new friendships and opportunities.<br/></p>", "deleted": false}, {"id": 21404, "name": "Academy Awards", "definition": "<p>To dream that you at the Academy Awards indicates that you need to add some glamour into your life. If you win an Oscar, then it implies that you are looking for some sort of acknowledgment in your waking life.<br/></p>", "deleted": false}, {"id": 21405, "name": "Accelerator", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\" size=\"3\">To see an accelerator in your dream indicates that you will achieve your goals through your own efforts. The dream may also be telling you to slow down.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\" size=\"3\">To dream that the accelerator is jammed or broken indicates a loss of control in some aspect of your life. You maybe trying to rush through things.</font></p>", "deleted": false}, {"id": 21406, "name": "Accent", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\" size=\"3\">To speak with an accent in your dream suggests that you are having difficulties conveying your thoughts. Consider how you feel about the accent. If you feel the accent makes you stand out in a negative way, then it signifies feelings of insecurities. If the accent makes you stand out in a positive way, then it symbolizes an air of confidence. </font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\" size=\"3\">To hear someone speaking with an accent in your dream represents something familiar yet different. You are getting the gist of a message, but you still do not completely understand all of it.</font></p>", "deleted": false}, {"id": 21407, "name": "Acceptance", "definition": "<p>To dream about acceptance indicates issues of self-esteem and measuring up to the expectations of others. There is a waking situation where you are seeking acceptance and wanting to be a part of.<br/></p>", "deleted": false}, {"id": 21408, "name": "Accessory", "definition": "<p>To dream of accessorizing yourself suggests that you are feeling incomplete. Something is missing in your life.<br/></p>", "deleted": false}, {"id": 21409, "name": "Accident", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\"><font size=\"3\">To dream that you are in an accident signifies pent-up guilt in which you are subconsciously punishing yourself over.</font> <font face=\"Arial\" size=\"3\">Perhaps you are not proud of something you have done. Alternatively, the accident may symbolize an error or mistake you have made. Accident dreams also represent your fears of being in an actual, physical accident. You may simply be nervous about getting behind the wheel. Or the dream is trying to warn you of some accident.</font></font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\" size=\"3\">To dream of a car accident symbolizes your emotional state. You may be harboring deep anxieties and fears. Are you &#34;driving&#34; yourself too hard? Perhaps you need to slow down before you hit disaster. You need to rethink or re-plan your course of actions and set yourself on a better path. Dreaming that someone is injured in a car accident means that you cannot control the action of others. They have to live with the consequences of their own decisions.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\" size=\"3\">To dream that a loved one dies in an accident indicates that something within your own Self is no longer functional and is &#34;dead&#34;. It is also symbolic of your own relationship with that person. Perhaps you need to let go of this relationship.<font face=\"Arial\" size=\"3\" color=\"#000000\"><font face=\"Arial\" size=\"3\"> </font></font>If you dream that you die from the car accident and actually see the reactions of your loved ones, then it suggests that your reckless activity is affecting those around you. This dream is a wake-up call.</font></p>", "deleted": false}, {"id": 21410, "name": "Accomplice", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\" size=\"3\">To dream that you are an accomplice to a crime suggests that someone in your waking life is having a negative influence on you. You may be experiencing feelings of guilt with something that you have done.  </font><font face=\"Arial\" size=\"3\" color=\"#000000\"><font face=\"Arial\" size=\"3\"> </font></font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\" size=\"3\" color=\"#000000\">To dream that you have an accomplice implies that others are enabling your negative habits or behavior.</font></p>", "deleted": false}, {"id": 21411, "name": "Accordion", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\" size=\"3\">To hear the music of an accordion signifies some saddening and depressing matter. You need to focus on more joyous moments.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\" size=\"3\">To dream that you play the accordion denotes intense emotions that are causing physical strain to your body. You are feeling weary. Alternatively, the dream suggests that you need to work hard to achieve your goals.</font></p>", "deleted": false}, {"id": 21412, "name": "Accountant", "definition": "<p>To see or dream that you are an accountant represents your objectivity toward some situation. You are taking a step back and looking carefully at the facts.<br/></p>", "deleted": false}, {"id": 21413, "name": "Accounts", "definition": "<p>To dream about your bank accounts indicates financial worries.<br/></p>", "deleted": false}, {"id": 21414, "name": "Accuse", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\" size=\"3\">To dream that you are being accused of something indicates overwhelming feelings of guilt.  It may also mean that you are having some doubts about yourself and the choices you are making.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\" size=\"3\">To dream that you accuse others signifies disagreements and dissension with those around you.</font></p>", "deleted": false}, {"id": 21415, "name": "Ace", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\" size=\"3\">To see the ace in a deck of cards suggests ambiguity in your life. You need some clarity. In particular, the ace of hearts means that you are involved in some love affair. If you see the ace of spades in your dream, then it means that you are involved in a scandal. If you see the ace of diamonds, then it symbolizes your legacy or reputation. And if you see the ace of clubs, then it indicates that you will be involved in some legal matter.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\" size=\"3\">Alternatively, the dream may be a metaphor that you are an &#34;ace&#34;. Or the dream is a pun on &#34;acing&#34; a test. </font></p>", "deleted": false}, {"id": 21416, "name": "Aches", "definition": "<p>To dream that you have aches indicate some hesitation and reluctance in the pursuit of your goals. If you wait too long, then the opportunity may escape.<br/></p>", "deleted": false}, {"id": 21417, "name": "Achievement", "definition": "<p>To dream of an achievement denotes that you will be greatly satisfied with the outcome of a situation or project. The bigger the achievement, the greater the satisfaction.<br/></p>", "deleted": false}, {"id": 21418, "name": "Acid", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\" size=\"3\">To see acid in your dream represents feelings of hatred, rage, and/or revenge. Your integrity may be compromised or called into question.  Alternatively, seeing acid in your dream indicates that you are being manipulated by a situation or by someone. The dream may also be a metaphor to symbolize a negative influence in your life. Something or someone is eating away at you. </font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\" size=\"3\">To dream that you drink acid indicates that you are emotionally paralyzed and need to learn how to express yourself.   </font></p><p style=\"font-size: medium;text-align: left;\"><font size=\"3\" face=\"Arial\">Dreaming of acid rain indicates that you have been mislead. You are letting hatred and revenge take over and define you.</font></p>", "deleted": false}, {"id": 21419, "name": "Acorn", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\" size=\"3\">To see an acorn in your dream symbolizes strength and durability. Seemingly small beginnings will have the greatest potential for growth. Don't underestimate your minor goals. Alternatively, the dream means that you are about to enter a new phase in your life. </font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\" size=\"3\">To dream that you are eating acorns or picking them from the ground suggests that you will enjoy the benefits of your success after long and hard work.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\" size=\"3\">To dream that you are shaking acorns from a tree indicates that you have significant influence on others.</font></p>", "deleted": false}, {"id": 21420, "name": "Acquaintance", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\" size=\"3\">To see an acquaintance in your dream represents aspects of yourself that you are still trying to get to know.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\" size=\"3\">To dream that you are disputing with an acquaintance represents aspects of yourself that you are rejecting. You are refusing to accept certain things about yourself.</font></p>", "deleted": false}, {"id": 21421, "name": "Acquit", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\" size=\"3\">To dream that you are acquitted of a crime represents a valuable lesson to be learned.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\" size=\"3\">To see others acquitted in your dream indicates that you need to balance your hard work with fun and pleasure.</font></p>", "deleted": false}, {"id": 21422, "name": "Acrobat", "definition": "<p>To see or do acrobats in your dream suggest that you need to better balance aspects of your life. It could also mean that fears will prevent you from achieving your goals. Alternatively, acrobatics in your dream may be a metaphor for sexual intercourse.<br/></p>", "deleted": false}, {"id": 21423, "name": "Acrylic Nails", "definition": "<p>If you are wearing fake fingernails in your dream then it suggest that you are reaching out to others, but do not have their best interest in mind. You may be acting in a disingenuous way.<br/></p>", "deleted": false}, {"id": 21424, "name": "Acting", "definition": "<p>To dream that you are acting indicates that you are putting up a front and pretending to be someone you are not in some waking situation.<br/></p>", "deleted": false}, {"id": 21425, "name": "Action Figure", "definition": "<p>To see or dream that you are playing with an action figure suggests that you are being manipulated in some way. Or you tend to do what other people expect of you. Also consider the significance of the way that the action figure is dressed.<br/></p>", "deleted": false}, {"id": 21426, "name": "Actor/Actress", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\" size=\"3\">To see an actor or actress in your dream represents your pursuit for pleasure. Your admiration of a particular celebrity may lead to a desire to have some of their physical or personality traits. Consider also who this actor/actress is and what characteristics you associate with her or him. These may be the same characteristics that you need to acknowledge or incorporate into yourself. The dream may also be a pun on her or his name. </font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\" size=\"3\">To dream that you are an actor denotes that your hard work and labor will be well worth it in the end. It also indicates your strong desires to be recognized and acknowledged. Perhaps you are putting too much emphasis on your outward appearances. Alternatively, the dream may be analogous to the role that you are playing in your real life, whether it be the role of a parent, sibling, co-worker, etc.  Or perhaps you are putting on an act or a facade.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\" size=\"3\">More specifically, if you dream that you are a supporting actor or supporting actress implies that you need to be supportive to those around you. It may seem that your presence doesn't matter, but you play an important part to someone's life. To dream that you are an extra in a movie means that you feel unimportant and unnoticed. Sometimes you feel you are blending in with the background. </font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\" size=\"3\">To see a particular actor or actress in your dream look at the role they are playing. Even though you may not know them on a personal level, how you perceive them or the characters they play can provide understanding in how it relates to you.</font></p>", "deleted": false}, {"id": 21427, "name": "Acupuncture", "definition": "<p>To dream that you are getting acupuncture suggests that you are in need of healing. You may need to divert your energies to different pursuits. Alternatively, the dream may be a metaphor for a problem or issue that you need to pinpoint.<br/></p>", "deleted": false}, {"id": 21428, "name": "Adam And Eve", "definition": "<p>To see Adam and Eve in your dream,  suggests that you are ignoring the masculine aspect of yourself (if you are female) or the feminine aspect of yourself (if you are male). Adam and Eve are classic symbols of the animus and anima. Alternatively, the dream indicates an occurrence in your life that will cause you to lose your hopes and chances of success.<span id=\"selectionBoundary_1607167627749_32967661266140635\" class=\"rangySelectionBoundary\">&#65279;</span><br/></p>", "deleted": false}, {"id": 21429, "name": "Adamant", "definition": "<p>To dream that you are adamant signifies that you will be thwarted in some desire that you held ever so highly in your life.<br/></p>", "deleted": false}, {"id": 21430, "name": "Adder", "definition": "<p>To see an adder in your dream symbolizes a sly or cunning person. This person cannot be trusted.  It may also represent something or someone who has slipped out of your hands. The dream may also be a pun on something that you need to add to your life.<br/></p>", "deleted": false}, {"id": 21431, "name": "Addict", "definition": "<p>To dream that you are an addict indicates that you are no longer in control of a situation. You have surrendered your power and denied responsibility for your actions. The dream is also representative of fear, low self-esteem issues, and insecurities. <br/></p>", "deleted": false}, {"id": 21432, "name": "Addiction", "definition": "<p>To dream that you have an addiction or become addicted represents an obsessive behavior.  A situation or a person may be trying to take over your sense of control. The dream also suggests that you have difficulty relating to the world around you.<br/></p>", "deleted": false}, {"id": 21433, "name": "Addition", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\" size=\"3\">To dream that you are solving an addition problem represents something that is straightforward or obvious. Do not read too much into a problem. </font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\" size=\"3\">To dream that you cannot add correctly indicates confusion and chaos. A more directly interpretation suggests that something in your waking life does not add up.</font></p>", "deleted": false}, {"id": 21434, "name": "Address", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\" size=\"3\">To dream of your old address suggests that you need to take a look back at the past and learn from it. To dream of a new address indicates the need for change.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\" size=\"3\">To dream that you are addressing an envelope represents your need to explore more possibilities. Weigh your options carefully before making a final decision. Alternatively, the dream suggests that you have found your direction in life and are ready to pursue your goals.</font></p>", "deleted": false}, {"id": 21435, "name": "Admiral", "definition": "<p>To see or dream that you are an admiral represents your ability to tackle life's issues and problems with confidence and decisiveness. The admiral may also symbolize a father figure or authoritative person. <br/></p>", "deleted": false}, {"id": 21436, "name": "Admire", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\" size=\"3\">To dream that you are admiring someone indicates that you need to incorporate the qualities of that person into your Self. </font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\" size=\"3\">To dream that you are admiring yourself suggests that you are in need of approval and affirmation from others. Alternatively, it may mean that you have a large ego or think overly highly of yourself.</font></p>", "deleted": false}, {"id": 21437, "name": "Adobe", "definition": "<p>To see an adobe structure in your dream symbolizes protection. It also implies that you are well insulated from life's problems. Perhaps you are being too sheltered and are lacking experience in certain areas of your life. Alternatively, an adobe building represents tradition, hard work and a simple way of life. Maybe you need to incorporate these qualities into your waking life.<br/></p>", "deleted": false}, {"id": 21438, "name": "Adopt", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\" size=\"3\">To dream that you or others are adopting a child indicates that you are taking on something new and different. Ask yourself what is missing in your life that would make you happy.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\" size=\"3\">To dream that you are adopted suggests that you are longing for the child within you. </font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\" size=\"3\">Dreaming of adopting a dog symbolizes your desire for a loyal relationship.</font><font face=\"Arial\" size=\"3\" color=\"#000000\"><font face=\"Arial\" size=\"3\">  If you are adopting a cat, then it means that you are embracing a newfound independence.</font></font></p>", "deleted": false}, {"id": 21439, "name": "Adulation", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\"><font size=\"3\">To dream that you seek adulation signifies that you will arrogantly step up to undeserved position of honor.</font>  </font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\" size=\"3\">To dream that you are offering adulation denotes that you are willing to part with something near and dear to you in the hopes of material advancement.</font></p>", "deleted": false}, {"id": 21440, "name": "Adult", "definition": "<p>If you are a child or teenager and dream that you are an adult, then it implies that you need to be more mature about some situation. Perhaps you have some growing up that you need to do. Alternatively, the dream may be reinforcing your sense of responsibility.<br/></p>", "deleted": false}, {"id": 21441, "name": "Adultery", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\" size=\"3\">To dream that you commit adultery or have an affair signifies your sexual urges and desires that are longing to be expressed. Alternatively, it indicates self-betrayal of your subconscious. You may find yourself entangled in a situation that is not in your best interest, perhaps even illegal. </font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\" size=\"3\">To dream that your mate, spouse, or significant other is cheating on you highlights your insecurities and your fears of being abandoned. You feel that you are being taken for granted. You are lacking attention in the relationship or that he or she is being less affectionate. Alternatively, you feel that you are not measuring up to the expectations of others.</font></p>", "deleted": false}, {"id": 21442, "name": "Advancement", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\" size=\"3\">To dream that you are advancing in some situation signifies your rapid rise to success and honor.  Affairs of the heart will also be in your favor.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\" size=\"3\">To see others advancing ahead of you denotes that others have more important and favorable positions. You need to stop constantly comparing yourself to others.</font></p>", "deleted": false}, {"id": 21443, "name": "B", "definition": "<p>To see the letter B in your dream is a pun on &#34;to be&#34;. Perhaps the dream is telling you to &#34;let it be&#34;.<br/></p>", "deleted": false}, {"id": 21444, "name": "Baboon", "definition": "<p style=\"font-size: medium;text-align: left;\"><font color=\"#000000\" face=\"Arial\">To see a baboon in your dream suggests that you need to be more expressive in your feelings. You need to be more direct in telling others how you feel. On the hand, it could be saying that you are expressing yourself in an inappropriate manner. </font></p><p style=\"font-size: medium;text-align: left;\"><font color=\"#000000\" face=\"Arial\">In particular, dreaming of a white <span id=\"IL_AD6\" class=\"IL_AD\" style=\"font-size: 16px !important;\">baboon</span> means that you are completely devoid of emotions.</font></p>", "deleted": false}, {"id": 21445, "name": "Baby", "definition": "<p><font face=\"Arial\" style=\"font-size: medium;\">To see a baby in your dream signifies innocence, warmth and new beginnings. Babies symbolize something in your own inner nature that is pure, vulnerable, helpless and/or uncorrupted. If you dream that the baby is smiling at you, then it suggests that you are experiencing pure joy. You do not ask for much to make you happy.</font><span style=\"font-size: medium;float: none;\"> </span><font face=\"Arial\" style=\"font-size: medium;\">If you find a baby in your dream, then it suggests that you have acknowledged your hidden potential.</font><br/></p><p></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">If you dream that you are on your way to the hospital to have a baby, then it signifies your issues of dependency and your desires to be completely cared for. Perhaps you are trying to get out of some responsibility. If you are pregnant in real life, then a more direct interpretation may simply mean that you are experiencing some anxieties of making it to the hospital when the time comes. </font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream of a crying baby symbolizes a part of yourself that is deprived of attention and needs to be nurtured. Alternatively, it represents your unfulfilled goals and a sense of lacking in your life. If you dream that a baby is neglected, then it suggests that you are not paying enough attention to yourself. You are not utilizing your full potential. Alternatively, this dream could represent your fears about your own children and your ability to protect and to provide for them. </font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream about a starving baby represents your dependence on others. You are experiencing some deficiency in your life that needs immediate attention and gratification.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see yourself or someone as a baby in your dream refers to your desire to be cared for and nurtured. Alternatively, the dream may mean that you or someone is behaving immaturely. </font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that a baby is walking or dancing refers to the potential and possibilities that life has in stored for you. The future looks bright. The dream may also be a metaphor that you need to take baby steps in your relationship, toward your goal, in a work project or whatever undertaking. If you have a baby in real life, then the dream is a reflection of your hopes for that baby.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream of an extremely small baby symbolizes your helplessness and your fears of letting others become aware of your vulnerabilities and incompetence. You may be <span id=\"IL_AD4\" class=\"IL_AD\" style=\"font-size: 16px !important;\">afraid</span> to ask for help and as a result tend to take matters into your own hands.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see a dead baby in your dream symbolizes the ending of something that was once a part of you. If you dream that you are trying to snort up a dead baby, then it means that you are refusing to move onto a new stage of life. You are holding onto a dead past. </font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are dipping a baby in and out of water sig<font size=\"3\">nifies regression. You are regressing to a time where you had no worries and responsibilities. Alternatively, such a scenario is reminisce of when the baby is in the fetus and in its comfort zone. In fact, some expectant mothers even give <span id=\"IL_AD9\" class=\"IL_AD\" style=\"font-size: 16px !important;\">birth</span> in a pool, because the environment in the water mimics the environment in the uterus. It is less traumatic for the baby as it emerges into the world. So perhaps, the dream represents your <span id=\"IL_AD1\" class=\"IL_AD\" style=\"font-size: 16px !important;\">search</span> for your own comfort zone.</font></font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">Dreaming of rescuing a drowning baby means that you are allowing yourself to be vulnerable and accepting help from others.</font><font face=\"Arial\" color=\"#000000\"> <font face=\"Arial\" size=\"3\"> </font></font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\" size=\"3\" color=\"#000000\">If you dream of having or adopting a baby of a different race, then it means that you are acknowledging and/or embracing other's physical differences.<font face=\"Arial\" size=\"3\"> </font>Everyone started out as a baby who is pure and innocent. </font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\" size=\"3\" color=\"#000000\">Seeing an evil baby or a demon baby in your dream implies that you are apprehensive or afraid of a new project that you are undertaking. You may be taking on more than you can handle. If you dream that a baby has a third eye on the back of the head, then it means getting caught.  You are acting carelessly when you think no on is watching.</font></p><p></p>", "deleted": false}, {"id": 21446, "name": "Baby Bottle", "definition": "<p>To see a baby bottle in your dream represents your issues of dependency. You are relying too much on others. If you are drinking from a baby bottle, then the dream means that you need are emotionally immature. You need to grow up.<br/></p>", "deleted": false}, {"id": 21447, "name": "Baby Carriage", "definition": "<p>To see a baby carriage in your dream symbolizes your desire for a family or longing for a baby. If the baby carriage is empty, then it indicates sadness or an unfulfilled goal. Alternatively, it suggests that you need to cater to the needs of your own inner child.<br/></p>", "deleted": false}, {"id": 21448, "name": "Baby Clothes", "definition": "<p>To see baby clothes in your dream suggests that you are expressing yourself in a more subtle way. Alternatively, baby clothes represent your former ways of thinking or old habits which you have outgrown.<br/></p>", "deleted": false}, {"id": 21449, "name": "Baby Food", "definition": "<p><font size=\"3\" style=\"font-size: medium;\">To</font><span style=\"font-size: medium;float: none;\"> see or feed baby food in your dream indicates that nurturance and care is needed in a waking situation. </span><span style=\"font-size: medium;float: none;\">Alternatively</span><span style=\"font-size: medium;float: none;\">, the dream may be a metaphor to indicate that you need to eat smaller portions of food.</span><br/></p><p></p><p>To eat or dream that you are being fed baby food indicates that you are being forced to re-learn something that you already know.<br/></p><p></p>", "deleted": false}, {"id": 21450, "name": "Baby Shower", "definition": "<p>To dream of a baby shower suggests that you are welcoming a new start. You are given a chance to start over again and do things differently this time around. You have a new found faith in life itself.<br/></p>", "deleted": false}, {"id": 21451, "name": "Babysitter", "definition": "<p style=\"font-size: medium;text-align: left;\"><font size=\"3\" face=\"Arial\">To dream that you are babysitting suggests that you need to care for the child within yourself.</font></p><p style=\"font-size: medium;text-align: left;\"><font size=\"3\" face=\"Arial\">To see or call for a babysitter in your dream indicates that you need to acknowledge and work on your inner child.</font></p>", "deleted": false}, {"id": 21452, "name": "Bachelor", "definition": "<p>To meet a bachelor in your dream suggests that you are seeking freedom in your love life.  For a man to dream that he is a bachelor indicates that he is having difficulty with gaining his own sense of self or freedom in a relationship. Alternatively, the bachelor represents your masculine side.<br/></p>", "deleted": false}, {"id": 21454, "name": "Back", "definition": "<p style=\"font-size: medium;text-align: left;\"><font size=\"3\" face=\"Arial\">To dream of your back represents your attitudes, strengths, burdens and stance in the world. It may also relate to stress and pressure that someone is putting on you.</font></p><p style=\"font-size: medium;text-align: left;\"><font size=\"3\" face=\"Arial\">To see a naked back in your dream symbolizes secrets that you may have kept from others or aspects of yourself that you have kept hidden and shielded away. Consider the phrase, &#34;watch your back!&#34;; this dream may be telling you to do just that. Traditionally, seeing a back in your dream forewarns that you should not lend money to anyone. In particular, lending money to friends will cause a rift in your relationship.</font></p><p style=\"font-size: medium;text-align: left;\"><font size=\"3\" face=\"Arial\">To see a person turn their back on you signifies that you will be deeply hurt as a result of envy and jealousy.</font><font face=\"Arial\" color=\"#000000\"> <font face=\"Arial\" size=\"3\"> </font></font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\" size=\"3\" color=\"#000000\">If you suffer from back pain, then you <font face=\"Arial\" size=\"3\">may have dreams of breaking your back or throwing your back out. Your dreams incorporate things from your waking life, even physical pain.</font></font></p>", "deleted": false}, {"id": 21453, "name": "Back-biting", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream of back-biting about someone warns that you will cause harm to someone if you continue on your current course. Think twice over your actions and its consequences.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that someone is back-biting you signifies that you will have some family problems.</font></p>", "deleted": false}, {"id": 21455, "name": "Backdoor", "definition": "<p>To see a backdoor in your dream suggests that you need to search a little harder to find an answer to your problem. Sometimes the solution may not be obvious.  Alternatively, the dream indicates that you are trying to find short cuts to do things.<br/></p>", "deleted": false}, {"id": 21456, "name": "Backflips", "definition": "<p><font size=\"3\" face=\"Arial\" style=\"font-size: medium;\">To dream that you are doing backflips suggests that you are going out of your way to help or please someone. You may feel under-appreciated or that your work is going unnoticed.</font><br/></p>", "deleted": false}, {"id": 21457, "name": "Backgammon", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see a backgammon game in your dream represents an unwelcome guest.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you lose at backgammon symbolizes misfortune and unlucky in love. You seem to seek out the wrong type of people and your pursuit for love will be a rocky path.</font></p>", "deleted": false}, {"id": 21458, "name": "Backpack", "definition": "<p>To see or carry a backpack in your dream represents the decisions and responsibilities  that are weighing your down.<br/></p>", "deleted": false}, {"id": 21459, "name": "Backpacking", "definition": "<p>To dream that you are backpacking symbolizes your self-sufficiency and survival skills. You may be reflecting on all the obstacles and adversities that you have overcame.<br/></p>", "deleted": false}, {"id": 21460, "name": "Backseat", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are sitting in the backseat of a car suggests that you are no longer in control of your life.  You may be feeling overpowered, dominated and being told what to do. You need to start taking back control of your life. </font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that someone is sitting in your backseat highlights your own position of power and control. Someone else's destiny or fate is in your hands. </font></p>", "deleted": false}, {"id": 21461, "name": "Backstab", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are backstabbing someone represents your ruthlessness. Your character is being called into question.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that someone has backstabbed you signifies feelings of insecurity. You have a lot going on in your life at the moment and believe someone is out to get you.</font></p>", "deleted": false}, {"id": 21462, "name": "Backstage", "definition": "<p>To dream that you are backstage symbolizes opportunities and access. You need to make sure to take advantage of this limited time opportunity. Alternatively, the dream indicates that there are aspects of yourself that you are reluctant to express or show.  Or it may also mean that you need to look at some situation or problem from a new perspective.<br/></p>", "deleted": false}, {"id": 21463, "name": "Backstroke", "definition": "<p>To drea<font size=\"3\" style=\"font-size: medium;\">m that you are doing the backstroke suggests that although you are acknowledging your emotions,  you are not confronting them head on.</font><br/></p>", "deleted": false}, {"id": 21464, "name": "Backward", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are walking or moving backwards indicates that your current course of action may be counter-productive. Whatever you are looking for in life seems to be moving away from you. Thus, you may feel a sense of failure or belief that you are unable to achieve your goals and aspirations. On the other hand, moving backwards in your dream indicate that you need to back off or retreat from a situation that you are currently facing in your waking life.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">Dreaming that you fall backwards suggests that you prevented yourself from making a bad decision or mistake. It may also mean that you are not ready to move forward and need to take a step back.</font></p>", "deleted": false}, {"id": 21465, "name": "Backyard", "definition": "<p>To dream about your backyard represents your childhood memories or your subconscious. Alternatively, dreaming of your backyard refers to the secrets you are keeping. There are some aspects of your life which you want to keep hidden and out of the view of others. The dream also represents some aspect of your life that you have taken for granted. Consider also the phrase &#34;not in my backyard.&#34; In other words, everything is okay as long as it does not happen to you or occur in your own home. The condition of the yard is also symbolic of how well you maintain and balance aspects of your life.<br/></p>", "deleted": false}, {"id": 21466, "name": "Bacon", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see bacon in your dream symbolizes essentials, staples, and life's supply. It may also be a play on the common phase &#34;bringing home the bacon&#34; to refer to earning a living.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see bacon that has gone rancid in your dream suggests a forbidden situation.</font></p>", "deleted": false}, {"id": 21467, "name": "Bad", "definition": "<p>To dream that you are feeling bad suggests that you are off balance, off centered, or even feeling worthless.<br/></p>", "deleted": false}, {"id": 21468, "name": "Bad Breath", "definition": "<p>To dream that you have bad breath suggests that you need to think twice before opening your mouth. Think about what you are saying first before expressing yourself and offending others.<br/></p>", "deleted": false}, {"id": 21469, "name": "Badge", "definition": "<p>To see or flash a badge in your dream represents recognition of your position. You are held in high honor and prestige. You regard yourself highly. Alternatively, it signifies your need to belong and to be part of something.<br/></p>", "deleted": false}, {"id": 21470, "name": "Badger", "definition": "<p>To see a badger in your dream signifies your persistence and final victory over your opponents. The dream may also be a pun on how you are badgering others or vice versa. Perhaps someone, especially someone of power is bothering you and giving you a difficult time.<br/></p>", "deleted": false}, {"id": 21471, "name": "Badminton", "definition": "<p>To play or watch a badminton game in your dream indicates that you need to make a decision quickly or else opportunities will pass you by.  You need to learn to keep up.<br/></p>", "deleted": false}, {"id": 21472, "name": "Bag", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see a bag in your dream represents the responsibilities that you carry. If the bag is ripped or torn, then it indicates that you are carrying a lot of burden. The symbol may be a metaphor for an &#34;old bag&#34; and refer to someone who is old.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream of a bag full of junk symbolizes that you are burdened with worries and problems; you have to find a way on unloading some of this burden.</font></p>", "deleted": false}, {"id": 21473, "name": "Bagel", "definition": "<p>To see or eat a bagel in your dream  suggests that there is key element missing from your life. You are not completely whole.  Alternatively, it refers to sexual urges.<br/></p>", "deleted": false}, {"id": 21474, "name": "Baggage", "definition": "<p>To see or carry baggage in your dream refers to the problems and things that you are carrying on your shoulders and weighing your down. You feel that you are being held back by past emotions or problems. Alternatively, baggage symbolizes your identity. <br/></p>", "deleted": false}, {"id": 21475, "name": "Baggage Claim", "definition": "<p>To dream that you are at baggage claim suggests that you are experiencing a lack of identity. You are not sure who you are or who you want to be.<br/></p>", "deleted": false}, {"id": 21476, "name": "Baggage Scanner", "definition": "<p>To see a baggage scanner or have your baggage scanned in your dream implies that your identity is under scrutiny. You feel you are being judge. Alternatively, the dream refers to a lack of privacy. You feel exposed.<br/></p>", "deleted": false}, {"id": 21477, "name": "Bagpipe", "definition": "<p>To see or hear bagpipes in your dream signify strength and virility. You will overcome your struggles. <br/></p>", "deleted": false}, {"id": 21478, "name": "Bail", "definition": "<p>To dream that you are making bail symbolizes your need to accept help in your business dealings. This dream is trying to make you acknowledge that it is perfectly all right to accept a helping hand.<br/></p>", "deleted": false}, {"id": 21479, "name": "Bailiff", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see a bailiff in your dream suggests that you have crossed a certain boundary and now must be held accountable for your actions.  </font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that a bailiff is arresting you signifies your need to improve your business ethics. Your integrity is being called into question. Alternatively, the dream points to conflict in your waking life. </font></p>", "deleted": false}, {"id": 21480, "name": "Bait", "definition": "<p><font size=\"3\" face=\"Arial\" style=\"font-size: medium;\">To see bait in your dream suggests that you may be fishing for a deal or a compliment. It may also indicate your desire to lure or entice someone.</font><font face=\"Arial\" style=\"font-size: medium;\"> </font><br/></p>", "deleted": false}, {"id": 21481, "name": "Bake-house", "definition": "<p>To see a bake-house in your dream signifies danger and pitfalls that you may be encountering in your waking life.<br/></p>", "deleted": false}, {"id": 21482, "name": "Bakery", "definition": "<p>To see a bakery in your dream signifies richness and success. Your future will be an enjoyable, pleasant and filled with satisfaction.<br/></p>", "deleted": false}, {"id": 21483, "name": "Baking", "definition": "<p>To dream that you are baking represents your creative self and your ability to make things happen. If you are mixing  ingredients together that you normally would not combine, then it suggests that you need to find a connection between two seemingly different things. Perhaps these things that seem incompatible may yield surprisingly but positive results.<br/></p>", "deleted": false}, {"id": 21484, "name": "Balaclava", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see or wear a balaclava in your dream refers to a sinister or painful secret you are keeping. This secret is creating a burden for you and becoming too hard to keep. Alternatively, wearing a balaclava refers to your desire for anonymity in a situation.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see someone in a balaclava represents the shadow aspect of your persona. It also points to fear that you have suppressed.</font></p>", "deleted": false}, {"id": 21485, "name": "Balance", "definition": "<p>To dream that you lose your balance suggests that you are having difficulty weighing your options and choices in some situation.<br/></p>", "deleted": false}, {"id": 21486, "name": "Balance Beam", "definition": "<p>To dream that you are walking on a balance beam indicates that there is a situation that requires your focus and full attention. Alternatively, the dream may  be a metaphor for the various aspects that you are trying to balance in your life.<br/></p>", "deleted": false}, {"id": 21487, "name": "Balcony", "definition": "<p>To see or dream that you are on a balcony refers to your desire to be seen and noticed.  You are searching for prestige and higher status. It may also mean that you are on your way up the social ladder. If the balcony is clean, then it indicates that you are looked up to by others. If the balcony is old, then it suggests that your public image is in need of repair. Alternatively, the balcony could signify your ambivalence regarding a situation. You are feeling torn or undecided.<br/></p>", "deleted": false}, {"id": 21488, "name": "Bald", "definition": "<p>To dream that you are going bald suggests a lack of self-esteem or worries about getting older. Alternatively, baldness symbolizes humility, purity, and personal sacrifice. You are at a stage in your life where you are confident in fully exposing yourself.<br/></p>", "deleted": false}, {"id": 21489, "name": "Ball", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see or play with a ball in your dream symbolizes completeness and wholeness. It may also indicate that you need to be more in tune with the inner child within. The dream may also be a metaphor for the testicles. Consider also the phrase, &#34;he's got balls&#34; to indicate guts and strength.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">If you dream of rolling a ball or see a ball rolling, then the dream may be metaphor that you need to put your plan into action. It is time to stop idling and start moving things along. </font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are watching a ball game indicates that you need to take more initiative. Your lack of action may  stem from your shyness which you must overcome. Perhaps you are too overly self-conscious. </font><font face=\"Arial\" color=\"#000000\"> </font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\" color=\"#000000\">T</font><font face=\"Arial\" size=\"3\"><font color=\"#000000\">o attend a ball in your dream refers to</font> your celebration of life. You are in a good place and are embracing what life has to offer</font><font face=\"Arial\">.</font></p>", "deleted": false}, {"id": 21490, "name": "Ball Pit", "definition": "<p style=\"font-size: medium;text-align: left;\"><font color=\"#000000\" face=\"Arial\">To see a ball pit in your dream symbolizes celebration, joy and youth, especially if there are children playing inside it. It is a reminder to be more carefree and spontaneous.</font></p><p style=\"font-size: medium;text-align: left;\"><font color=\"#000000\" face=\"Arial\">Dreaming that you are inside a ball pit implies that you need to put in your full effort toward a relationship or goal. Give it your all.</font></p>", "deleted": false}, {"id": 21491, "name": "Ballerina", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are a ballerina suggests that you are moving through the obstacles of your life effortlessly. You feel unrestricted. It is also a symbol of innocence, frailty, and vulnerability. Alternatively, you may feel unable to attain and measure up to society's ideals of beauty.  </font><font face=\"Arial\" color=\"#000000\"> <font face=\"Arial\" size=\"3\"> </font></font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\" size=\"3\" color=\"#000000\">To see someone you know as a ballerina indicates that this person is tiptoeing around certain issues instead of confronting it.</font></p>", "deleted": false}, {"id": 21492, "name": "Ballet", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are watching a ballet symbolizes balance, cooperation, and harmony.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see or wear ballet slippers in your dream represents your understanding of the principles of balance and grace. You carry yourself with much poise and get along well with others.</font></p>", "deleted": false}, {"id": 21493, "name": "Ballet Shoes", "definition": "<p>To see or wear ballet shoes in your dream means that you need to approach a certain problem or situation with attention, care and decisiveness. Wearing ballet shoes can also imply that you are well balanced and level headed.<br/></p>", "deleted": false}, {"id": 21494, "name": "Balloon", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see balloons in your dream indicate declining hopes and disappointments in your search for love. A situation in your life will take a turn downward. Balloons also represent arrogance and an inflated opinion of yourself. </font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you or someone is blowing up a balloon represents your aspirations, goals and ambitions. You are experiencing renewed hope.  </font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see black balloons in your dream symbolizes depression, especially if the balloons are descending.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see an ascending balloon in your dream signifies frustrating conditions in your life in which you are seeking to rise above. You are expressing a desire to escape. On a positive note, balloons symbolize celebration and festivities. You need to acknowledge your inner child.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see a balloon pop in your dream  symbolizes an unrealized goal or dream. It may also represent the stresses in your life. The pressure may be starting to be too great for you to bear.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see or dream that you are in a hot air balloon suggests that it is time to overcome your depression. The dream may be a metaphor indicating that you are losing your ground or your foothold on some situation/problem. Alternatively, it represents the process of  individuation and your quest to fulfill some spiritual needs. You feel the need to be elevated in someone's eyes.</font></p>", "deleted": false}, {"id": 21495, "name": "Ballot", "definition": "<p>To see a ballot in your dream represents a decision that needs to be made. If your name is on a ballot, then it indicates that you are seeking support, approval or acceptance.<br/></p>", "deleted": false}, {"id": 21496, "name": "Ballroom", "definition": "<p>To dream that you are in a ballroom refers to some festivity or celebration. You are having a good time and enjoying life. Alternatively, the dream implies openness. There are some aspect of your life that you need to be more open about.<br/></p>", "deleted": false}, {"id": 21497, "name": "Ballroom Dancing", "definition": "<p>To dream that you are ballroom dancing indicates success in your endeavors. You have a positive outlook in life and are willing try anything and give it your all.<br/></p>", "deleted": false}, {"id": 21498, "name": "Bamboo", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see bamboo in your dream symbolizes trustworthiness, strength and resilience. You are able to easily bounce back from setbacks and disappointments in your life. Alternatively, it refers to strong ties/bonds and fair dealings.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that the bamboo is soft or rotting suggests that there is imbalance in your waking life.</font></p>", "deleted": false}, {"id": 21499, "name": "Bananas", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see bananas in your dream may be a metaphor for repressed sexual urges and desires. It is a phallic symbol and represents masculine sexuality.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are eating bananas indicate that your hard work  will be met with little rewards or gains. </font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see banana peels in your dream implies that you need to be careful about slipping up and making a mistake. If the banana peels are rotting, then it represents some irreversible mistake.</font></p>", "deleted": false}, {"id": 21500, "name": "Band", "definition": "<p>To see a band or play with a band in your dream represents a sense of community and belonging. The dream may also be a pun on banding together and need for cooperation/unity. <br/></p>", "deleted": false}, {"id": 21501, "name": "Bandages", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you have bandages indicate your need to heal. You may be feeling emotionally wounded and are trying to cover/shield your hurt from others.  Consider where on the body was the bandage for more additional clues.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that someone is throwing bandages at you suggests that someone is causing you some emotional pain. You are hurting on the inside, but manage to keep a happy appearance on the outside.</font></p>", "deleted": false}, {"id": 21502, "name": "Bandana", "definition": "<p>To see or wear a bandana in your dream suggests that you need to look at issue or problem more objectively. You need to think through your options more carefully.<br/></p>", "deleted": false}, {"id": 21503, "name": "Bandit", "definition": "<p>To see or dream that you are a bandit indicates primitive sexuality and primal lust.<br/></p>", "deleted": false}, {"id": 21504, "name": "Banjo", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are playing a banjo represents togetherness. You need to cherish your time spent with friends.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To hear or see someone playing a banjo in your dream signifies a joyous and happy occasion.</font></p>", "deleted": false}, {"id": 21505, "name": "Bank", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see a bank in your dream denotes your desires for financial security. The dream may be trying to offer reassurance and that your fears of financial instability are unfounded.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are robbing a bank signifies that you are expending too much energy and are in danger of depleting your inner resources. Alternatively, it indicates that money that is due to you is being delayed.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">Dreaming that someone is robbing a bank or that you witness a bank robbery symbolizes lack of financial stability in your waking life.</font></p>", "deleted": false}, {"id": 21506, "name": "Banker", "definition": "<p>To see a banker in your dream suggests that you are experiencing financial difficulties or money problems and may be too proud to get help. You are feeling out of control.<br/></p>", "deleted": false}, {"id": 21507, "name": "Bankrupt", "definition": "<p>To dream that you are bankrupt indicates that you need to start taking measures to protect  yourself and your resources. You may be feeling emotionally drained or physically overworked. The dream may be a sign of depression. Alternatively, to dream that you are bankrupt symbolizes feelings of insecurity. <br/></p>", "deleted": false}, {"id": 21508, "name": "Banner", "definition": "<p>To see a banner in your dream indicates your willingness to stand up and fight for a cause or common goal. A banner also means the need for better organization and planning. <br/></p>", "deleted": false}, {"id": 21509, "name": "Banquet", "definition": "<p>To dream that you are at a banquet indicates that you are emotionally malnourished. You are seeking emotional stimulation.<br/></p>", "deleted": false}, {"id": 21510, "name": "Banyan", "definition": "<p>To see a banyan tree in your dream represents shelter and protection. It also denotes the connection between the spiritual and the earthly.<br/></p>", "deleted": false}, {"id": 21511, "name": "Baptism", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see a baby being baptized in your dream represents renewal, a new way of being, a new attitude toward life, or a new approach toward others. </font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are being baptized suggests that your sins and impure thoughts are being washed away. Perhaps you are feeling guilty about something that you have done and are seeking forgiveness. Immersion in water represents death, whereas emergence signifies resurrection. You need to let go of your old negative self, so that the new you can emerge and be successful. </font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">On a spiritual note, this dream signifies your renewed faith in God. You are coming closer to self-realization and spiritual fulfillment. </font></p>", "deleted": false}, {"id": 21512, "name": "Bar", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are at a public bar signifies your desire to escape from the stresses of your daily life and retreat into a light-hearted environment where pleasure abounds. Alternatively, you are seeking acceptance in some aspect of your daily life.  The dream may also be a pun on being &#34;barred&#34; from some place or something. You are feeling excluded or held back by circumstances beyond your control. </font></p><p style=\"font-size: medium;text-align: left;\"><font size=\"3\" face=\"Arial\">To see a metal bar in your dream represents your own inner strength. You have the ability and tools to build a solid foundation and future. Alternatively, metal bars symbolize defiance and aggression.</font></p>", "deleted": false}, {"id": 21513, "name": "Bar Mitzvah / Bat Mitzvah", "definition": "<p>To dream that you are at a bar mitzvah or bat mitzvah ceremony represents a transitional phase into adulthood.  It indicates your social responsibilities, sense of morality, mental reasoning, and hopes.<br/></p>", "deleted": false}, {"id": 21514, "name": "Barbarian", "definition": "<p>To see or dream that you are a  barbarian represents the savage and instinctual aspect of your character. Perhaps you are being a little too rough or brash. Alternatively, the dream may also refer to your sexuality and your wild side.<br/></p>", "deleted": false}, {"id": 21515, "name": "Barbecue", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream of a barbecue refers to a minor issue or transformation occurring in your waking life.  </font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are barbecuing symbolizes togetherness, relaxation, and ease.</font></p>", "deleted": false}, {"id": 21516, "name": "Barbed Wire", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see barbed wire in your dream represents difficulty in breaking through or getting your point across to someone.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are caught in barbed wire symbolizes oppression and confinement. You are feeling trapped and restricted in some relationship.</font></p>", "deleted": false}, {"id": 21517, "name": "Barber's Pole", "definition": "<p>To see a barber's pole in your dream indicates that you are contemplating a change in your life. Alternatively, the symbol represents some childhood memory or a piece of nostalgia.<br/></p>", "deleted": false}, {"id": 21518, "name": "Barbie Doll", "definition": "<p>To see a Barbie doll in your dream represents society's ideals.  You may feel that you are unable to meet the expectations of others.  Alternatively, the Barbie doll refers to the desire to escape from daily responsibilities. It may serve to bring you back to your childhood where life was much simpler and more carefree.<br/></p>", "deleted": false}, {"id": 21519, "name": "Barcode", "definition": "<p>To see a barcode in your dream symbolizes automation, simplification and ease. Alternatively, the dream represents an impersonal relationship in your waking  life. You are feeling alienated.<br/></p>", "deleted": false}, {"id": 21520, "name": "Bareback", "definition": "<p><font face=\"Arial\" style=\"font-size: medium;\">To dream that you are riding bareback represents your ability to balance several difficult tasks at once. Alternatively, to ride bareback in your dream also means that you give your all into a project or relationship. You don't take the easy route when it comes to doing things.</font><font face=\"Arial\" color=\"#000000\" style=\"font-size: medium;\"> </font><br/></p>", "deleted": false}, {"id": 21521, "name": "Barefoot", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are barefoot represents your playful attitudes and relaxed, carefree frame of mind. Alternatively, being barefoot indicates poverty, lack of mobility, or misunderstanding. You have low self-esteem and lack confidence in yourself. Or you may be dealing with issues concerning your self-identity. You are unprepared for what is ahead for you.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are walking barefoot on a construction site means that you are not ready to put in the work necessary to improve your mind or body. Perhaps you are in denial that you need any improvement.</font></p>", "deleted": false}, {"id": 21522, "name": "Bargain", "definition": "<p>To dream that you are bargaining for something indicates that you are being undervalued. Perhaps you are not putting in as much effort into a project or relationship as you should be.  Consider the symbolism of the item and how you feel about it in your dream.<br/></p>", "deleted": false}, {"id": 21523, "name": "Baritone", "definition": "<p>To hear a baritone voice in your dream indicates deceit and suspicion. You need to pay close attention to the words of the voice.<br/></p>", "deleted": false}, {"id": 21524, "name": "Bark", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To hear barking in your dream suggests that you are annoying those around you with grumpiness and fussiness. The dream may also be analogous to your tendency of barking orders at people, instead of asking or talking kindly. Alternatively, barking refers to unhappy and disgruntled companions. </font><font face=\"Arial\" color=\"#000000\"> <font face=\"Arial\" size=\"3\"> </font></font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\" size=\"3\" color=\"#000000\">Dreaming of the bark of a tree refers to your thick-skinned nature. <font face=\"Arial\" size=\"3\">If you dream of clothing that is made of tree bark, then it indicates that you are putting up a protective barrier. You are not letting others get too close. Alternatively, the dream may mean that you are one with nature.</font></font></p>", "deleted": false}, {"id": 21525, "name": "Barley", "definition": "<p>To see or eat barley in your dream signifies good health, progress, and satisfaction with your life.<br/></p>", "deleted": false}, {"id": 21526, "name": "Barn", "definition": "<p>To see a barn in your dream signifies the feelings that are kept in your subconscious. There is a possibility that you may be holding back your instinctual action or natural urges.<br/></p>", "deleted": false}, {"id": 21527, "name": "Barnacles", "definition": "<p>To see barnacles in your dream suggest that there is a situation you need to confront head on before it gets out of control.<br/></p>", "deleted": false}, {"id": 21528, "name": "Barometer", "definition": "<p>To see a barometer in your dream represents the state of your inner feelings and how you are coping with emotions or situations.<br/></p>", "deleted": false}, {"id": 21529, "name": "Barracks", "definition": "<p>To dream that you are living in barracks suggest that you are in a restrictive situation. You need to bring some change in your life.<br/></p>", "deleted": false}, {"id": 21530, "name": "Barrel", "definition": "<p>To see an empty barrel in your dream signifies unfulfilled needs and emotional emptiness. If there is something inside the barrel, consider the significance of the contents. If you are putting a stopper into a barrel, then it suggests that you need to hold onto what you have. Perhaps you are feeling a little instable or insecure about your position or status in life.<br/></p>", "deleted": false}, {"id": 21531, "name": "Barrette", "definition": "<p>To see or wear a barrette in your dream indicates that you are open to a new idea. Alternatively, you are ready to show the world a whole new you.<br/></p>", "deleted": false}, {"id": 21532, "name": "Barrier", "definition": "<p>To see a barrier in your dream represents an obstacle to your emotional growth. You may feel hindered in fully expressing yourself.  The dream may also indicate your resistance to change.<br/></p>", "deleted": false}, {"id": 21533, "name": "Barrister", "definition": "<p>To see a barrister with a white wig in your dream symbolizes wisdom and knowledge. The barrister may be a variation of the &#34;wise old man&#34; figure. You are looking for guidance and help in some area of your life.  Perhaps you are making an important decision.<br/></p>", "deleted": false}, {"id": 21594, "name": "C", "definition": "<p>To see the letter &#34;C&#34; in your dream symbolizes being average. It may also be a pun on &#34;seeing&#34;. The dream is drawing your attention to something that you need to see or take notice.<br/></p>", "deleted": false}, {"id": 21595, "name": "Cab", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are hailing a cab suggests that you need to ask for help in order to be able to move forward in some waking situation. </font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\" size=\"3\">To dream that you are in a cab indicates that you are being taken for a ride. Someone is taking advantage of you.</font></p>", "deleted": false}, {"id": 21596, "name": "Cabana", "definition": "<p>To see or dream that you are in a cabana signifies your need for an escape or vacation. You may be feeling overwhelmed by a waking problem and need some downtime.<br/></p>", "deleted": false}, {"id": 21597, "name": "Cabaret", "definition": "<p>To watch a cabaret in your dream indicates your need to acknowledge your sensual side.<br/></p>", "deleted": false}, {"id": 21598, "name": "Cabbage", "definition": "<p>To see or eat cabbage in your dream suggests that you should not waste time with petty things in your life. You live and thrive on life's challenges. Alternatively, the dream refers to your unwise choices or decisions. You need to rethink some of your decisions.<br/></p>", "deleted": false}, {"id": 21599, "name": "Cabin", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see or dream that you are in a wood cabin indicates that you will succeed via your own means.  It suggests that you are self-reliant and independent, yet still remain humble. You prefer the simpler things in life.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are in a ship cabin indicates that are seeking some refuge from your emotions.</font></p>", "deleted": false}, {"id": 21600, "name": "Cabinet", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see a cabinet in your dream symbolizes the female body and/or the womb. Alternatively, you may be hiding some family or personal secret. Consider the contents and condition of the cabinet for more clues. </font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that someone rearranged your cabinets suggests that somebody is overstepping your boundaries.</font></p>", "deleted": false}, {"id": 21601, "name": "Cable", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see a cable in your dream represents your stamina and durability. If the cable is frayed or broken, then it signifies a lack of strength.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream of cable television signifies your openness and how you communicate with others.</font></p>", "deleted": false}, {"id": 21602, "name": "Cable Car", "definition": "<p>To see or ride in a cable car in your dream signifies the compromises that you make in life. Sometimes you have to go along with the masses in order to maintain the peace. Alternatively, the dream represents life's journey. You are headed in the right direction.<br/></p>", "deleted": false}, {"id": 21603, "name": "Caboose", "definition": "<p>To see or be in a caboose implies that you are last in line for something. You are feeling shortchanged. Alternatively, dreaming of a caboose serves as a reminder that you will eventually get to where you need. It is not always about being first or finishing first.<br/></p>", "deleted": false}, {"id": 21604, "name": "Cackle", "definition": "<p>To hear the sound of cackling in your dream signifies illness and loss.<br/></p>", "deleted": false}, {"id": 21605, "name": "Cactus", "definition": "<p>To see a cactus in your dream suggests that you are feeling invaded, that your space is being crowded into and that you are being suffocated.  The prickly spines of the cactus represent the boundary you are trying to establish between your personal and private. Or you feel the need to defend yourself in some way. Alternatively, the dream implies that  you have found yourself in a sticky situation. Perhaps you need to adapt to your existing circumstances instead of trying to change them.<br/></p>", "deleted": false}, {"id": 21606, "name": "Cadaver", "definition": "<p style=\"font-size: medium;text-align: left;\"><font size=\"3\" face=\"Arial\">To dream that you are dissecting a <span id=\"IL_AD8\" class=\"IL_AD\" style=\"font-size: 16px !important;\">cadaver</span> indicates that you are ready to reveal or expose an aspect of yourself that you have been hiding.</font></p><p style=\"font-size: medium;text-align: left;\"><font size=\"3\" face=\"Arial\">To see a cadaver in your dream represents a part of yourself that has died. Alternatively, dreaming of a cadaver means that you tend to give everything you have in a situation or relationship.</font></p>", "deleted": false}, {"id": 21607, "name": "Cadillac", "definition": "<p>To see a Cadillac in your dream suggests that you are driven to succeed. Your ambition will take you far in life.<br/></p>", "deleted": false}, {"id": 21608, "name": "Caduceus", "definition": "<p>To see a caduceus in your dream symbolizes health concerns. The dream may be telling you that you need to take better care of yourself.<br/></p>", "deleted": false}, {"id": 21609, "name": "Caesarian Section", "definition": "<p>To dream that you are having a caesarian section implies that you need help in order to get your idea or project off the ground. You can not do it by yourself. A more direct interpretation of this dream may represent your anxieties of having a C-section in real life.<br/></p>", "deleted": false}, {"id": 21610, "name": "Cafe", "definition": "<p>To dream that you are at a cafe represents your social life. The dream is telling you that it is time to call up old friends and catch up with what they are all up to.<br/></p>", "deleted": false}, {"id": 21611, "name": "Cafeteria", "definition": "<p><font face=\"Arial\" style=\"font-size: medium;\">To dream that you are in a cafeteria denotes that there may be a lot of issues &#34;eating&#34; you up inside.</font><font color=\"#000000\" face=\"Arial\" style=\"font-size: medium;\"> </font><br/></p>", "deleted": false}, {"id": 21612, "name": "Cage", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are in a cage indicates that you are experiencing inhibitions and powerlessness in some areas of your life. You are feeling restricted, confined and restrained in a current relationship or business deal. Somebody may be keeping a short leash on you, where you are lacking the freedom to act independently. </font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are putting a wild animal into a cage signifies that you will succeed in overcoming your rivals and fears. It is also symbolic of your ability to control you animalistic rages and anger. </font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see a bird in a cage suggests that you are feeling limited in your expression and a sudden lost of freedom. You may be experiencing frustrations and an inhibited spirituality. The dream may also imply that you are feeling like a &#34;jail bird&#34;.</font></p>", "deleted": false}, {"id": 21613, "name": "Cage Fighting", "definition": "<p style=\"font-size: medium;text-align: left;\"><font size=\"3\" face=\"Arial\">To dream that you are cage fighting indicates that you are feeling restricted or confined in a current relationship. An aspect of yourself is fighting to be expressed or let out.</font></p><p style=\"font-size: medium;text-align: left;\"><font size=\"3\" face=\"Arial\">To watch a cage fight represents conflicting ideas or beliefs.</font></p>", "deleted": false}, {"id": 21614, "name": "Cake", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see a cake in your dream indicates that you need to learn to share and allocate your workload instead of trying to do everything yourself.  Cakes also symbolize selfishness or the feeling of not getting your fair share. More positively, the dream may represent your <span id=\"IL_AD2\" class=\"IL_AD\" style=\"font-size: 16px !important;\">accomplishments</span> and achievements. Consider also the metaphor a &#34;piece of cake&#34; or some situation that is easy.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see a partially eaten cake in your dream signifies missed and lost opportunities.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are buying a cake suggests that you have accepted the rewards and recognition you are getting for our work.  You are learning to be comfortable in the spotlight.</font></p>", "deleted": false}, {"id": 21615, "name": "Calamari", "definition": "<p>To dream that you are eating calamari indicates that you are feeling battered or beaten. However, you are tough. Hang in there!<br/></p>", "deleted": false}, {"id": 21616, "name": "Calculator", "definition": "<p>To see a calculator in your dream suggests that you need to thoroughly think through some problem and carefully evaluate your choices.  You need to lay out some sort of plan or outline. The symbol may also be a metaphor for someone who is &#34;calculating&#34;, cunning and scheming.<br/></p>", "deleted": false}, {"id": 21617, "name": "Calendar", "definition": "<p>To see a calendar in your dream represents the passing of time and past events. The dream may also be a reminder of a special event, appointment or important date in your waking life.<br/></p>", "deleted": false}, {"id": 21618, "name": "Calf", "definition": "<p>To see a calf in your dream symbolizes immaturity and inexperience. You need to develop certain qualities.<br/></p>", "deleted": false}, {"id": 21619, "name": "California", "definition": "<p>Known as the Golden State, to dream of California, refers to your desire for instant wealth. It may also suggests that you are looking for fame. If you live in California, then the dream may just be a reflection of your reality.<br/></p>", "deleted": false}, {"id": 21620, "name": "Caliper", "definition": "<p>To see or use a caliper in your dream reflects your concerns about not measuring up to the standards or expectations of others. Alternatively, dreaming of a caliper means that you need to be careful in making a decision or judgment.<br/></p>", "deleted": false}, {"id": 21621, "name": "Calla Lily", "definition": "<p>To see calla lilies in your dream symbolize new beginnings, rebirth and longevity. In particular, a white calla lily represents purity, simplicity or elegance. Alternatively, the calla lily refers to a commitment. <br/></p>", "deleted": false}, {"id": 21622, "name": "Calling Card", "definition": "<p>To see or use a calling card in your dream indicates that there is someone that you need to reach out to. If the calling card has the name of someone you know on it, then it means that their presence is with your spiritually, even though they may not be with you physically. Something in your waking life is reminding you of this person.<br/></p>", "deleted": false}, {"id": 21623, "name": "Calluses", "definition": "<p>To dream that you have calluses symbolize hard work. You have be laboring over a difficult task or situation.<br/></p>", "deleted": false}, {"id": 21624, "name": "Calm", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are calm denotes a fulfilling life. You find contentment and satisfaction in what you have.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that someone is trying to calm you down suggests  that you will experience many setbacks, especially if you continue to let your emotions run out of control.</font></p>", "deleted": false}, {"id": 21625, "name": "Calomel", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see calomel in your dream indicates a rivalry.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are taking calomel signifies that you are being manipulated and taken advantage of. It is time to open your eyes and not allow yourself to be stepped on.<span id=\"selectionBoundary_1609603837568_05039315530618382\" class=\"rangySelectionBoundary\">&#65279;</span></font></p>", "deleted": false}, {"id": 21626, "name": "Calves", "definition": "<p><font face=\"Arial\" style=\"font-size: medium;\">To see your calves in your dream symbolize movement and your ability to jump from situation to situation. In particular, if you are admiring your own calves, then it denotes a needy or codependent relationship.<span id=\"selectionBoundary_1609603852689_32270815497340255\" class=\"rangySelectionBoundary\">&#65279;</span></font><br/></p>", "deleted": false}, {"id": 21627, "name": "Camel", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see a camel in your dream denotes that you need to be more conservative; you are carrying too many responsibilities, burdens and problems on your shoulders. Consider the common phrase, &#34;the straw that broke the camel's back&#34;. You tend to hold on and cling on to your emotions instead of expressing and releasing them. Learn to forgive and forget. Alternatively, the camel represents your stamina. </font></p><p style=\"font-size: medium;\"><font face=\"Arial\">To dream that you are petting a camel indicates that you are ready to let go of some of the burdens, responsibilities or emotional baggage that you are carrying around.</font></p>", "deleted": false}, {"id": 21628, "name": "Cameo", "definition": "<p>To see or wear a cameo in your dream represents an aspect of yourself that you are trying to express. Perhaps you are showing your delicate and feminize side. Alternatively, the dream may be a pun on a &#34;cameo&#34; appearance that you are making at some social gathering.<br/></p>", "deleted": false}, {"id": 21629, "name": "Camera", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see a camera in your dream signifies your desires to cling on and/or live in the past. Alternatively, it may indicate that you need to focus on a particular situation. Perhaps you need to get a clearer picture or idea.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that the camera is broken indicates that you are ignoring an issue or refusing to see the big picture.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you cannot find your camera to take a picture implies that you are not focusing on the matter at hand. Your attention is too easily diverted. Alternatively, the dream refers to forgotten memories.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\" size=\"3\">To see or dream that you are on a hidden camera indicates that you feel that you are being scrutinized. All eyes are on you.</font></p>", "deleted": false}, {"id": 21630, "name": "Camouflage", "definition": "<p><font face=\"Arial\" style=\"font-size: medium;\">To dream that you are in camouflage suggests that you are hiding  your true self and feelings. You are concealing who you really are. Alternatively, there is a situation in your waking life that is making you want to blend into the background and not get noticed.</font><font color=\"#000000\" face=\"Arial\" style=\"font-size: medium;\"> </font><br/></p>", "deleted": false}, {"id": 21631, "name": "Camper", "definition": "<p>To dream that you are living in a camper indicates that you need to move on with some situation or some aspect of your life. You may be dwelling on a situation and it is time to move forward. Alternatively, you may be expressing your desire to be more independent and self-sufficient.<br/></p>", "deleted": false}, {"id": 21632, "name": "Campfire", "definition": "<p>To start or see a campfire in your dream represents sharing and companionship. You need to open yourself to others and allow others to get to know you.<br/></p>", "deleted": false}, {"id": 21633, "name": "Camping", "definition": "<p>To dream that you are camping indicates a need for relaxation and a long-deserved break.  You need to be more in touch with nature and go back to a more basic and simpler life. Alternatively, it refers to your social circle and support group. You are looking for a sense of belonging, but at the same time be self-sufficient and independent.<br/></p>", "deleted": false}, {"id": 21634, "name": "Campus", "definition": "<p><font face=\"Arial\" style=\"font-size: medium;\">To dream that you are on a campus indicates your need to expand your thinking/knowledge and challenge yourself mentally.</font><font color=\"#000000\" face=\"Arial\" style=\"font-size: medium;\"> </font><br/></p>", "deleted": false}, {"id": 21635, "name": "Can", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see a can in your dream indicates that there is something in your past that you need to hold on to and preserve. The dream may also be a pun on how you &#34;can&#34; do something. Don't underestimate your abilities and talents.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see canned foods in your dream symbolizes the emotions that you are keeping inside.</font></p>", "deleted": false}, {"id": 21636, "name": "Can Opener", "definition": "<p><font face=\"Arial\" style=\"font-size: medium;\">To see a can opener in your dream indicates your willingness to accept new ideas and new concepts. It may also be a symbol of reassurance and a way to tell yourself that &#34;I can&#34; do something.</font><font color=\"#000000\" face=\"Arial\" style=\"font-size: medium;\"> </font><br/></p>", "deleted": false}, {"id": 21637, "name": "Canada", "definition": "<p>To dream that you are in Canada depends on your own personal associations with the country. If you have never been to Canada, then you will need to draw on your own preconceptions and feelings of the country. <br/></p>", "deleted": false}, {"id": 21638, "name": "Canal", "definition": "<p>To see a canal in your dream symbolizes restraint and constricted emotions. It also suggests that you are unyielding in your thinking and beliefs, which may hinder you in the pursuit of your goals. You are being too controlling.<br/></p>", "deleted": false}, {"id": 21639, "name": "Canary", "definition": "<p><font face=\"Arial\" style=\"font-size: medium;\">To see a canary in your dream represents happiness and harmony. Alternatively, the dream could indicate your desires for a relationship or that a new relationship is blossoming.<span id=\"selectionBoundary_1609604087902_5821946129570916\" class=\"rangySelectionBoundary\">&#65279;</span></font><br/></p>", "deleted": false}, {"id": 21640, "name": "Cancel", "definition": "<p style=\"font-size: medium;text-align: left;\"><font size=\"3\" face=\"Arial\">To dream that you are canceling an appointment or plans suggests that you are afraid to confront some matter. You don't want to face the facts.</font></p><p style=\"font-size: medium;text-align: left;\"><font size=\"3\" face=\"Arial\">Dreaming that your flight was cancelled indicates that you are feeling helpless or trapped by some situation. You feel you are being held back, either physically or mentally.</font></p>", "deleted": false}, {"id": 21641, "name": "Cancer", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you have cancer denotes hopelessness, grief, self-pity, and unforgiveness. You feel you are wasting your life away. This dream also represents areas in your life which are bothering you, disturbing you, and hurting you in some emotional way. An emotional issue is eating away at you.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are being treated for cancer signifies a positive change in your life.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that someone has cancer indicates that you need to change your negative way of thinking before it eats away at you. Start being more positive. </font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\" size=\"3\">To dream that someone is a Cancer sign symbolizes your tendency to keep and hold on to everything. You have a lot of power and influence. The Cancer sign also indicates that you tend to be sensitive, moody and emotional. You are also very family oriented.</font></p>", "deleted": false}, {"id": 21642, "name": "Candle", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see a burning candle in your dream signifies that good luck and hope will be coming your way in small and steady amounts. You are in a comfortable stage in your life and may be seeking spiritual enlightenment. Lit candles are also symbolic of intellect, enlightenment, awareness or the search for truth.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see an unlit candle denotes feelings of rejection or disappointments. You are not utilizing your fullest potential. If you try to light the candle, but it won't light, then it represents grief. You are in denial about something.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see a candle blow out in your dream indicates that you are surrendering a significant aspect of yourself. You are letting go of something that used to be important to you.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To watch the candle burn down to nothing in your dream signifies your fears of aging and dying. Alternatively, it represents a fear of sexual impotence.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\" size=\"3\">To see a red colored candle in your dream symbolizes some intimate or romantic relationship. You may not be giving the relationship a fair chance and are dismissing it before you invested sufficient time to learn more about the other person. On the other hand, you may just not be feeling any chemistry or passion.</font></p>", "deleted": false}, {"id": 21643, "name": "Candle Wax", "definition": "<p>To see candle wax in your dream indicates that there is too much activity going on in your life. You may need to slow down and take a breather. Alternatively, it may symbolize the passage of time.<br/></p>", "deleted": false}, {"id": 21644, "name": "Candy", "definition": "<p>To see or eat candy in your dream symbolizes the joys and the special treats in life. It also represents indulgence, sensuality and/or forbidden pleasure. You may be devoting too much time to unimportant issues. A more direct interpretation suggests that you are eating too much candy and sweets.<br/></p>", "deleted": false}, {"id": 21645, "name": "Candy Apple", "definition": "<p><font face=\"Arial\" style=\"font-size: medium;\">To see or eat a candy apple in your dream is a reminder that you can have too much of a good thing. You need to show restraint in some area of your life.</font><font color=\"#000000\" face=\"Arial\" style=\"font-size: medium;\"> </font><br/></p>", "deleted": false}, {"id": 21646, "name": "Cane", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see or use a cane in your dream suggests that you are in need of some support and advice. The cane may also represent someone you trust and can rely on.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are being caned indicates that you are being forced into submission or obedience. Someone is trying make an example of you. Alternatively, the dream symbolizes self-guilt.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are caning someone signifies pent up aggression. Pay attention at who you are caning. You may harbor some ill feeling or anger toward this person. This person could also represent an aspect of your own self. </font></p>", "deleted": false}, {"id": 21647, "name": "Canned Food", "definition": "<p>To see or eat canned food in your dream implies that you are keeping your emotions bottled up inside. You feel that it is not the appropriate time to express your true desires.<br/></p>", "deleted": false}, {"id": 21648, "name": "Cannibalism", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see cannibalism in your dream symbolizes a destructive and forbidden desire or obsession. Metaphorically, cannibals consume people's lives, along with their energy. Thus, this dream may then denote an aspect of your life (career, relationship, children, etc ), which is consistently draining your enthusiasm and vitality.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are a victim of cannibalism represents feelings of being &#34;eating alive&#34; by work, a relationship or a situation in your waking life.</font></p>", "deleted": false}, {"id": 21649, "name": "Cannon", "definition": "<p>To see a cannon in your dream suggests that there is something drastic that needs to be done immediately. According to the Freudian school of thought, the cannon symbolizes the penis.<br/></p>", "deleted": false}, {"id": 21650, "name": "Cannonball", "definition": "<p>To see a cannonball in your dream indicates that you are harboring some anger or aggression and it is weighing your down.<br/></p>", "deleted": false}, {"id": 21651, "name": "Canoe", "definition": "<p>To see a canoe in your dream represents serenity simplicity, and independence. It is also a reflection of your emotional balance. You are moving ahead via your own power and determination.<br/></p>", "deleted": false}, {"id": 21652, "name": "Canopy", "definition": "<p><font face=\"Arial\" style=\"font-size: medium;\">To see a canopy in your dream symbolizes protection. You may also be elevated to a prominent position.<span id=\"selectionBoundary_1609604314217_9732728221449762\" class=\"rangySelectionBoundary\">&#65279;</span></font><br/></p>", "deleted": false}, {"id": 21653, "name": "Cantaloupe", "definition": "<p>To see or eat cantaloupe in your dream implies that you put forth a tough image, but are sensitive on the inside. Metaphorically, cantaloupes can refer to the breasts.<br/></p>", "deleted": false}, {"id": 21654, "name": "Canteen", "definition": "<p>To see or use a canteen in your dream suggests that you are looking to easily and conveniently satisfy your emotional needs.<br/></p>", "deleted": false}, {"id": 21655, "name": "Canvas", "definition": "<p>To see a canvas in your dream symbolizes potential and possibilities, especially if the canvas is blank. Consider the significance of what is on the canvas, as it is an aspect of your subconscious.<br/></p>", "deleted": false}, {"id": 21656, "name": "Canyon", "definition": "<p><font face=\"Arial\" style=\"font-size: medium;\">To see a canyon in your dream represents your subconscious mind and hidden feelings. It may point to emotions and relationships that you did not recognize.</font><font color=\"#000000\" face=\"Arial\" style=\"font-size: medium;\"> </font><br/></p>", "deleted": false}, {"id": 21657, "name": "Cap", "definition": "<p>To see a cap in your dream signifies informality and ease. It also suggests that you need to be more tolerant of others.<br/></p>", "deleted": false}, {"id": 21658, "name": "Cap And Gown", "definition": "<p>To wear a cap and gown in your dream indicates that you are transitioning into a higher level in your life. You are ready to move on to the next stage. <br style=\"font-size: medium;\"/><br style=\"font-size: medium;\"/>To see someone in a cap and gown in your dream symbolizes your successes and accomplishments.<br/></p>", "deleted": false}, {"id": 21659, "name": "Cape", "definition": "<p><font face=\"Arial\" style=\"font-size: medium;\">To see or dream that you are wearing a cape indicates that you are trying to shield yourself from being emotionally hurt. It may also mean that you are trying to cover-up or hide something.<span id=\"selectionBoundary_1609604419858_9930818564718731\" class=\"rangySelectionBoundary\">&#65279;</span></font><br/></p>", "deleted": false}, {"id": 21660, "name": "Capricorn", "definition": "<p>To dream that someone is a Capricorn signifies fears of inadequacy. You are afraid that you are not measuring up. Alternatively, it denotes your drive, tenacity and ambition.<br/></p>", "deleted": false}, {"id": 21661, "name": "Capsize", "definition": "<p>To dream that your boat has capsized represents your avoidance in confronting uncomfortable feelings and/or situations.<br/></p>", "deleted": false}, {"id": 21662, "name": "Captain", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are a captain indicates that you are taking charge of your emotions and confronting the issues that are bothering you.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see a captain in your dream represents your powerful influence over others.</font></p>", "deleted": false}, {"id": 21663, "name": "Captive", "definition": "<p>To dream that you are held captive suggests that you are feeling trapped in some aspect or circumstances of your waking life. You may feel trapped in your career, relationship or life in general. Alternatively, captivity dreams indicate something you are refusing to acknowledge or something that you are in denial about.<br/></p>", "deleted": false}, {"id": 21664, "name": "Car", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are driving a car denotes your ambition, your drive and your ability to navigate from <font size=\"3\">one stage of your life to another. Consider how smooth or rough the car ride is. If you are driving the car, then you are taking an active role in the way your life is going. However, if you are the passenger, then you are taking a passive role. If you are in the backseat of the car, then it indicates that you are putting yourself down and are allowing others to take over. This may be a result of low self-esteem or low self-confidence.  Overall, this dream symbol is an indication of your dependence and degree of control you have on your life.</font></font></p><p style=\"font-size: medium;text-align: left;\"><font size=\"3\" face=\"Arial\">Driving a new car means that you are headed toward a new direction or goal. You are deviating from your original life path.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\" size=\"3\">To dream that you drive your car into a body of water or that it rolls into water implies that you are in for an emotional journey. </font><font face=\"Arial\">To see a car underwater in your dream points to feelings of regret or sadness over an abandoned goal.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that your car is buried suggests that you are feeling weary about pursing someone else's dreams instead of your own. You are afraid to let others down.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that your car flipped over or rolled over implies that some significant event is preventing you from achieving your goals. You feel that you have to put your own life on hold.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see or dream that a car is being crushed represents disappointments occurring in your waking life. You are lacking ambition and goals.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\" size=\"3\">To dream that your car won't start indicates that you are feeling powerless in some situation.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\"><font size=\"3\">To dream that you forget or can't find where you parked your car indicates that you are dissatisfied or unhappy with an aspect of your waking life. You do not know what you really want to do with your life or where you want to go.</font>  </font></p><p style=\"font-size: medium;text-align: left;\"><font size=\"3\" face=\"Arial\">To dream that your car has been stolen indicates that you are being stripped of your identity.  This may relate to losing your job, a failed relationship, or some situation which has played a significant role in your identity and who you are as a person. If you dream that you are stealing a car, then it implies that you are trying to take credit for someone else's work. It may also mean that you are downplaying the role that others had in your success. </font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\" size=\"3\">To dream that your car is overheating suggests that you are expending too much energy. You need to slow down or run the risk of being burnt out. You are taking on more than you can handle. It is time to take a breather. </font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\" size=\"3\">To see a parked car in your dream suggests that you need to turn your efforts and energies elsewhere. You may be needlessly spending your energy in a fruitless endeavor. Alternatively, a parked car may symbolize your need to stop and enjoy life. </font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\"><font size=\"3\">To dream that you are almost hit or were ran over by a car suggests that your lifestyle, beliefs or goals may be in conflict with another's. It may also be symbolic of a jo</font>lting experience or injured pride. If you dream that you hit or ran over someone with a car, then it implies that you have hurt someone in order to move ahead in life.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are unable to roll up the windows of your car suggests that  you are showing some hesitation and reservation about the direction that you are taking in life or the path that you have chosen.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\" size=\"3\">To see a haunted car in your dream represents unfinished goals. You had started off on a path or journey, but never reached the end. Perhaps life had taken you on a different direction that you had planned or intended.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\" size=\"3\">To dream that no one is driving a moving car suggests that you need to reassess your level of control over your life. You are unwilling to take responsibilities for your actions.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\" size=\"3\">To buy a car in your dream refers to your commitment to some important life decision you have made.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\" size=\"3\">To see or drive a car that looks like a cat refers to your free and independent spirit. If you are almost hit by a car that looks like a cat, then it suggests that you are hindering someone's goals or not letting them be who they are.</font></p><p style=\"font-size: medium;text-align: left;\"><font color=\"#000000\" face=\"Arial\">If you dream of driving a black colored car, then it means that you like to be low-key about your intentions or goals. Driving a black color in a dream signify some ulterior motives.</font></p><p style=\"font-size: medium;text-align: left;\"><font color=\"#000000\" face=\"Arial\">Dreaming of a car that is driving fast suggests that you need to slow down and think through your choices. You are so focused on your goals that you are leaving behind the people around you.</font></p>", "deleted": false}, {"id": 21665, "name": "Car Alarm", "definition": "<p>To hear or set off a car alarm in your dream implies that you are headed on the wrong path. The dream is alerting you to change  your direction and alter your course.<br/></p>", "deleted": false}, {"id": 21666, "name": "Car Battery", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see your car battery in your dream symbolizes your stamina.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that your car battery is dead suggests that you are overwhelmed and overworked. You need to slow down and set some time for yourself or else run the risk of collapsing from exhaustion.</font></p>", "deleted": false}, {"id": 21667, "name": "Car Carrier", "definition": "<p><font face=\"Arial\" style=\"font-size: medium;\">To see a car carrier in your dream indicates that you are lacking direction and have no goal of your own. You are letting others make decisions for you. You are going with the flow.</font><font color=\"#000000\" face=\"Arial\" style=\"font-size: medium;\"> </font><br/></p>", "deleted": false}, {"id": 21668, "name": "Car Dealership", "definition": "<p>To see or dream that you are in a car dealership refers to some decision that you need to make about where you want to go in life. You are trying to figure out your life path.<br/></p>", "deleted": false}, {"id": 21669, "name": "Car Seat", "definition": "<p>To see an infant car seat in your dream implies that you are in control of someone else's direction or destiny in life. Alternatively, the dream refers to the beginning stages of your life journey. You are just getting started on an important path.<br/></p>", "deleted": false}, {"id": 21670, "name": "Car Show", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are at a car show suggests that you are drawn to a flashy lifestyle which may not necessarily be who you really are. </font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are showing off your car at a car show implies that you are proud of your accomplishments and achievements. You are seeking recognition for your work.</font></p>", "deleted": false}, {"id": 21671, "name": "Caramel", "definition": "<p>To eat or lick caramel in your dream indicates a sweet and satisfying situation will eventually turn into &#34;sticky&#34; problem. If it sounds too good to be true, then it is really too good to be true.<br/></p>", "deleted": false}, {"id": 21672, "name": "Caravan", "definition": "<p>To dream that you are part of a caravan means that you will achieve your goals with the support of others. You do not need to do things by yourself.<br/></p>", "deleted": false}, {"id": 21673, "name": "Carburetor", "definition": "<p>To see the carburetor in your dream represents emotional, spiritual and physical balance.<br/></p>", "deleted": false}, {"id": 21674, "name": "Carcass", "definition": "<p>To see a carcass in your dream indicates that you are feeling emotionally torn. You feel that you are literally being ripped apart.<br/></p>", "deleted": false}, {"id": 21675, "name": "Cardboard", "definition": "<p>To see a cardboard box in your dream indicates a lack of protection against risk.<br/></p>", "deleted": false}, {"id": 21676, "name": "Cardinal", "definition": "<p>To see a cardinal in your dream represents vitality and happiness. It also may mean being in first place or your position at the front.<br/></p>", "deleted": false}, {"id": 21677, "name": "Cards", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are playing a game of cards represents your ability to strategize in various areas of your life. In particular, diamonds indicate wealth and materialism, clubs indicate work and industry, hearts indicate happiness in love, and spades indicate troubling times and disappointments.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are shuffling cards signifies indecision. You need to reevaluate your choices.</font><font color=\"#000000\" face=\"Arial\"> </font></p><p style=\"font-size: medium;text-align: left;\"><font color=\"#000000\" face=\"Arial\">In particular, dreaming of the king of heart card symbolizes a compassionate male figure in your life. It may also mean that you are that compassionate person.<font face=\"Arial\" size=\"3\"> </font></font></p>", "deleted": false}, {"id": 21678, "name": "Cargo", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are loading or carrying cargo refers to a heavy load that you are carrying around. </font><font face=\"Arial\"> You are feeling overburdened or overwhelmed. </font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">If you are unloading cargo in your dream, then it indicates that you are ready to rid yourself of the extra weight, negative habits and/or excesses that are holding you back. It is time to let go.</font></p>", "deleted": false}, {"id": 21679, "name": "Carjack", "definition": "<p>To dream that you have been carjacked suggests that you have lost your direction in life. You feel that circumstances in your life has lead you on a different course. <br/></p>", "deleted": false}, {"id": 21680, "name": "Carnation", "definition": "<p>To see carnations in your dream symbolize light-heartedness, vitality and joy. Alternatively, it may represent bachelorhood. Consider the color of the carnation for additional significance.<br/></p>", "deleted": false}, {"id": 21681, "name": "Carnelian", "definition": "<p>To see a carnelian in your dream represents passion, lust, sexuality, or matters of the heart.  It also indicates a need for spiritual healing.<br/></p>", "deleted": false}, {"id": 21682, "name": "Carnival", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are at the carnival represents falsehoods and deception. If you observe freakish sights, then it denotes a lack of harmony in your domestic life. Much sorrow will arise in what were thought to be pleasant times.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are on a carnival ride suggests that you are going in circles. It may also symbolize cheap thrills.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you run away with the carnival denotes that you will be involved in or closely connected to the entertainment field.</font></p>", "deleted": false}, {"id": 21683, "name": "Caroling", "definition": "<p><font face=\"Arial\" style=\"font-size: medium;\">To dream that you are caroling signifies joy, harmony and tranquility. You are in a festive and upbeat mood.  The dream may also be a pun on someone who is named &#34;Carol&#34;.</font><br/></p>", "deleted": false}, {"id": 21684, "name": "Carp", "definition": "<p>To see a carp in your dream indicates that you need to put aside your pride and ego and not let it get in the way of friendships and relationships. Alternatively, the carp is symbolic of patience, perseverance, determination, tenacity, courage and success.<br/></p>", "deleted": false}, {"id": 21685, "name": "Carpenter", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see or dream that you are a carpenter indicates that you are confronting and overcoming your obstacles. Alternatively, it suggests that you need to change your way of thinking and readjust your attitude.</font></p>", "deleted": false}, {"id": 21686, "name": "Carpet", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see a carpet in your dream represents your way of protecting yourself from life's harsh realities. Alternatively, a carpet symbolizes luxury, comfort or richness. Consider the condition and designs of the carpet and how it parallels the foundation that you have laid for yourself in life. Perhaps the dream is telling you that you are refusing to confront some issue and instead are sweeping it under the carpet? </font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are installing or laying down carpet suggests that you are trying to make your life more comfortable.  The dream may also be analogous to the planning of something. You are laying out  some new project or endeavor.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream of a magic carpet implies your desires and wishes to escape from a situation, relationship, or responsibilities. The dream is similar to a flying dream, so you may want to look up flying.</font></p>", "deleted": false}, {"id": 21687, "name": "Carriage", "definition": "<p>To see an old-fashioned carriage in your dream suggests that your ways of thinking may be too outdated and antiquated. The carriage is also a symbol of power and status.<br/></p>", "deleted": false}, {"id": 21688, "name": "Carrom Board", "definition": "<p><font face=\"Arial\" style=\"font-size: medium;\">To see or play with a Carrom Board in your dream implies that you need to focus on your goals. Alternatively, the dream indicates that you are trying to shield or protect a loved one from some problem or issue.</font><font color=\"#000000\" face=\"Arial\" style=\"font-size: medium;\"> </font><br/></p>", "deleted": false}, {"id": 21689, "name": "Carrot", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see a carrot in your dream signifies abundance and fertility. It may also symbolize a lure as in the idiom &#34;to dangle a carrot&#34;.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To eat a carrot in your dream indicates clarity. You are seeing something more clearly. </font></p>", "deleted": false}, {"id": 21690, "name": "Carry", "definition": "<p>To dream that you are being carried suggests that you are feeling like a burden to somebody. You need to be more independent and take on more responsibilities. Alternatively, it may elude to romance. <br/></p>", "deleted": false}, {"id": 21691, "name": "Cartoon", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that your real life is depicted in a cartoon world suggests that you are perceiving the world in a comical and unserious manner. This dream may also serve as an escape from the stressful realities of your life. It is your way of obtaining moments of lightheartedness and fun. Additionally, you need to learn to laugh at yourself and at your mistakes.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are watching cartoons indicates that you are not taking life seriously.</font></p>", "deleted": false}, {"id": 21692, "name": "Cartwheels", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are doing cartwheels represent poise and balance in your life or the need to regain balance. You need to handle life's obstacle and stress with more fortitude. </font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you have difficulties doing cartwheels suggest that you do not have confidence in your own abilities. It may also mean that you are lacking discipline and are exhibiting some struggles in your life. There is an imbalance between work and pleasure. </font></p>", "deleted": false}, {"id": 21693, "name": "Carving", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are carving a piece of wood symbolizes spiritual and creative energy. Metaphorically, you are transforming subconscious energy into conscious awareness. Consider whether the carving is purely ornamental or utilitarian.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are carving some meat indicates that you are trying to rid yourself of certain feelings. You may be distancing yourself from your emotions and analyzing them from an objective standpoint. Alternatively, some person or situation is violating an aspect of your life.</font><font color=\"#000000\" face=\"Arial\"> </font></p>", "deleted": false}, {"id": 21694, "name": "Carwash", "definition": "<p><font face=\"Arial\" style=\"font-size: medium;\">To dream that you are at a carwash indicates that you need to clean up your self-image. You are ready for a fresh start.</font><font color=\"#000000\" face=\"Arial\" style=\"font-size: medium;\"> </font><br/></p>", "deleted": false}, {"id": 21695, "name": "Cash Register", "definition": "<p>To see a cash register in your dream represents financial worries and concerns. You are assessing your financial situation. On the other hand, you may be expecting monetary gains. <br/></p>", "deleted": false}, {"id": 21696, "name": "Cashier", "definition": "<p><font face=\"Arial\" style=\"font-size: medium;\">To see or dream that you are a cashier indicates that you are re-evaluating your life and what you have accomplished.  Alternatively, it suggests that you have removed yourself out of some situation. You have &#34;checked out&#34;.</font><font color=\"#000000\" face=\"Arial\" style=\"font-size: medium;\"> </font><br/></p>", "deleted": false}, {"id": 21697, "name": "Cashmere", "definition": "<p>To feel or wear cashmere in your dream symbolizes luxury. You strive for the finer things in life. Alternatively, dreaming of cashmere suggests that you are looking for warmth and comfort in your relationships.<br/></p>", "deleted": false}, {"id": 21698, "name": "Casino", "definition": "<p>To dream that you are in a casino signifies the risk-taker within you. If you are a reserved or passive person, then the dream suggests that you should take a chance. If you are not, then it implies that you need to make a more informed decision instead of relying on fate.<br/></p>", "deleted": false}, {"id": 21699, "name": "Casket", "definition": "<p><font face=\"Arial\" style=\"font-size: medium;\">To see a casket in your dream symbolizes the womb. It also signifies your thoughts and fears of death. If the casket is empty, then it denotes irreconcilable differences. Alternatively, the coffin represents ideas and habits that are no longer of use and can be buried. In particular, if the casket is white, then it refers to lost innocence.</font><font color=\"#000000\" face=\"Arial\" style=\"font-size: medium;\"> </font><br/></p><p><font color=\"#000000\" face=\"Arial\" style=\"font-size: medium;\">To see a body in a casket in your dream signifies that you are going through a period of depression. You may feel confined, restricted and that you are lacking personal freedom. There may be a dead or decaying situation or issue in your life that you need to address. It is time to end this situation or relationship.<br/></font></p>", "deleted": false}, {"id": 21700, "name": "Casserole", "definition": "<p>To dream you are making a casserole symbolizes new ideas or a new phase in your life.<br/></p>", "deleted": false}, {"id": 21701, "name": "Cassette Tape", "definition": "<p>To see a cassette tape in your dream suggests that there is worth and truth in what you are saying. Alternatively, the dream means that you need to get out of the same rut. You are going around in a loop.<br/></p>", "deleted": false}, {"id": 21702, "name": "Cassowary", "definition": "<p>To see a cassowary in your dream refers to your shy nature. You try to avoid confrontation and arguments.<font color=\"#000000\" style=\"font-size: medium;\"> </font><br/></p>", "deleted": false}, {"id": 21703, "name": "Cast", "definition": "<p><font face=\"Arial\" style=\"font-size: medium;\">To dream that you are wearing a cast suggests that your motion is being inhibited in some way. Or that you need to show some restraint in an area of your life. Consider which part of the body is in a cast. Alternatively, a cast symbolizes a time of healing and discipline.</font><font color=\"#000000\" face=\"Arial\" style=\"font-size: medium;\"> </font><br/></p>", "deleted": false}, {"id": 21704, "name": "Castanets", "definition": "<p>To see, hear or play with castanets in your dream  represents little annoyances and irritations in your waking life. Alternatively, the dream may be a metaphor that you need to &#34;cast-a-net&#34;. Perhaps you are looking for some assistance.<br/></p>", "deleted": false}, {"id": 21705, "name": "Castle", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see a castle in your dream signifies reward, honor, recognition, and praise for your achievements. You are destined to a position of power, wealth, and prestige. Alternatively, the dream indicates your desire to escape from life's daily problems.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you live in a castle represents your extreme need for security and protection to the point where you may be isolating yourself from others. Perhaps the dream parallels a waking situation where it  has put you on the defensive.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see a castle door in your dream indicates that you have missed a huge and/or profitable opportunity, especially if you are standing outside the castle door. If you are standing inside the castle door, then it means that you have let your success and ego distance you from others.</font></p>", "deleted": false}, {"id": 21706, "name": "Castration", "definition": "<p>To dream of a castration signifies your overwhelming fears that you have lost your virility. You are feeling the pressures of your sexual performance. Alternatively, it represents a lack of creativity, power or strength.<br/></p>", "deleted": false}, {"id": 21707, "name": "D", "definition": "<p>To see the letter &#34;D&#34; in your dream signifies mediocrity. Alternatively, the letter D refers to receptiveness and joy. As a Roman Numeral, it could represent the number 500.<br/></p>", "deleted": false}, {"id": 21708, "name": "Dachshund", "definition": "<p>To see a Dachshund in your dream highlights your loyalty and devotion to others. You are well grounded and rational in your thinking.<br/></p>", "deleted": false}, {"id": 21709, "name": "Daffodil", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see daffodils in your dream symbolize self-love, renewal, inner growth, optimism, inspiration, and hope. It may signal a fresh start, a new beginning or a new project. </font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To give someone daffodils in your dream represent unrequited love. Someone that you are interested in may not feel the same way about you. The dream is telling you that it is time to move on.</font></p>", "deleted": false}, {"id": 21710, "name": "Dagger", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see or use a dagger in your dream represents some &#34;cutting remark&#34;. Perhaps you feel that you have been stabbed in the back.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you take a dagger from somebody's hand means you will overcome hardships and misfortune.</font></p>", "deleted": false}, {"id": 21711, "name": "Dahlias", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see dahlias in a dream signify good fortune in financial matters. In particular, if the daffodils are wiling, then it represents loss and sorrow.</font></p>", "deleted": false}, {"id": 21712, "name": "Dairy", "definition": "<p>To dream that you are in a dairy farm suggest that you are well nurtured and well care for.<br/></p>", "deleted": false}, {"id": 21713, "name": "Daisy", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see daisies in your dream symbolize freshness, beauty, innocence, simplicity, friendliness, and cleanliness. If  you are plucking the petals of a daisy, then it denotes the purity of love.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that someone gives you a bouquet of daisies symbolizes sorrow and/or lost love.  </font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream of walking in a field of daisies represents good luck and prosperity. Someone will be there to offer you a helping hand and some guidance for your problems. </font></p>", "deleted": false}, {"id": 21714, "name": "Dalai Lama", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see the Dalai Lama in your dream represents spiritual enlightenment. There is some important message or advice that you need to take from such a dream.  Alternatively, dreaming of the Dalai Lama may be telling you not to focus on material wants and gains. You need to free yourself from your possessions.</font></p>", "deleted": false}, {"id": 21715, "name": "Dalmatian", "definition": "<p>To see a Dalmatian in you dream suggests that you overlook your own feelings in order to tend to the needs of others. You are a people pleaser.<br/></p>", "deleted": false}, {"id": 21716, "name": "Dam", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see a dam in your dream signifies repressed emotions or feelings that needs to be released. To dream of a bursting dam denotes that you have lost control of your anger and are overwhelmed with emotions. </font></p>", "deleted": false}, {"id": 21717, "name": "Damask Rose", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see a damask rosebush in your dream signifies happy unions.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you receive a bouquet of damask rose foretells of true love.</font></p>", "deleted": false}, {"id": 21718, "name": "Damn", "definition": "<p>To dream that you are being damned indicates that you need to use caution in a new situation. You are also overly concerned with what others think of you. Alternatively, if someone damns you in your dream, then it means that you need to be more thick skinned and not let others get to you so easily. <br/></p>", "deleted": false}, {"id": 21719, "name": "Damson", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see a damson tree full with fruit in your dream signifies riches. You will be well-rewarded. Alternatively, it suggests that you will experience some loss and sorrow. A dark cloud will hover over you. </font></p>", "deleted": false}, {"id": 21720, "name": "Dance", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are dancing signifies freedom from any constraints and restrictions. Your life is in balance and in harmony. Dancing also represents frivolity, happiness, gracefulness, sensuality and sexual desires. You need to incorporate these qualities in your waking life.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are dancing with a partner signifies intimacy and a union of the feminine and masculine aspects of yourself. If you are leading, then it indicates that you are in control of your personal life. It could also mean that you are being overly aggressive and assertive. If you dream that someone asks you to dance, then it highlights the notion that you are a follower. You feel that you need someone in order to be complete and in harmony. In particular, to dream that you are dancing with your ex represents your full acceptance of her or him for the person he or she was. The break-up was a positive decision.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are dancing with your ex represents your full acceptance of her or him for the person he or she was. The break-up was a positive decision.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are attending or going to a dance indicates a celebration and your attempts to achieve happiness. Consider the phrase the &#34;dance of life&#34; which suggests creation, ecstasy, and going with what life has to offer you.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see children dancing in your dream indicates a happy home life.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see ritualistic dancing in your dream denotes your need to get in touch with the spirit within.</font></p>", "deleted": false}, {"id": 21721, "name": "Dance Class", "definition": "<p>To dream that you are in dance class indicates that you need to learn to let go. The dream may also be a metaphor that you are learning the steps to some new project, new process or new stage in your life.<br/></p>", "deleted": false}, {"id": 21722, "name": "Dance Floor", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see a dance floor in your dream implies that you need to be more expressive. It is time to let loose. If there is no one on the dance floor, then it means that you are lacking an outlet to express yourself. You feel that you can't be who you really are.</font></p>", "deleted": false}, {"id": 21723, "name": "Dance Recital", "definition": "<p>To see or dream that you are in a dance recital suggests that you are ready to move forward into a new phase in your life.<br/></p>", "deleted": false}, {"id": 21724, "name": "Dandelion", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see dandelions in your dream represent pleasant and joyous surroundings. You are content with where you are at in life. Alternatively, the dream seeks to bring your back to your childhood and past memories.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are blowing on dandelions symbolize fleeting moments. You are trying to recapture a certain time in your life. You feel that time is passing you by.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are eating dandelions signify that you need to take better care of your health or suffer unpleasant consequences.</font></p>", "deleted": false}, {"id": 21725, "name": "Dandruff", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you have dandruff indicates that you are misusing your energy. You may have been under a lot of stress and tension. You should rethink the way you are approaching any of your current problems. Alternatively, this dream may suggest a lack of self-esteem.</font></p>", "deleted": false}, {"id": 21726, "name": "Danger", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are in danger suggests that you need to be more cautious in some aspect of  your life. Alternatively, your negativity and pessimistic attitude is causing you to be depressed about the future.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you escape from danger signifies that you will rise to a place of high position and honor in your business and social circle.</font></p>", "deleted": false}, {"id": 21727, "name": "Dare", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you dare someone to do something suggests that you are too dominating or too overbearing.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that someone dared you do something indicates that you will find yourself in some embarrassing or compromising position.</font></p>", "deleted": false}, {"id": 21728, "name": "Daredevil", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To watch or dream that you are a daredevil means that you need to take a risk and be more &#34;daring&#34; in some situation. You will go nowhere if you just sit around thinking about it. It is time to take action. </font></p>", "deleted": false}, {"id": 21729, "name": "Darkness", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that darkness comes upon you signifies failure in some work that you are attempting.  Darkness is synonymous with ignorance, the subconscious, evil, death, and fear of the unknown. If the sun breaks through the darkness, then you will overcome your failures. If you feel safe in the dark, then it suggests that you like not knowing about certain things. As some might say, ignorance is bliss. </font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you cannot find someone in the darkness signifies that you need to keep your temper in check.  You have the tendency to let your emotions get out of control and lose your temper.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are lost in the darkness denotes feelings of desperation, depression, or insecurity.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are groping around in the darkness indicates that you have insufficient information to make a clear decision. Do your research and do not rush into making choices.</font></p>", "deleted": false}, {"id": 21730, "name": "Darkroom", "definition": "<p>To dream that you are in a darkroom suggests that you are waiting  for something to happen. You are curious to see what might develop in a situation.<br/></p>", "deleted": false}, {"id": 21731, "name": "Dartboard", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see a dartboard in your dream indicates that you are feeling hostility from someone. You need to express your anger and feelings more directly. Alternatively, the dartboard may symbolize a goal that you are aiming for. You need to try and take a shot at something new and overcome your fear of failure. </font></p>", "deleted": false}, {"id": 21732, "name": "Darth Vader", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see Darth Vader in your dream implies that you are struggling between good and evil. Alternatively, the Darth Vader represents your shadow aspect. There is a negative influence or force pulling you toward the dark side.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that someone you know is Darth Vader implies that there is some good in everyone.</font></p>", "deleted": false}, {"id": 21733, "name": "Darts", "definition": "<p>To dream that you are throwing darts in your dream refers to some hurtful or harmful remarks that you or someone have said. Alternatively, it represents your goals and your &#34;go-getter&#34; attitude. <br/></p>", "deleted": false}, {"id": 21734, "name": "Dashboard", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see a dashboard in your dream represents the status of your goals and of where you are headed in life. </font></p>", "deleted": false}, {"id": 21735, "name": "Date", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are on a date represents your need for self-discovery and self-awareness. You are getting to know some hidden aspects of yourself and acknowledging your hidden talents. Alternatively, it may reflect your anxieties about dating or finding acceptance. The dream may also be a &#34;rehearsal&#34; for an actual date you have. It serves to overcome anxieties you may have. </font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are dating two people at the same time signifies passion in your own personal relationship. This dream does not necessarily mean that you want to stray from your significant other. It may also indicate some anxiety on some major change in the relationship.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream of a date, as in a particular, month, day and year represents the passing of time and past events. The dream may also be a reminder of a special event, appointment or important date in your waking life. Also consider the significance of the numbers in the date.</font></p>", "deleted": false}, {"id": 21736, "name": "Dates", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see plump ripe dates growing on a tree represents happiness and joy. Take some time to relax and find peace of mind. The dream may also be a metaphor for a date that you are going on or an important date or appointment that you have to keep. </font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are eating dates signify distress. You are never happy with what you have and are always trying to acquiring more material things.</font></p>", "deleted": false}, {"id": 21737, "name": "Dating Show", "definition": "<p>To watch or dream that you are on a dating show implies that you are looking to be in a relationship, but are looking in all the wrong places. Or perhaps you feel that your love life is being scrutinized or being put on display. Consider the name of the dating show and how it relates to your current relationship views or status. <br/></p>", "deleted": false}, {"id": 21738, "name": "Daughter", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see your daughter in your dream reflects your ideal or your better self. Alternatively, the dream may represent your waking relationship with your daughter and the qualities that she projects. </font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">If you do not have a daughter, then the dream symbolizes the feminine aspect within yourself.</font></p>", "deleted": false}, {"id": 21739, "name": "Daughter-In-Law", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see your daughter-in-law in your dream suggests that an unexpected incident will either provide you with joy or distress, depending on her attitude.</font></p>", "deleted": false}, {"id": 21740, "name": "Dawn", "definition": "<p>To see the dawn in your dream signifies rejuvenation, enlightenment, and vitality. You are emerging out from a new stage in life and have a new understanding or a new start in life.<br/></p>", "deleted": false}, {"id": 21741, "name": "Day", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream of a sunny day symbolizes clarity and/or pleasantness.  You are seeing things clearly. To dream of a gloomy or cloudy day signifies sadness. If you dream of a particular day, then you may need to look closely at that day for any significance. Consider the number associated with that day. A certain date could highlight a special anniversary, appointment or occasion.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream of the passing of a day indicates that you need to manage your time better and plot out your goals in a more deliberate manner.</font></p>", "deleted": false}, {"id": 21742, "name": "Daybreak", "definition": "<p>To  dream that the day breaks signifies success in your projects and endeavors. Your outlook is looking good.<br/></p>", "deleted": false}, {"id": 21743, "name": "Daycare", "definition": "<p>To dream that you are at a daycare indicates that you want to be taken care of and not have to worry about anything else. <font face=\"Arial\" size=\"3\" style=\"font-size: medium;\">You want  to go back to a simpler time. Consider the condition of the daycare for additional significance. If the daycare is chaotic, dirty and unorganized, then it parallels how you see the issues in your life. If the daycare is calm and cheery, then it suggests that you have a handle over the problems in your life.</font><br/></p>", "deleted": false}, {"id": 21744, "name": "Dead", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see or talk to the dead in your dream forewarns that you are being influenced by negative people and are hanging around the wrong crowd. This dream may also be a way for you to resolve your feelings with those who have passed on. Alternatively, the dream symbolizes material loss.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\"><font size=\"3\">If you dream of a person who has died a long time ago, then it suggests that a current situation or relationship in your life resembles the quality of that deceased person. The dream may depict how you need to let this situation or relationship die and end it. </font>If you dream of someone who has recently passed away, then it means that their death is still freshly in your mind. Dreams can also be a way for you to keep loved ones who have past away alive and still be in some aspect of your life. You are still trying to grasp the notion that he or she is really gone. If the dead is trying to get you to go somewhere with him or her, then it signifies that you are trying to understand their death. You also don't want to be alone.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see and talk with your dead parents in your dream is a way of keeping them alive. It is also a way of coping with the loss. You are using your dream as a last opportunity to say your final good-byes to them.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see your dead sibling, relative, or friend alive in your dream indicates that you miss them and are trying to relive your old experiences you had with them. In trying to keep up with the pace of your daily waking life, your dreams may serve as your only outlet in coping and coming to terms with the loss of a loved one.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream of your dead child is a way for you to keep your child alive through your dreams. For a parent to lose a child is extremely difficult. Such dreams occur because you still cannot accept or understand how or why your child was taken from you so soon.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">Dreaming of a dead person who passes away again in your dream means that you wished they were still around to experience and share certain aspects of your life with you. Such dreams are more likely to occur during happy times or during important milestones in your life.</font></p>", "deleted": false}, {"id": 21745, "name": "Dead End", "definition": "<p>To dream that have reached a dead end indicates that you have come to an abrupt end in the pursuit of your goals. You must find another way to achieve your goals because the current path is not working out. Alternatively, the dream may be telling you that you are going nowhere. Perhaps, the dream is symbolic of a dead end job or a dead end relationship. You need to reevaluate your options. <br/></p>", "deleted": false}, {"id": 21746, "name": "Deadline", "definition": "<p>To dream of a deadline signifies your preoccupation with time. You feel that time is running out for you and that will not be able to meet your goals by a set time. You need to learn to prioritize and balance aspects of your life.<br/></p>", "deleted": false}, {"id": 21747, "name": "Deaf", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">If you are not deaf in real life and dream that you are deaf, then it suggests that you are feeling secluded from the world. You may be closing yourself off from new experiences or shutting yourself out. Alternatively, the dream could indicate that your defenses are up.  There is something that you are refusing to hear. Perhaps you have problems taking criticism. The dream could just mean that you are in need of some peace and quiet.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that someone else is deaf suggests that someone close to you is withdrawn.</font></p>", "deleted": false}, {"id": 21748, "name": "Death", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream about the death of a loved one suggests that you are lacking a certain aspect or quality that the loved one embodies. Ask yourself what makes this person special or what you like about them. It is that very quality that you are lacking in your own relationship or circumstances. Alternatively, the dream indicates that whatever that person represents has no part in your own life anymore. In particular, to dream about the death of your living parents indicates that you are undergoing a significant change in your waking life. Your relationship with your parents has evolved into a new realm. If you dream about the death of a child, then it implies that you need to let go of your immaturity and start being more serious. As your child reaches certain milestones and grows into an adult, dreaming of their death may be symbolic of their own self-discovery, transition and transformation into a new stage of life.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are faking your own death suggests that you are looking for a new start. You need some change in your life. If you dream that your significant other is faking their own death, then the dream represents something new that you are learning about them. Or it may mean that they are not who you thought they were. </font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\" size=\"3\">To have a near death experience in your dream implies that you are experience a relapse of sorts. You are reverting back to your old habits and ways. Alternatively, the dream indicates that you are being given a second chance or second try at something.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you die in your dream symbolizes inner changes, transformation, self-discovery and positive development that is happening within you or your life. You are undergoing a transitional phase and are becoming more enlightened or spiritual. Although such a dream may bring about feelings of fear and anxiety, it is no cause for alarm as it is often considered a positive symbol. Dreams of experiencing your own death usually means that big changes are ahead for you. You are moving on to new beginnings and leaving the past behind. These changes does not necessarily imply a negative turn of events. Metaphorically, dying can be seen as an end or a termination to your old ways and habits. So, dying does not always mean a physical death, but an ending of something. <font size=\"3\">If you dream that someone is telling you that you are going die, then it implies that you are being pressured to make an important change or choice. You are about to embark on some new life adventure.</font></font></p><p style=\"font-size: medium;text-align: left;\"><font size=\"3\" face=\"Arial\">If a love one has past away, but you dream that he or she didn't really die that first time and are being buried again indicates that this loved one was taken before their time and you never got a chance to say a proper good bye. Perhaps there was some unfinished issue that is still left lingering long after their death. You wished you had a little more time with them.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">On a negative note, to dream that you die may represent involvement in deeply painful relationships or unhealthy, destructive behaviors. You may feeling depressed or feel strangled by a situation or person in your waking life. Perhaps your mind is preoccupied with someone who is terminally ill or dying. Alternatively, you may be trying to get out of some obligation, responsibility or other situation. You are desperately trying to escape from the demands of your daily life.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see someone dying in your dream signifies that your feelings for that person are dead or that a significant change/loss is occurring in your relationship with that person. Alternatively, you may want to repress that aspect of yourself that is represented by the dying person. If you see a stranger die in your dream, then it implies that you are feeling detached from the changes that are happening around you. </font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To smell death in your dream refers to a situation that has long been dead. It is time to stop dwelling on the past and move on.</font></p>", "deleted": false}, {"id": 21749, "name": "Death Penalty", "definition": "<p>To dream that you are given the death penalty means that you need to reevaluate your life and the decisions that you are making. You are going on the wrong path. Alternatively, a death sentence means that you have a limited time to respond or to do something.<br/></p>", "deleted": false}, {"id": 21750, "name": "Debate", "definition": "<p>To dream that you are in a debate symbolizes some inner turmoil or conflict that you are experiencing. It also means that you will find closure to those unresolved issues. <br/></p>", "deleted": false}, {"id": 21751, "name": "Debt", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are in debt signifies imbalance, struggle, worry and trouble in some personal situation or business matter. Alternatively, it may indicate that you are putting too much demands of others.</font></p>", "deleted": false}, {"id": 21752, "name": "Debutante Ball", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To attend a debutante ball in your dream represents a celebration of life. You are welcoming new experiences, changes and challenges. </font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that a debutante ball is held in your honor indicates that you are undergoing a transitional phase in your life. It is a new beginning for you.</font></p>", "deleted": false}, {"id": 21753, "name": "Decay", "definition": "<p>To see something decay in your dream signifies the degradation of a situation or circumstance. It may also represent the death of an old situation before the rebirth into a new stage.<br/></p>", "deleted": false}, {"id": 21754, "name": "December", "definition": "<p>To dream of the month of December signifies togetherness, friendships, and happy reunions. Consider your own personal associations with this month. Is it someone's birthday? Does it invoke the holiday spirit? Is the dream telling you to be more giving? Does December signify a closure to something?<br/></p>", "deleted": false}, {"id": 21755, "name": "Deception", "definition": "<p>To dream that you are deceiving someone suggests that you are lying to yourself that everything is okay when in reality it is not. You are trying to cover up some mistake or some lie. The deceit is manifesting itself into your dream and eating away at your conscious.<br/></p>", "deleted": false}, {"id": 21756, "name": "Deck", "definition": "<p>To dream that you are out on the deck represents your connection with your Self and with nature. You need to be more aware of your surroundings and appreciate the environment. Alternatively, the dream may be a metaphor that you are all &#34;decked out&#34; for some special occasion. You are showing off.<br/></p>", "deleted": false}, {"id": 21757, "name": "Decorate", "definition": "<p>To dream that you are decorating suggests that you are trying to mask or cover up something. You may be putting up a front instead of addressing the core matter at hand.<br/></p>", "deleted": false}, {"id": 21758, "name": "Decoy", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are using a decoy indicates your tendency to mislead people. Your conscious may be appearing in your dream to try and steer you back in the right direction.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are a decoy represents self denial or self deception. You are trying to tell yourself to believe one thing, but really feel differently.</font></p>", "deleted": false}, {"id": 21759, "name": "Deed", "definition": "<p>To dream that you a signing a deed suggests that you are making some unwise choices.<br/></p>", "deleted": false}, {"id": 21760, "name": "Deep", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream of something deep or a place of great depth represents things that you are avoiding or feelings that you are suppressing. Alternatively, the dream implies that there is more to something or someone that what you see on the surface.</font></p>", "deleted": false}, {"id": 21761, "name": "Deer", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see a deer in your dream symbolizes grace, compassion, gentleness, meekness and natural beauty. The deer has feminine qualities and may point to the feminine aspect within yourself. It also represents independence, alertness, and virility. Consider the symbol to be a pun for someone who is &#34;dear&#34; to you. Alternatively, the dream represents vulnerability and naiveté. As a result, others may take advantage of you and your gullibility. </font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">If the deer is black, then it means that you are not acknowledging or are rejecting the feminine qualities in you. You may not be in tune with your feminine side. </font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you hunt or kill a dear suggests that you are trying to suppress those feminine qualities. </font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">Dreaming that you are bottle feeding a baby deer highlights your nurturing attribute. A baby animal is often a symbol of your own child.</font></p>", "deleted": false}, {"id": 21762, "name": "Defeat", "definition": "<p>To dream that you have been defeated indicates that you are headed in the wrong direction. You need to reevaluate the situation and rethink what is really best for you. Alternatively, the dream suggests that you need to learn from your experiences, even the negative ones. <br/></p>", "deleted": false}, {"id": 21763, "name": "Defecate", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are defecating on someone indicates your anger and hostility toward that person. </font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are being defecated on represents feelings of guilt and unworthiness. You may be suffering from low self-esteem.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">Dreaming that someone defecated on your bed suggests that you are ashamed about some past secret coming back to haunt you. If a member of your family comes in contact wit the feces, then it points to some unfinished business that is affecting your family.</font></p>", "deleted": false}, {"id": 21764, "name": "Defend", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are defending yourself suggests an underlying hurt. It may parallel a waking life situation where you are being put on the defensive.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are defending someone indicates that you are projecting your beliefs and feelings onto someone else. By defending this person, you are deflecting or undermining your own beliefs. Perhaps you are not ready to confront your feelings.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">Dreaming that someone is defending you or standing up for you symbolizes your sense of self-worth.</font></p>", "deleted": false}, {"id": 21765, "name": "Defibrillator", "definition": "<p>To dream that someone is using a defibrillator on you implies that you need to be reenergized. You need to literally get a jumpstart on your goals. <br/></p>", "deleted": false}, {"id": 21766, "name": "Deflate", "definition": "<p>To dream that a tire, ball or balloon is deflated signifies a lack of self esteem or self-worth. According to Freud, deflation symbolizes impotence.<br/></p>", "deleted": false}, {"id": 21767, "name": "Deformed", "definition": "<p>To dream that you or someone is deformed represents undeveloped aspects of yourself that you may have ignored. You refusal to acknowledge these characteristics may be affecting your performance and creative flow. <br/></p>", "deleted": false}, {"id": 21768, "name": "Defriend", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are defriending someone suggests that your friendships are drifting apart. You are feeling socially disconnected or withdrawn. Alternatively, the dream indicates aspects of your own self that you are rejecting or refusing to acknowledge.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you have been defriended indicates that you are feeling betrayed. </font></p>", "deleted": false}, {"id": 21769, "name": "Deja Vu", "definition": "<p>To dream of Déjà Vu indicates some unresolved issue which you are not addressing or are refusing to acknowledge. It may also represent a message or word of advice that you need to heed.<br/></p>", "deleted": false}, {"id": 21770, "name": "Delay", "definition": "<p>To experience a delay in your dream suggests that obstacles toward your goals are inevitable. Don't let these setbacks discourage you.<br/></p>", "deleted": false}, {"id": 21771, "name": "Deli", "definition": "<p>To dream that you are at a deli indicates that you are seeking for emotional nourishment outside of your social support system. You want to know the options that are available to you. Alternatively, the dream suggests that you need to watch your weight.<br/></p>", "deleted": false}, {"id": 21772, "name": "Delight", "definition": "<p>To dream that you are experiencing delight signifies a favorable and positive turn of events. Pleasant times are ahead for you.<br/></p>", "deleted": false}, {"id": 21773, "name": "Delinquent", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see a delinquent in your dream indicates that you are wasting away some aspect of your life.  You are selling yourself short and underestimating your own potential. </font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">Dreaming that you are delinquent with your bills suggests that your mind is preoccupied with financial and money matters. You may be feeling overwhelmed with life's demands. </font></p>", "deleted": false}, {"id": 21774, "name": "Deliverance", "definition": "<p>To dream about deliverance refers to your need to feel protected. You may be feeling a little vulnerable and are looking strength. The dream may also indicate that you are being swayed by some negative influences in your life. <br/></p>", "deleted": false}, {"id": 21775, "name": "Delivery", "definition": "<p>To dream that you are expecting a delivery or have a delivery signifies disappointments. Alternatively, the dream is telling you to be grateful and appreciative with what you have. Alternatively, the dream may be a metaphor for delivery of a baby.<br/></p><p>To deliver something in your dream indicates that you need to give more in some relationship or situation. Consider the significance of what you are delivering for meaning as to what you need to give more of. <br/></p>", "deleted": false}, {"id": 21776, "name": "Delta", "definition": "<p>To see a river delta in your dream represents an end to something in your waking life. This may relate to some personal or spiritual journey. Alternatively, the dream may share the same symbolism as a triangle.<br/></p>", "deleted": false}, {"id": 21777, "name": "Dementia", "definition": "<p>To dream that you or someone has dementia implies that there is a waking situation that is causing you to &#34;lose your mind.&#34; Perhaps someone or some situation is literally driving you crazy. Alternatively, the dream may be reflective of someone in your waking life who is suffering from dementia.<br/></p>", "deleted": false}, {"id": 21778, "name": "Demeter", "definition": "<p>To see Demeter in your dream represents your maternal instinct and your desire to provide for and support your dependents.<br/></p>", "deleted": false}, {"id": 21779, "name": "Demolition", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream of a demolition suggests that you are undergoing major changes in your life. You may feel out of control. Alternatively, to watch a demolition in your dream indicates a final end to some situation or relationship. </font></p>", "deleted": false}, {"id": 21780, "name": "Demons", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see demons in your dream indicates that you may be experiencing or inflicting fear, emotional distress or physical abuse in your waking life. Demons are also symbolic of ignorance, negative habits, and of your shadow self. Perhaps you are being overindulgent and letting some negativity give way to your better judgment. Alternatively, the demons may represent a past secret that is still haunting you.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are possessed by demons indicates helplessness.</font></p>", "deleted": false}, {"id": 21781, "name": "Demonstration", "definition": "<p>To dream that you are part of a demonstration indicates that you need to speak up for yourself and for your rights. Pay attention to the details of your dream as you may be ignoring or overlooking some important issue in your life. <br/></p>", "deleted": false}, {"id": 21782, "name": "Demotion", "definition": "<p>To dream that you are getting a demotion at work indicates a lack of self-esteem and confidence. You are fixated on the negative aspects of your life. On the other hand, your dream demotion may point to your arrogance and that you need to tone it down.  Alternatively, being demoted means that you are not giving an important task your full attention. <br/></p>", "deleted": false}, {"id": 21783, "name": "Den", "definition": "<p>To dream that you are in the den signifies work, industry, and efficiency.<br/></p>", "deleted": false}, {"id": 21784, "name": "Denial", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are in denial about something reflects your waking state of mind. You are refusing to see or acknowledge some truth. </font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are being denied something suggests that you are not measuring up to the expectation of others. Alternatively, it signifies overindulgence. Consider what you are being denied for additional significance.</font></p>", "deleted": false}, {"id": 21785, "name": "Denim", "definition": "<p>To see or wear denim in your dream signifies ruggedness and durability. The dream may be analogous to your ability to withstand or endure a difficult period in your life. Alternatively, the dream symbolizes your easygoing and laid back attitude.<br/></p>", "deleted": false}, {"id": 21786, "name": "Dent", "definition": "<p>To see a dent in your dream signifies self-doubt in your thinking. You are second guessing your decisions. It also represents a blemish in your personality.<br/></p>", "deleted": false}, {"id": 21787, "name": "Dental Floss", "definition": "<p>To floss in your dream suggests that you are trying to get to the root of some matter. Alternatively, the dream may be a metaphor that you are showing off and flaunting your material things. If your gums become bloody as a result of flossing, then it represents your fears and the negative consequences of your actions.<br/></p>", "deleted": false}, {"id": 21788, "name": "Dentist", "definition": "<p>To dream that you are at the dentist <font face=\"Arial\" size=\"3\" style=\"font-size: medium;\">represents your concerns about your appearance. Alternatively, it </font>suggests that you are having some doubt over the sincerity and honor of some person in your life. You are experiencing some momentary anxiety or pain, but you will be a better and stronger person for it in the long run.<br/></p>", "deleted": false}, {"id": 21789, "name": "Dentures", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are wearing dentures indicate that you are not being completely truthful in some waking matter. </font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see or dream that others are wearing dentures suggests that someone in your life is not who they say they are. They are being deceitful.</font></p>", "deleted": false}, {"id": 21790, "name": "Deodorant", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see or put on deodorant in your dream represents your inner strength and your ability to rid yourself of harmful and destructive behaviors. </font></p>", "deleted": false}, {"id": 21791, "name": "Depart", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are departing somewhere suggests that you are leaving a past life or an old relationship behind.  You are looking for a change or for something new. Alternatively, the dream may also represent your desire to escape from the daily demands of your life. </font></p>", "deleted": false}, {"id": 21792, "name": "Department Store", "definition": "<p>To dream that you are in a department store suggests that you are trying to fulfill your needs and desires. Consider the significance of what you are shopping for and how you may be lacking that item in your life.<br/></p>", "deleted": false}, {"id": 21793, "name": "Deportation", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are being deported indicates that you are feeling unwanted or unwelcome in some new surrounding. You are feeling rejected and unwanted.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that someone is deported signifies an aspect of your own self that is feeling rejected.</font></p>", "deleted": false}, {"id": 21794, "name": "Depression", "definition": "<p>To feel depressed in your dream refers to your inability to make connections. You are unable to see the causes of your problems and consequences of your decisions. People who are depressed in their waking life often have dreams about being depressed.  Pay attention to what is depressing you in your dream and see how it relates to your waking life.<br/></p>", "deleted": false}, {"id": 21795, "name": "Derailment", "definition": "<p>To dream that a train has derailed suggests that you are doing something against your own conscious. <br/></p>", "deleted": false}, {"id": 21796, "name": "Derrick", "definition": "<p>To see derricks in your dream symbolize the obstacles that you need to overcome in order to succeed. The dream may also be a pun on someone who is named &#34;Derek&#34; in your waking life.<br/></p>", "deleted": false}, {"id": 21797, "name": "Desert", "definition": "<p>To dream that you are walking through a desert signifies loss and misfortune. You may be suffering from an attack on your reputation. Deserts are also symbolic of barrenness, loneliness and feelings of isolation and hopelessness. The desert landscape may also be a metaphor for feeling deserted and left behind.<br/></p>", "deleted": false}, {"id": 21798, "name": "Desk", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see or sit at your desk in your dream suggests that you are evaluating and weighing your problems. It is indicative of self-exploration and discovery. If you are at someone else's desk, then it symbolizes a lack of confidence in your own abilities.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that your desk is cluttered indicates that you need to prioritize and reorganize aspects of your life. If the desk is cleaned out, then it suggests that you need to find more productive ways to spend your time. Pick up a new hobby. </font></p>", "deleted": false}, {"id": 21799, "name": "Despair", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are in despair represents the many hardships and cruelties that you will experience in the waking world. Alternatively, the dream may be a pun on &#34;the spare&#34;. Perhaps the dream is hinting at some back up. </font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that others are in despair denotes that someone around you will be in need of your help.</font></p>", "deleted": false}, {"id": 21800, "name": "Dessert", "definition": "<p>To see or eat a tasty dessert in your dream represents indulgence, celebration, reward, or temptation. You are enjoying the good things in life.<br/></p>", "deleted": false}, {"id": 21801, "name": "Destruction", "definition": "<p>To dream about mass destruction suggests that there is some chaos occurring in your life. Things may not be going the way you want it to. Perhaps the choices you are making are self-destructive.<br/></p>", "deleted": false}, {"id": 21802, "name": "E", "definition": "<p>To see the letter &#34;E&#34; in your dream implies ease and relaxation. The drug ecstasy is often referred to as &#34;E&#34;.<br/></p>", "deleted": false}, {"id": 21803, "name": "Eagles", "definition": "<p><font color=\"#000000\" style=\"font-size: medium;\">To see an eagle in your dream symbolizes nobility, pride, fierceness, freedom, superiority, courage,  and powerful intellectual ability. It also represents self-renewal and your connection with your spirituality. You will struggle fiercely and courageously to realize your highest ambitions and greatest desires. Alternatively, if you live in the United States, then the national bird could represent</font><span style=\"font-size: medium;float: none;\"> </span><font face=\"Arial\" color=\"#000000\" style=\"font-size: medium;\">your patriotism and devotion to country.</font><br/></p><p></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\" color=\"#000000\">To see a chained or trapped eagle in your dream represents a desperate situation where you are feeling restricted and confined. You are unable to express yourself and be who you really want to be. Consider also what the eagle is chained down to for additional clues as to what might be holding you back. </font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\" color=\"#000000\">To see a nest of young eagles in your dream represents your achievements and your climb to the top of the social ladder. </font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\" color=\"#000000\">To dream that you kill an eagle signifies your ruthlessness. You will let nothing stand in your way of ambitions and obtaining your goals, even if it means hurting those around you. If someone else kills an eagle, then it indicates that your fame, fortune and power will be ruthlessly taken from you.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\" color=\"#000000\">To dream that you eat the flesh of an eagle implies that your strong and powerful character will lead you to great wealth and influence.</font></p><p></p>", "deleted": false}, {"id": 21804, "name": "Earlobe", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that your earlobes are long represent your spiritual or ancestral connection. It is also indicative of royalty and your social status in life.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are stretching your earlobes indicates your desires to be more connected with your ancestors and understanding of where you came from. Alternatively, it means that you want to stand out and be different. You want to go against the norm.</font></p>", "deleted": false}, {"id": 21805, "name": "Earmuffs", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are wearing earmuffs means that you have a tendency to hear what you want to hear and not what was actually said. If you see someone else wearing earmuffs, then it implies that you have trouble making yourself heard. You have a difficult time to get others to listen to you. </font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">Seeing or buying earmuffs in your dream indicates ignorance. </font></p>", "deleted": false}, {"id": 21806, "name": "Earplugs", "definition": "<p>To dream that you are wearing or putting on earplugs suggests that there is something that you are refusing to hear or believe. Alternatively, the dream may mean that you are isolating yourself from others. <br/></p>", "deleted": false}, {"id": 21807, "name": "Earrings", "definition": "<p><b style=\"font-size: large;\"></b></p><p style=\"text-align: left;\"><font face=\"Arial\">To dream that you or someone is wearing earrings suggests that you need to listen more carefully and pay attention to a message that someone is conveying to you. In particular, to see or wear pearl earrings in your dream indicates that are being given some wise advice you should follow. Alternatively, pearl earrings may serve as a memory of a person in your life who wore them.</font></p><p style=\"text-align: left;\"><font face=\"Arial\">To see broken earrings in your dreams suggests that someone is talking about you.</font></p><p style=\"text-align: left;\"><font face=\"Arial\">To dream that you are buying earrings represents your desire for acceptance and affection.</font></p><p style=\"text-align: left;\"><font face=\"Arial\">To dream that you lose an earring indicates that you are being misguided.</font></p><p><font size=\"4\"><b style=\"font-size: large;\"></b></font></p>", "deleted": false}, {"id": 21808, "name": "Ears", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see ears in your dreams suggest that you need to be more responsive or receptive to guidance and assistance from others. You may be relying too much on your own judgment and intuition. You need to listen more closely to what you are being told. Alternatively, it signifies your immaturity and lack of experience. If you dream that your ears are weird or oddly shaped, then it indicates deception.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are cleaning wax from your ears suggests that you are not listening to those around you. There may be something that you are refusing to hear. Are you turning a deaf ear?</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream of pain in your ear indicates that you will be receive some bad or offensive news. </font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that your ear has been severed or cut off implies that you are tired of hearing what others tell you. If someone else's ear has been cut off, then it suggests that you should keep your opinions to yourself. Or that you need to stop talking about others.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that your ear is being pulled indicates dissent and disagreements. If you are pulling someone else's ear, then it suggest that you have a tendency to force your opinions on others.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that your ears are getting red symbolizes shame or guilt.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that someone is whispering in your ear suggests that you need to pay closer attention to something or listen to someone more carefully. Alternatively, it represents your insecurities and anxieties that people are talking about your behind your back.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\" size=\"3\">To dream that you are getting your ears pierced represents some stinging remarks or insults.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\" size=\"3\">To dream that there is a fly in your ear implies that someone is trying to discretely tell you something that you don't want to hear. </font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\" size=\"3\">Dreaming that there are bugs coming out of your ear suggests that you have overheard something that you shouldn't have. Alternatively, bugs in your ear represent rumours.</font></p>", "deleted": false}, {"id": 21809, "name": "Earth", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To notice the earth in your dream indicates that you need to be &#34;grounded&#34; and realistic. Perhaps your sense of stability and security is lacking. Consider the consistency of the earth for additional significance on how you are feeling. If the earth opens or separates, then it represents a project or relationship that you are afraid of falling into. </font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you can bend the earth signifies your ability to control your actions and react at a precise or optimal moment.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see the planet Earth in your dream signifies wholeness and global consciousness. You are interconnected with the world. </font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream of the Earth's core symbolizes suppressed anger. You are holding in a lot of negative emotions.</font></p>", "deleted": false}, {"id": 21810, "name": "Earthquake", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream of an earthquake suggests that you are experiencing a major &#34;shake-up&#34; that is threatening your stability and foundation.  The dream highlights your insecurity, fears and sense of helplessness. Is there something in your life that you feel at &#34;fault&#34; for?   </font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">If you find cover from the quake, you will overcome these challenges.  If you become trapped or injured during the quake, you will suffer some sort of loss in your life. According to the bible, earthquakes symbolize God's anger and power. </font></p>", "deleted": false}, {"id": 21811, "name": "Earthworm", "definition": "<p>To see an earthworm in your dream indicates that you need to go deep into your subconscious in order to unearth your hidden feelings and desires. Alternatively, earthworms symbolize little things that can be beneficial for your growth and well-being. It also represents renewal. Perhaps you need to restore some aspect of yourself. <br/></p>", "deleted": false}, {"id": 21812, "name": "Earwax", "definition": "<p>To dream that you have excessive earwax suggests that there is something you are refusing to hear. <br/></p>", "deleted": false}, {"id": 21813, "name": "Earwig", "definition": "<p>To see an earwig in your dream signifies unpleasant news that will affect both your professional and family spheres.<br/></p>", "deleted": false}, {"id": 21814, "name": "East", "definition": "<p>To dream that you are headed east represents inner wisdom, rejuvenation, and spiritual enlightenment.  You need to dedicate yourself to your goals, family, career, etc. The direction east also symbolizes the sun. Since east is related to the direction right, it can suggest that you are headed in the right direction.<br/></p>", "deleted": false}, {"id": 21815, "name": "Easter", "definition": "<p>To dream about Easter suggests that the worst of your problems are over. Things will look up for you after a period of darkness and sadness. It is time to walk with your head held high and stop being ashamed.  Alternatively, the dream symbolizes resurrection and spiritual rebirth.<br/></p>", "deleted": false}, {"id": 21816, "name": "Easter Egg", "definition": "<p>To see Easter eggs in your dream symbolize potential, bewilderment and wonder. You need to recognize that potential and unleash it. The dream may also be symbolic with the passage of time.<br/></p>", "deleted": false}, {"id": 21817, "name": "Easter Island", "definition": "<p>To dream of Easter Island represents self-exploration and your connection with a higher power. More directly, the dream may be about your desire to travel back in time to an ancient civilization.<br/></p>", "deleted": false}, {"id": 21818, "name": "Eating", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are eating alone signifies loss, loneliness, and depression. You may feel rejected, excluded, and cut off from social/family ties. Eating may be a replacement for companionship and provide a form of comfort. Alternatively, eating alone reflects independent needs. Also consider the phrase, &#34;what's eating you up?&#34; in reference to anxiety that you may be feeling.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are eating with others signifies harmony, intimacy, merriness, prosperous undertakings, personal gain, and/or joyous spirits.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are overeating or not eating enough signifies a lack of spirituality and fulfillment in your waking life. Food can represent love, friendship, ambition, sex or pleasure in your life. Thus, food is a metaphor to fulfill and gratify your hunger for love and desires. If you are refusing to eat, then it indicates that you want to be more independent and not rely on others so much. If you dream that you are a picky eater, then it indicates that you are holding back something. If you are currently dieting in your waking life, then the dream may serve to compensate for the sustenance that you are lacking.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that someone clears away the food before you finish eating foretells that you will have problems and issues from those beneath you or dependent upon you.</font></p>", "deleted": false}, {"id": 21819, "name": "Eating Contest", "definition": "<p>To dream that you are in an eating contest suggests that you are lacking a social life. You are turning to food as a companion. Consider also the type of food you are eating to determine which area of your life is severely lacking. Alternatively, the dream highlights your ability to process emotions quickly.<br/></p>", "deleted": false}, {"id": 21820, "name": "Eavesdropping", "definition": "<p>To dream that you are eavesdropping signifies the coming of bad news. You will not like what you hear. Alternatively, it indicates that you are left out on something or someone is hiding information from you. As a result, you are feeling insecure.<br/></p>", "deleted": false}, {"id": 21821, "name": "Ebony", "definition": "<p>To dream that something is made of ebony represents mystery, richness, smoothness. or some alluring quality.<br/></p>", "deleted": false}, {"id": 21822, "name": "Ebook", "definition": "<p>To see or read an ebook in your dream refers to modern knowledge. It also points to a wealth of information that is accessible right at your fingertips. Alternatively, dreaming of an ebook signifies a concept or idea that you are unable to fully grasp. Note also that an ebook may often have the same interpretation as a book.<br/></p>", "deleted": false}, {"id": 21823, "name": "Echo", "definition": "<p>To hear or make an echo in your dream symbolizes your need to repeat yourself in order to be heard and for others to believe you. Pay attention to the power and impact of your own words. You are waiting and hoping for a reaction from those around you. It is also symbolic of the soul. Alternatively, to hear your own voice echo indicates that someone is mocking you. Or it could mean that your past actions will come back to haunt you. You need to confront those old memories and past issues.<br/></p>", "deleted": false}, {"id": 21824, "name": "Eclipse", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream of an eclipse of the sun indicates self-doubt and fears of not achieving your goals. You feel you are being overshadowed and are underestimating your abilities. Your level of confidence is fading or lost. You may be undergoing some difficult times and unable to remain optimistic.  </font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see the eclipse of the moon in your dream signifies that your feminine side is being overshadowed. Or it may mean that some hidden aspect of yourself is coming to the surface.   </font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that the eclipse has passed symbolizes new light and knowledge. You need to look at a problem from a different perspective.</font></p>", "deleted": false}, {"id": 21825, "name": "Ecstasy", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream of feeling ecstasy indicates that you will experience much happiness and joy, especially amongst family and friends.</font></p>", "deleted": false}, {"id": 21826, "name": "Editor", "definition": "<p>To dream that you are an editor implies that you are censoring yourself and watching what you say. You are controlling your feelings.<br/></p>", "deleted": false}, {"id": 21827, "name": "Education", "definition": "<p>To dream about your education symbolizes your desire for knowledge. You are on a higher level that you peers. <br/></p>", "deleted": false}, {"id": 21828, "name": "Eel", "definition": "<p>To see an eel in your dream indicates that you have issues with commitment. It also means that you have problems holding on to things. Consider the phrase &#34;slippery as an eel&#34; to mean someone who escapes responsibility or culpability. Alternatively, the eel may be a phallic symbol and thus have erotic connotations.<br/></p>", "deleted": false}, {"id": 21830, "name": "Egg", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see or eat an egg in your dream symbolizes fertility, birth and your creative potential. Something new is about to happen. If the eggs are scrambled, then the dream represents your commitment on a set course. It may also mean that you need to accept the consequences of your actions. Dreaming of hard-boiled eggs indicate a commitment toward your goals and your unwillingness to deviate from the course.  If you see eggs hatching in your dream, then it indicates that you will realize your goals. It also means that your ideas are coming to fruition. </font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To find a nest filled with eggs in your dream signify some financial gain; the more abundant and bigger the eggs, the more significant the gain. </font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see cracked or broken eggs in your dream represent feelings of vulnerability or a fragile state in your life. Consider the phrase, walking on eggshells. Alternatively, you may be breaking out of your shell and being comfortable with who you are.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see bright colored eggs in your dream symbolizes celebration of a happy event.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream of rotten eggs signify loss. You may have allowed some situation to take a turn for the worse. Alternatively, the dream is telling you that something may look fine on the outside, but as you delve deeper, you find that it is not what it appears to be. Perhaps, something is too good to be true.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see fish eggs in your dream represent an idea that has emerged from your subconscious.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">Dreaming of only the egg whites refers to your support system in your new endeavor. It is also symbolic of your comfort zone and knowing your limitations.</font></p>", "deleted": false}, {"id": 21829, "name": "Eggplant", "definition": "<p>To see or eat eggplants in your dream signify satisfaction with where you life is at.  It may indicate abundance or fertility. Eggplants are also symbolic of loyalty, passion and devotion.<br/></p>", "deleted": false}, {"id": 21831, "name": "Eggshells", "definition": "<p>To see eggshells in your dream symbolize your fragile or vulnerable state of mind. Alternatively, the dream implies that you need to break out of your shell and let others know your true self. It is time to let your guard down a little.<br/></p>", "deleted": false}, {"id": 21832, "name": "Egret", "definition": "<p>To see an egret in your dream refers to some codependent relationship.<br/></p>", "deleted": false}, {"id": 21833, "name": "Egypt", "definition": "<p>To dream of Egypt indicates the roots and core of your own emotions and spirituality. It suggests of a time in life where things may have been simpler.<br/></p>", "deleted": false}, {"id": 21834, "name": "Eiffel Tower", "definition": "<p>To see the Eiffel Tower in your dream symbolizes strength and longevity. You have a solid relationship and strong support system. Alternatively, the dream symbol refers to romance.<br/></p>", "deleted": false}, {"id": 21835, "name": "Eight Ball", "definition": "<p>To see the eight ball in your dream indicates that you tend to leave things to chance or fate. Consider the phrase, to be &#34;behind the eight ball&#34;. Perhaps you feel that you are stuck or that you are in a hopeless situation. You need to remain strong. Also consider the significance of the number eight in your waking life.<br/></p>", "deleted": false}, {"id": 21836, "name": "Ejaculation", "definition": "<p>To dream that you are ejaculating represents your need for release. You can no longer contain yourself, either emotionally or sexually. Alternatively, it signifies a loss of control and power.<br/></p>", "deleted": false}, {"id": 21837, "name": "Elbows", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see your own elbow in your dream indicates that you need to make a space for yourself. Your dream may express hesitance or fear in creating your own space for fear of being scrutinized. Alternatively, the dream may be a pun on your need to put more &#34;elbow grease&#34; on some task.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that your elbow is wounded suggests your inability to function in some waking situation. It may also refer to some sexual anxiety. The right elbow relates to moral and ethical issues while the left elbow represents passiveness and your undeveloped characteristics.  </font></p>", "deleted": false}, {"id": 21838, "name": "Elderberries", "definition": "<p>To see elderberries in your dream symbolize domestic bliss and comfort.<br/></p>", "deleted": false}, {"id": 21839, "name": "Elderly", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see an elderly person in your dream represents wisdom or spiritual power. Pay attention to the message or advice that the elderly person is conveying to you. He or she can help provide life answers and solutions to your problems and try to guide you toward the right direction.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">Dreaming of an elderly person with two new front baby teeth refers to the cycle of life or how things have a tendency of coming full circle.</font></p>", "deleted": false}, {"id": 21840, "name": "Election", "definition": "<p>To dream that you are at an election represents a choice that you need to make which may affect others.<br/></p>", "deleted": false}, {"id": 21841, "name": "Electric Blanket", "definition": "<p>To see an electric blanket in your dream indicates that you need to conserve your energy and get some much needed rest. Alternatively, the dream mean that you lack the ability to fulfill or sustain your needs.<br/></p>", "deleted": false}, {"id": 21842, "name": "Electric Chair", "definition": "<p>To see an electric chair in your dream indicates a sudden end to something in your life. You are making a drastic change. Alternatively, the dream represents feelings of guilt, regret, or remorse about something you did.<br/></p>", "deleted": false}, {"id": 21843, "name": "Electric Fence", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see an electric fence in your dream indicates that anger has caused you to isolate yourself from everyone else. Or it may be that others may be afraid to approach you because of your highly charged personality.</font></p>", "deleted": false}, {"id": 21844, "name": "Electric Guitar", "definition": "<p>To see or play an electric guitar in your dream signifies the power and strength of your passions. You clearly express your feelings to others. Alternatively, it is symbolic of youth and rebellion.<br/></p>", "deleted": false}, {"id": 21845, "name": "Electric Saw", "definition": "<p>To see an electric saw in your dream signifies your ability to get down to the core of the problem. You know how to get to the point quickly.<br/></p>", "deleted": false}, {"id": 21846, "name": "Electricity", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream of electricity symbolizes vigor and life energy. You need to be revitalized. Alternatively, the dream suggests that you need to conserve your energy.   </font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that the electricity is fried or out indicates your lack of insight and perspective on a situation.</font></p>", "deleted": false}, {"id": 21847, "name": "Electricity Tower", "definition": "<p>To see an electricity tower in your dream symbolizes a distribution of power. You do not need to always be in full control. You need to delegate responsibilities and duties. Alternatively, the dream symbolizes industry and modernity.<br/></p>", "deleted": false}, {"id": 21848, "name": "Electrocution", "definition": "<p>To dream of an electrocution indicates that the current course of your actions will lead to disaster. The dream also represents fear and the consequences of your actions. You need to be more aware of your surroundings and those around you. <br/></p>", "deleted": false}, {"id": 21849, "name": "Elemental Bending", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you can bend fire refers to your ability to control your anger.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you can bend water represents your ability to control your emotions. You can hide your feelings well.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\" size=\"3\" color=\"#000000\">To dream that you can bend air refers to your ability to control and watch what you say. You are careful in how you choose your words.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you can bend the earth signifies your ability to control your actions and react at a precise or optimal moment.</font></p>", "deleted": false}, {"id": 21850, "name": "Elephant", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see an elephant in your dream indicates that you need to be more patient or more understanding of others. Or perhaps there is a memory that you are holding on to for too long. You need to let go of the past. The elephant is also a symbol of power, strength, faithfulness and intellect. Alternatively, the elephant's introverted personality may be a reflection of your own personality. In particular, if you see a white elephant, then it symbolizes royalty.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are riding an elephant indicates that you are in control of your subconscious and aspects that you were once afraid of.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are afraid of the elephant suggests that there is an enormous problem that you are afraid to confront.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are an elephant suggests that you need to make your opinions and views known. You need to be more vocal and voice your ideas. Express yourself. Alternatively, dreaming that you are an elephant may be reflective of your conservative views. The elephant is the symbol of the United States Republican party. Perhaps you are sharing the same views as the Republican party.</font></p>", "deleted": false}, {"id": 21851, "name": "Elevator", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are ascending in an elevator represents a rise to status and wealth. You may have risen to a higher level of consciousness and are looking at the world from an elevated viewpoint. If the elevator is moving upward in an out of control fashion or it crashes through the roof, then it indicates that you are being catapulted to a position of power in which you do not yet know how to deal with. You are afraid of the new responsibilities ahead for you. Descending in an elevator suggests that you are being grounded or coming back down to reality. It also signifies setbacks and misfortunes.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">In general, the up and down action of the elevator represents the ups and downs of your life. It also symbolizes emotions and thoughts that are emerging out of and submerging into your subconscious. Alternatively, the dream may have sexual connotations.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that the elevator is out of order or that it is not letting you off symbolizes that your emotions have gotten out of control. It may be a reflection of your life or your career. You are feeling stuck in some aspect of your life, whether it is your career, relationship, etc.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that the elevator is moving sideways means that your efforts are counterproductive. You are going nowhere in your work, relationship or other situation. </font></p>", "deleted": false}, {"id": 21852, "name": "Eleventh Hour", "definition": "<p>To dream of the eleventh hour signifies that time is running out for you.  This may be an approaching deadline for a project or a decision that needs to be made by you.<br/></p>", "deleted": false}, {"id": 21853, "name": "Elf", "definition": "<p>To see an elf in your dream refers to some imbalance and disharmony in your life. The elf often serves as a guide of the soul. Alternatively, it suggests that you need to be more carefree, worry-free, and light-hearted.<br/></p>", "deleted": false}, {"id": 21854, "name": "Elk", "definition": "<p>To see an elk in your dream symbolizes strength and endurance. It is also an indication that you need to spend more time with friends and eat healthier. <br/></p>", "deleted": false}, {"id": 21855, "name": "Elm", "definition": "<p>To see an elm tree in your dream indicates death, misfortune, and bad luck.<br/></p>", "deleted": false}, {"id": 21856, "name": "Elopement", "definition": "<p>To dream that you are eloping suggests that you are trying to escape from the problems of your daily life. You are trying to maintain some sort of balance in aspects of your spiritual, emotional and daily life.<br/></p>", "deleted": false}, {"id": 21857, "name": "Eloquent", "definition": "<p>To dream that you are eloquent signifies your readiness for an upcoming task or event.<br/></p>", "deleted": false}, {"id": 21858, "name": "Email", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream about email indicates that you need to reach out to people who may not necessarily always physically be around. It could also very well mean that you have been spending too much time in front of the computer and this has carried over into your dreams.</font></p>", "deleted": false}, {"id": 21859, "name": "Embankment", "definition": "<p>To see or drive along an embankment in your dream signifies the threat of trouble and unhappiness. You are struggling with success.<br/></p>", "deleted": false}, {"id": 21860, "name": "Embarrassment", "definition": "<p>To dream that you are embarrassed signifies hidden weaknesses, fears and lack of self-confidence. This dream also suggests that you are also harboring some insecurities about your sexuality.<br/></p>", "deleted": false}, {"id": 21861, "name": "Emblem", "definition": "<p>To see an emblem in your dream represents your cultural ties and ancestral links. The dream provides you with a sense of confidence and inner strength.<br/></p>", "deleted": false}, {"id": 21862, "name": "Embrace", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are embracing yourself symbolizes self-acceptance and self-love.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are embracing someone else indicates that you are in need of more affection or that you need to show more love.</font></p>", "deleted": false}, {"id": 21863, "name": "Embroidery", "definition": "<p>To dream that you are embroidering symbolizes your ability to make the best of everything that comes your way.<br/></p>", "deleted": false}, {"id": 21864, "name": "Embryo", "definition": "<p>To dream of an embryo symbolizes the emergence of a fresh idea. Also, your subconscious feelings may be surfacing. Alternatively, the dream may refer to your feelings of vulnerability and your need to be protected. However if you are pregnant, it is quite common to see an embryo in your dream.<br/></p>", "deleted": false}, {"id": 21865, "name": "Emerald", "definition": "<p>To see an emerald in your dream represents strength, longevity, immortality, faithfulness, durability, and fertility. You may be entering the healing stages of some situation.<br/></p>", "deleted": false}, {"id": 21866, "name": "Emergency", "definition": "<p>To dream of an emergency indicates that there is a urgent matter that needs your immediate attention. You are about to learn an important lesson.<br/></p>", "deleted": false}, {"id": 21867, "name": "Emergency Alert System", "definition": "<p>To hear or see a message from the emergency alert system is a wake-up call to get aspects of your life in order. It is time to take action.<br/></p>", "deleted": false}, {"id": 21868, "name": "Emergency Room", "definition": "<p>To dream that you are in an emergency room implies that your current lifestyle is doing you harm. You need to reevaluate your actions and its consequences.<br/></p>", "deleted": false}, {"id": 21869, "name": "Emery Board", "definition": "<p>To see an emery board in your dream suggests that you need to smooth out the rough edges of your personality or your relationship with others. You may be a little too harsh and too abrasive toward others. <br/></p>", "deleted": false}, {"id": 21870, "name": "Emigration", "definition": "<p>To dream that you are emigrating suggests that you are dissatisfied with your waking situation and are looking for a change. Alternatively, it indicates that you are trying to escape from life's problems instead of confronting them.<br/></p>", "deleted": false}, {"id": 21871, "name": "Emoticon", "definition": "<p>To see emoticons in your dream represents your range of emotions. You are feeling emotionally overwhelmed. Alternatively, dreaming of emoticons suggests that your feelings are being trivialized or that someone is discounting how you feel.<br/></p>", "deleted": false}, {"id": 21872, "name": "Emotionless", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are emotionless suggests that you are closing yourself off from those around you. You may be neglecting your own feelings and need to start paying more attention to them.</font></p>", "deleted": false}, {"id": 21873, "name": "Emotions", "definition": "<p>Emotions expressed in dreams are a way for you to act out the feelings that you normally would not express if you were awake. The dream provides a &#34;safe&#34; outlet for these emotions instead of letting them get pent up. However if you feel of mix of emotions in your dream, especially if they are contradictory, then it means that your conscious and subconscious are in an emotional conflict. <br/></p>", "deleted": false}, {"id": 21874, "name": "Emperor", "definition": "<p>To see an emperor in your dream represents completion and creativity. You are trying to maintain harmony and peace.<br/></p>", "deleted": false}, {"id": 21875, "name": "Employee", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see an employee in your dream symbolizes your waking relationship with them. You may be experiencing work difficulties or work-related stress.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you have a new employee indicates that you are discovering a new aspect of yourself.</font></p>", "deleted": false}, {"id": 21876, "name": "Employment", "definition": "<p>To dream of your employment suggests that your talents are being utilized. It may also mean that you need to put more focus on your professional life. Alternatively, the dream may be analogous to your own self worth.<br/></p>", "deleted": false}, {"id": 21877, "name": "Empress", "definition": "<p>To see an empress in your dream represents power honor, influence, pride and status. You may be letting power get the best of you. The empress may also symbolize the Great Mother.<br/></p>", "deleted": false}, {"id": 21878, "name": "Emptiness", "definition": "<p>To dream of emptiness suggests that there is something missing or lacking in your life. It symbolizes fruitless labor, an emotional void, or loneliness. There is nothing to show for all  the effort that you have dedicated to a project or relationship. In particular, to dream that a container is empty represents optimism. <br/></p>", "deleted": false}, {"id": 21879, "name": "Emu", "definition": "<p>To see an emu in your dream implies that you are emotionally resilient. You are also observant. Alternatively, the dream may be telling you that you are being overbearing.<br/></p>", "deleted": false}, {"id": 21880, "name": "Enchantment", "definition": "<p>To dream that you are being enchanted indicates that you are being manipulated or influenced to your demise. <br/></p>", "deleted": false}, {"id": 21881, "name": "Enchantress", "definition": "<p>To see an enchantress in your dream symbolizes feminine power and the ability to influence and persuade.<br/></p>", "deleted": false}, {"id": 21882, "name": "Enclosure", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are in an enclosure indicates that you are in defensive mode. Some situation in your waking life has put you on guard. You feel the need to protect and defend yourself. </font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are in an enclosure that is shrinking indicates that you feel restrained and confined in some circumstance. It represents actual or perceived limitations. You need to start testing out your boundaries in order to grow.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are in an enclosure made of glass suggests that you are too critical about a person or situation. </font></p>", "deleted": false}, {"id": 21883, "name": "Encyclopedia", "definition": "<p>To dream of seeing or searching through encyclopedias symbolizes your pursuit for literary knowledge and the fine arts. Although these pursuits may not be financially beneficial, you are enriching you mind. <br/></p>", "deleted": false}, {"id": 21884, "name": "End", "definition": "<p>To dream of an end to something represents an achievement or goal that has been reached. It may also mean that the bad times are coming to an end. Or perhaps your time is running out and you need to come to a decision about some issue. The end of something also signals the beginning of something new. <br/></p>", "deleted": false}, {"id": 21885, "name": "End Credits", "definition": "<p style=\"font-size: medium;\"><font face=\"Arial\">To see the end credits of a movie or show in your dream represents recognition for your work. You are looking for acknowledgement for a job well done. </font></p><p style=\"font-size: medium;\"><font face=\"Arial\">To see your name in the end credits in your dream symbolizes your confidence in your own ability. You believe that you can succeed in whatever you pursue.</font></p>", "deleted": false}, {"id": 21886, "name": "F", "definition": "<p>To see the letter &#34;F&#34; in your dream symbolizes failure. It may also denote an expletive as in &#34;F you&#34;.<br/></p>", "deleted": false}, {"id": 21887, "name": "Fable", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\" size=\"3\" color=\"#000000\">To dream of reading fables represent your literary mind and romantic notions. Alternatively, the fable indicates that there is a lesson to be learned or a message that you need to listen to. </font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\" size=\"3\" color=\"#000000\">To dream that you are living a fable symbolizes your need to face reality. It is better to face a situation head on then to retreat into a fantasy world.</font></p>", "deleted": false}, {"id": 21888, "name": "Fabric", "definition": "<p>To see reams of fabric in your dream signify creativity. You are the one to shape your own experiences. Consider the color and pattern of the fabric and how it parallels a situation in your life. <br/></p>", "deleted": false}, {"id": 21889, "name": "Face", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\" size=\"3\">To see your own face in your dream represents the persona you show to the world as oppose to the real you. It may refer to how you confront problems and deal with issues in your life. </font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\"><font size=\"3\">To dream that your face is flawed or pimply symbolizes erupting emotions. You may be suffering an attack on your persona or your reputation.</font> According to folklore, if you dream that your face is swollen, then it means that you will see an improvement to your financial situation. </font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that your face or someone's face is cracking indicates some deception or big lie. You are unable to maintain a straight face and are about to be exposed.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you or someone has two faces or that the faces changes quickly from one person to another indicates untrustworthiness. You or someone in your life is acting &#34;two-faced&#34;.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are washing your face suggests that you need to come clean about some matter.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that your face warps into a bubble indicates that you are not expressing your feelings enough. You are keeping too much inside.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">Dreaming of a blurry face means that you have no sense of who this person really are. Your subconscious is telling you not to trust this person. You may be being deceived. </font></p>", "deleted": false}, {"id": 21890, "name": "Face Paint", "definition": "<p>To dream that you are getting your face painted indicates that you are having trouble expressing and verbalizing your feelings. The face paint represents your mood, attitude and emotions, depending on the color or objects being painted on your face, presents your mood, attitude and emotions.<br/></p>", "deleted": false}, {"id": 21891, "name": "Facebook", "definition": "<p>To dream about your Facebook page represents your desires to expand your social circle. You need to reach out to others in a more direct and personal way. It is time to get out there and experience life.<br/></p>", "deleted": false}, {"id": 21892, "name": "Faceless", "definition": "<p>To see a faceless figure or person in your dream indicates that you are still searching for your own identity and finding out who you are.  Perhaps you are unsure of how to read people and their emotions. Therefore, you are expressing a desire to know and understand these people on a deeper level.<br/></p>", "deleted": false}, {"id": 21893, "name": "Facelift", "definition": "<p>To dream that you have a facelift suggests that you are seeking a new self-identity and self-image. You may have experienced a surge in your confidence levels. Alternatively, it symbolizes vanity and you concerns about appearances rather than what is inside. <br/></p>", "deleted": false}, {"id": 21894, "name": "Facial", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\" size=\"3\">To dream that you are getting a facial indicates that you are feeling guilty about something. Alternatively, the dream represents your facade and what you allow other people to see or know about you.</font></p>", "deleted": false}, {"id": 21895, "name": "Factory", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\" size=\"3\">To dream that you are at a factory represents repetitious thinking and an old way of doing things. It is symbolic of predictability and unchanging habits. Alternatively, it signifies business, productivity, energy and bustling activity. You are a person that can get things done.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\" size=\"3\">Dreaming of an abandoned or run-down factory means that you have broken from your routine or have escaped from a monotonous aspect of your life. You are leaving a meaningless past behind and are thinking for yourself. </font></p>", "deleted": false}, {"id": 21896, "name": "Fade", "definition": "<p>To dream that a color is faded indicates a lack of motivation or inspiration.<br/></p>", "deleted": false}, {"id": 21897, "name": "Failure", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream of failure signifies fears of inadequacy and low self-esteem. You are not applying yourself to the fullest potential. Or you are overwhelmed with anxiety and the pressure to excel.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that your business is a failure signifies bad management. You need to be more aggressive and not let fear rule you.</font></p>", "deleted": false}, {"id": 21898, "name": "Fainting", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are fainting suggests your inability to confront some subconscious issues or feelings. You need to be more aware and acknowledge those feelings.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see a family member faint in your dream signifies that you will hear some indiscreet activities from that person.</font></p>", "deleted": false}, {"id": 21899, "name": "Fair", "definition": "<p>To dream that you are at the fair suggests that you may be regressing into your childhood where times were simpler. You feel you can let your inhibitions go and forget about the cultural mores. Also consider the various side shows and arcades as they could symbolize aspects of your personality. Alternatively, the dream may also be a pun on fairness and being &#34;fair&#34; in a situation or decision.<br/></p>", "deleted": false}, {"id": 21900, "name": "Fairy", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see a fairy in your dream indicates that you are in search of some help or advice for a problem or decision, but may not want to directly admit you need help. In particular, if the fairy is evil, then it suggests that an aspect of yourself needs to be set free.  The fairy is also symbolic of your soul and the feminine aspects of yourself.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">Dreaming that a fairy is pushing the moon means that you should not underestimate yourself. It is time to start doing and making things happen. </font></p>", "deleted": false}, {"id": 21901, "name": "Fairy Tale", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are a character in a fairy tale suggests your need to be rescued or to be swept off your feet. It also indicates that you are exploring your limits and trying to awaken your fullest potential.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are reading a fairy tale indicates that you are a romantic at heart.</font></p>", "deleted": false}, {"id": 21902, "name": "Fajita", "definition": "<p>To make or eat fajitas in your dream represent your creative energy and passion. <br/></p>", "deleted": false}, {"id": 21903, "name": "Fake", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that something or someone is fake suggests that you are pretending to be someone you are not. You are putting up front because you are afraid to show your true self.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are faking your own death suggests that you are looking for a new start. You need some change in your life. If you dream that your significant other is faking their own death, then the dream represents something new that you are learning about them. Or it may mean that they are not who you thought they were.</font></p>", "deleted": false}, {"id": 21904, "name": "Fakir", "definition": "<p>To see a fakir in your dream indicates phenomenal change in your life.<br/></p>", "deleted": false}, {"id": 21905, "name": "Falcon", "definition": "<p>To see a falcon in your dream suggests that you are focused in your goals and aspirations.  <br/></p>", "deleted": false}, {"id": 21906, "name": "Fall", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you fall and are not frightened signifies that you will overcome your adversities with ease.    </font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you fall and are frightened indicates a lack of control, insecurity, and/or lack of support in your waking life. You may be experiencing some major struggle and/or overwhelming problem. It may also imply that you have failed to achieve a goal that you have set forth for yourself.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">Dreaming that you fall backwards suggests that you prevented yourself from making a bad decision or mistake. It may also mean that you are not ready to move forward and need to take a step back. </font><font face=\"Arial\" color=\"#000000\"> </font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are free-falling through water indicates that you are feeling overwhelmed with emotions. You may feel that it is easier to give up, then to try to stay afloat or prevent yourself from going under. </font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\" size=\"3\">To dream of the fall season indicates that something is about to come to an end and something new will begin. Alternatively, the dream is symbolic of the cycle of life. It is time to collect the benefits and rewards that you've worked so hard for. </font></p>", "deleted": false}, {"id": 21907, "name": "False Teeth", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are wearing false teeth indicates that you are not being completely honest in some waking matter. </font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see or dream that others are wearing false teeth suggests that someone in your life is not who they say they are. They are being deceitful.</font></p>", "deleted": false}, {"id": 21908, "name": "Fame", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you have fame denotes unrealized achievements or failed aspirations. You constantly need reaffirmation, praises and acknowledgment. You want to be admired and looked up to by those around you.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see famous people in your dream signifies an increase to your prosperity and honor.</font></p>", "deleted": false}, {"id": 21909, "name": "Family", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see your own family in your dream represents security, warmth and love. It could also symbolize bitterness, jealousy, or rivalry, depending on your relationship with your family. Alternatively, it could mean that you are overly dependent on your family, especially if the family members are in your recurring dreams. Consider also the significance of a particular family member or the relationship you have with them. If you dream that your family does not act or appear as they normally are, then it means that you want to distance yourself from them. Or you simply don't understand where they are coming from.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see someone else's family in your dream symbolizes togetherness. The dream serves to remind you that other people can come and go out of your life, but you will always have family. Alternatively, dreaming about someone else's family suggests that you are idealizing or romanticizing what a real family should be like. You want what other families have.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">Dreaming that a serial killer is killing off members of your family implies that you are feeling cut off from your family. </font></p>", "deleted": false}, {"id": 21910, "name": "Family Guy", "definition": "<p>To dream about the Family Guy cartoon implies how you cope with what life throws at you. You feel that you are a target of criticism. Perhaps you identify with one of the characters in the show. Consider their key traits and how you can relate to those qualities. If you dream that the characters in Family Guy are not behaving like the normally are in the show , then it refers to a situation where you are acting inappropriately. You have gone too far.<br/></p>", "deleted": false}, {"id": 21911, "name": "Famine", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream of famine signifies a negative turn in business and in health. Alternatively, it indicates feelings of guilt for what you have, while others are struggling for their livelihood. </font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are famished indicates that you are in need of love, affection and emotional nourishment.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see others in famine signifies your sympathy toward others. It may also symbolize your dedication to worldly causes.  </font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are feeding people in a famine area indicates your ability to offer love to others. If you run out of food, then it suggests that you are emotionally drained.</font></p>", "deleted": false}, {"id": 21912, "name": "Fan", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see a  fan in your dream refers to the changes in your life. It may also signifies your need to calm down after a highly charged emotional situation or state.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are fanning yourself or that someone is fanning you represents your lack of self-confidence. Alternatively, the dream symbolizes secret desires.</font></p>", "deleted": false}, {"id": 21913, "name": "Fancy", "definition": "<p>To dream of fancy things indicates that you are putting up a facade and hiding your true self. You are trying to divert attention to unimportant things.<br/></p>", "deleted": false}, {"id": 21914, "name": "Fangs", "definition": "<p>To see fangs in your dream indicate that you have said some words that have been hurtful to others. <br/></p>", "deleted": false}, {"id": 21915, "name": "Fanny Pack", "definition": "<p>To dream that you are wearing a fanny pack indicates that you are feeling out of place. You feel you are not fitting in.<br/></p>", "deleted": false}, {"id": 21916, "name": "Fantasy", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream of a fantasy world may be a way for your mind to highlight what is normal. Alternatively, the dream may be telling you to expand your thinking and use your imagination and creativity. Explore all your options no matter how strange or illogical it may be.</font></p>", "deleted": false}, {"id": 21917, "name": "Far", "definition": "<p>To see something or someone far away in your dream suggests that you are feeling emotionally distant from that person or what that something means to you. Perhaps you are feeling alone or that you are the odd person out. Alternatively, it represents something that is unattainable or something that you failed to achieve.<br/></p>", "deleted": false}, {"id": 21918, "name": "Fare", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are paying a fare represents the price you need to pay for success. You may be putting your work or ambition ahead of your loved ones.  The dream may also be a pun on &#34;fair&#34; or &#34;fairness&#34;.</font></p>", "deleted": false}, {"id": 21919, "name": "Farewell", "definition": "<p>To dream that you are saying farewell signifies an end to some relationship or phase in your life. <br/></p>", "deleted": false}, {"id": 21920, "name": "Farm", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see or live on a farm in your dream suggests that you need to develop an aspect of yourself and utilize your potential. You are ready for growth.</font></p>", "deleted": false}, {"id": 21921, "name": "Farmer", "definition": "<p>To see or dream that you are a farmer points to your productivity. Are you utilizing your fullest potential? It may also suggest that you need to work harder in order to reap its benefits.<br/></p>", "deleted": false}, {"id": 21922, "name": "Farmer's Market", "definition": "<p>To dream that you are at a farmer's market suggests that you are looking for spiritual enrichment from a higher source.<br/></p>", "deleted": false}, {"id": 21923, "name": "Farsighted", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\" size=\"3\">To dream that you are farsighted suggests that you are overlooking the little details needed to obtain your goals. You are too distracted by the big picture that you are not paying attention to the smaller things.</font></p>", "deleted": false}, {"id": 21924, "name": "Farting", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are farting suggests that you are being passive aggressive. You need to express your feelings in a more direct manner. </font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To smell a fart in your dream implies that someone around you is not telling you how he or she really feels. He or she may be avoiding some topic instead of addressing it. Alternatively, the dream indicates that you are offended by someone in your waking life.</font></p>", "deleted": false}, {"id": 21925, "name": "Fashion", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream about fashion suggests that you are depending too much on your looks to get your way. You need to start looking within yourself.  Alternatively, the dream indicates that you have blended into the background. You need to step up and be more confident.</font></p>", "deleted": false}, {"id": 21926, "name": "Fast Food", "definition": "<p>To see or eat fast food in your dream indicates that you are not taking the time to cater to your emotions. You are not taking good care of your physical or mental health. <br/></p>", "deleted": false}, {"id": 21927, "name": "Fast Forward", "definition": "<p>If your dream is in fast forward, then it suggests that you are living life in the fast lane. You need to slow down.  Alternatively, it may indicate that life is passing you by if you do not jump in and participate in it.<br/></p>", "deleted": false}, {"id": 21928, "name": "Fasting", "definition": "<p>To dream that you are fasting represents self-renewal and self-cleansing. Fasting may also be way to draw attention to some consciousness or problem. Are you trying to punish yourself? Are you feeling guilty about something?<br/></p>", "deleted": false}, {"id": 21929, "name": "Fat", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are fat signifies a fortunate change in your life. You are experiencing abundance in some area of your life. Alternatively, the dream means that you are being overindulgent. You need to learn moderation. A more literal interpretation of this dream is your fears of gaining weight. You have an skewed perception of your own image which may stem from low self-esteem.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that others are fat signifies prosperity. Consider also the phrase &#34;it ain't over till the fat lady sings&#34; and how you need to wait for the final result and not assume the outcome.</font></p>", "deleted": false}, {"id": 21930, "name": "Fate", "definition": "<p>To dream about your fate suggests that you are unwilling to take responsibility for your actions. You feel that it is always someone's fault or someone else's doing. Alternatively, the dream may be trying to help you visualize your goal and what you want to accomplish.<br/></p>", "deleted": false}, {"id": 21931, "name": "Father", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see your father in your dream symbolizes authority and protection. It suggests that you need to be more self-reliant. Consider also your waking relationship with your father and how aspects of his character may be incorporated within yourself. </font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that your father is dead forewarns that you need to proceed with caution in conducting some business matter.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\" size=\"3\">To dream that you are hitting your father represents a desperate need for greater closeness with your father. You feel that he is not listening to you. In particular, if you are hitting your father with a rubber object indicates that whatever you are doing or telling him has no significant effect on him. Things literally just bounce off him. Conversely, if you dream that your father is the one beating you, then it implies a lack of emotional connection with your father.  </font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\" size=\"3\">To dream that your father is angry at you indicates that you are doing something that he may disapprove. The dream may also be a projection of your own anger towards him. There are some unresolved issues that need to be worked out. </font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\" size=\"3\">To see your father wrapped in bandages from head to toe suggests that you are feeling restricted or limited with your authority. Perhaps you are being put in charge of something but can't exercise your power. </font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\" size=\"3\">To dream that your father has a girlfriend or mistress, even though he is still married to your mother implies that you are feeling disconnected with one of your parents. The dream may also be a commentary on your own views of marriage.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\" size=\"3\">To dream that you commit patricide means that you are rejecting authority and rules. You refuse to answer to a higher power. Alternatively, killing your father may also be symbolic of killing an aspect of your own self. You feel that you are becoming like your father and you don't like it.</font></p>", "deleted": false}, {"id": 21932, "name": "Father-In-Law", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see your father-in-law in your dream refers to your conscience and your rational side. You need to be more yielding in your point of view and decisions.</font></p>", "deleted": false}, {"id": 21933, "name": "Fatigue", "definition": "<p>To feel fatigue or see others fatigued in your dream suggests that a relationship is worn out and near its ending point.<br/></p>", "deleted": false}, {"id": 21934, "name": "Faucet", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see a faucet in your dream signifies control of your emotions. You are conscious of what emotions you allow yourself to be expressed. In other words, you have great self control and an ability to turn your emotions on and off at will. If the water is too hot or too cold, then it may be analogous to a situation or relationship in your waking life.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you cannot turn the faucet on or that no water comes out of the faucet indicates that you need to be more careful when offering emotional support as your may be overextending yourself. Alternatively, it may also be indicative of sadness and depression. </font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see a leaky or dripping faucet in your dream represents sexual issues and problems. Alternatively, the dream suggests that you are feeling emotionally drained. Something or someone is draining your emotionally.</font></p>", "deleted": false}, {"id": 21935, "name": "Faun", "definition": "<p>To see a faun in your dream symbolizes mischief. It may also reflect your carefree attitude.<br/></p>", "deleted": false}, {"id": 21936, "name": "Favor", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are asking for a favor indicates you need to let go of your pride and seek help when you need it. Alternatively, the dream may be a pun on something or someone that you are &#34;favoring.&#34;</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are granting a favor represents your compassion and your consideration of others.</font></p>", "deleted": false}, {"id": 21937, "name": "Fawn", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see a fawn in your dream symbolizes true friends and faithfulness in love.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see the color fawn in your dream symbolizes kindness and a gentle heart.</font></p>", "deleted": false}, {"id": 21938, "name": "Fax Machine", "definition": "<p>To see or use a fax machine in your dream indicates that you are receiving some message from your subconscious.  This message will prove to be the real deal.<br/></p>", "deleted": false}, {"id": 21939, "name": "FBI", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that the FBI is after you indicates feelings of guilt. You may also be feeling overwhelmed by life's challenges. Alternatively, the dream may be a metaphor of being wanted.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are an FBI agent signifies your strong sense of morality and integrity. You are guided by honor, structure and what is right.</font></p>", "deleted": false}, {"id": 21940, "name": "Fear", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you feel fear indicates that your achievements will not be as successful as you had anticipated. You are experiencing anxieties in various aspects of your life. The key to overcoming your fear is to discuss them and deal with them openly.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you worse fears are coming true signifies your resistance to change. You are afraid to confront the unknown aspects of yourself.</font></p>", "deleted": false}, {"id": 21941, "name": "Feast", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see a feast in your dream denotes your emotional needs or sexual appetite. There is a lack of balance in your life. If you are gorging yourself at the feast, then it suggests that you are making too much demands of others. It also indicates greediness and selfishness. If you are the only one who did not get any food at the feast, then it indicates your tendency to always put others ahead of your own needs. As a result, you are compromising your own emotional well being and happiness.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To arrive late to a feast signifies of a bothersome event that will occupy your mind.</font></p>", "deleted": false}, {"id": 21942, "name": "Feather", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream of a feather floating in the air signifies a life of ease, comfort, warmth and of financial gains. It may describe your lightheartedness and enjoyment for life. Alternatively, a feather may represent confusion, hastiness, and loss of dignity.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see a feather in you dream symbolizes warmth. You are expressing your tender side and a desire to be close to someone. Consider also how the dream may relate to the proverb &#34;birds of a feather flock together&#34;. Perhaps you need to break away from the masses or you need to make new friends. If the feather is wet, then it indicates a temporary setback.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">In particular, to see chicken feathers in your dream signify minor annoyances.  Eagle feathers represent the realization of your goals and aspirations. To see peacock, ostrich, or any other ornamental feathers, denotes advancement up the social ladder. You will be met with much success in your future. To see the feather of an owl, implies that you need to share your knowledge and wisdom with others. </font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are selling or buying feathers symbolize frugality and thriftiness.</font></p>", "deleted": false}, {"id": 21943, "name": "Feather Duster", "definition": "<p>To see or use a feather duster in your dream indicates that you are uncovering some unused talent. Alternatively, the dream may refer to the monotony of your waking life. You are looking for some excitement.<br/></p>", "deleted": false}, {"id": 21944, "name": "February", "definition": "<p>To dream of the month of February signifies sadness, gloom and ill health. The dream may also symbolize love or you need for love.<br/></p>", "deleted": false}, {"id": 21945, "name": "Feces", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see or come in contact with feces signifies aspects of yourself that are dirty and negative and which you believe to be undesirable and repulsive. You need to acknowledge and express these feelings, even though it may be shameful. Release the negativity in your life. Alternatively, it may also refer to someone who is anal retentive.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are unable to dispose of the feces suggests that you are unwilling to let go of your emotions. You have a tendency to hold in and keep your feelings to yourself.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">According to Freud, feces is related to possession, pride, shame, money/financial matters, or aggressive acts. So to dream that you are playing with feces symbolizes your anxiety over money matters and financial security. </font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">Dreaming about animal feces represents release of your primal or sexual desires. You are tired of hiding your true feelings. If you dream that there are animal feces on the ground and you are trying to avoid stepping on it, then it implies that you are rejecting someone who is showing interest in you. </font></p>", "deleted": false}, {"id": 21946, "name": "Fedora", "definition": "<p>To wear a fedora hat in your dream symbolizes coolness. You don't let stress and pressure get to you. If you see someone wearing a fedora in your dream, it indicates that there is a certain mystique or mystery about them. Perhaps there is something that they are trying to hide.<br/></p>", "deleted": false}, {"id": 21947, "name": "Feeble", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are feeble indicates that you are feeling emotionally drained and stressed. You are preoccupied with something in your mind that is causing you much anxiety.</font></p>", "deleted": false}, {"id": 21948, "name": "Feeding", "definition": "<p>To dream that you are feeding someone indicates that someone in your life is in need of love and acceptance. That someone could be an aspect of yourself.<br/></p>", "deleted": false}, {"id": 21949, "name": "Feet", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see your own feet in your dream symbolizes your foundation, stability and sense of understanding. It signifies your need to be more practical and sensible. Keep both feet on the ground. Alternatively, feet represents mobility, independence and freedom. Perhaps you have taken a step in the right direction and are contemplating your goals or your next step.  The sole of the foot may be a pun of being or feeling like the &#34;sole&#34; or only support of some person or situation. Consider also the idiom of &#34;putting your foot in your mouth&#34;.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are washing your feet indicates that others can easily take advantage of you. For Christians, washing your feet symbolizes forgiveness and compassion. If someone is kissing your feet, then it symbolizes humbleness, humility, or devotion.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you have smelly feet implies that you need to be careful about your next step. If you dream that someone is smelling your feet, then it means that someone is paying attention to the steps that you are taking. To smell someone else's feet in your dream suggests that you are following someone else's path in life instead of paving your own path. The notion of smelling feet may also carry the same interpretation of kissing feet, depending on the context of the dream.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see only the feet being chased in your dream suggests that you are letting others determine where you go or decide on your goals. You are lacking control over the direction of your own life. </font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">Dreaming about other people's feet implies that you are too concerned with where people are going and where they are headed. Alternatively, to see someone else's feet in your dream represents your admiration for this person.</font></p>", "deleted": false}, {"id": 21950, "name": "Fence", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see a fence in your dream signifies an obstacle or barrier that may be standing on your path. You may feel confined and restricted in expressing yourself. Are you feeling fenced in some situation or confined in some relationship? Alternatively, the fence symbolizes your need for privacy. You are trying to shut off the rest of the world. If there is a hole in the fence, then the hole is encouragement that you can overcome and conquer whatever obstacles may be in your way. It may also mean that your privacy is being compromised.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are climbing to the top of a fence denotes success. If you climb over the fence, then it indicates that you will accomplish your desires via not so legitimate means. If you dream that you are on the fence, then the dream may be a metaphor indicating that you undecided about something.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are building a fence suggests that you are building a solid foundation for success. Alternatively, it indicates that you are blocking something out or you are shutting yourself out. </font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you fall from a fence denotes that you are in way over your head in regards to some project which you are dealing with.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see a fence in the water symbolizes an emotional barrier that you are building up around you. You are afraid to reveal your true feelings and don't want to let people in. The condition of the fence is analogous to your emotional state.</font></p>", "deleted": false}, {"id": 21951, "name": "Fencing", "definition": "<p>To dream that you are fencing suggests that you are at odds with someone in your waking life. Consider the relationship you have with the person you are fencing. If this person is unknown, you may be in conflict with an aspect of yourself. Alternatively, fencing symbolizes, agility, cunningness, and speed. Perhaps you need to incorporate these attributes into a situation in your daily life.  <br/></p>", "deleted": false}, {"id": 21952, "name": "Fender", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\" size=\"3\">To dream that your fender is dented indicates that someone is trying to attack your character and break your pride.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\" size=\"3\">To dream that you dent someone else's fender suggests that you need to be more accepting and less critical of others.</font></p>", "deleted": false}, {"id": 21953, "name": "Feng Shui", "definition": "<p><font size=\"3\" style=\"font-size: medium;\">To dream about feng shui represents your search for</font><span style=\"font-size: medium;float: none;\"> spiritual balance, understanding and harmony. You are looking for positivity in your life.</span><br/></p>", "deleted": false}, {"id": 21954, "name": "Fennel", "definition": "<p>To see fennel in your dream represents clarity. Perhaps there is something that you are now seeing more clearly. It is also symbolic of rejuvenation and renewal.<br/></p>", "deleted": false}, {"id": 21955, "name": "Fermentation", "definition": "<p>To dream about something fermenting symbolizes a spiritual transformation. The process may be slow in its development, but the end result will be worth the wait.    <br/></p>", "deleted": false}, {"id": 21956, "name": "Ferns", "definition": "<p>To see ferns in your dream symbolize your future hopes and fears. It also represent solitude.<br/></p>", "deleted": false}, {"id": 21957, "name": "Ferret", "definition": "<p>To see a ferret in your dream symbolizes distrust and suspicion of others. The dream may also be a pun on searching. If the ferret in your dream is white, then it is highlighting or amplifying some trust issues in your waking life.<br/></p>", "deleted": false}, {"id": 21959, "name": "Ferris Wheel", "definition": "<p>To see or ride on a Ferris wheel in your dream suggests that you are going around in circles. You are headed nowhere. Alternatively, it is symbolic of wholeness and the circle of life. Life is full of ups and downs.<br/></p>", "deleted": false}, {"id": 21958, "name": "Ferry", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are riding on a ferry  indicates that you are going through some transitional phases in your life. It also means that you are setting your sights on a new goal.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are waiting for a ferry signifies unforeseen circumstances might hinder your desires and wishes.</font></p>", "deleted": false}, {"id": 21960, "name": "Fertilizer", "definition": "<p>To see or use fertilizer in your dream refers to your growth. You need to continue to absorb knowledge and insights from your surroundings and experiences.<br/></p>", "deleted": false}, {"id": 21961, "name": "Festival", "definition": "<p>To dream that you are at festival symbolizes happiness, celebration and joviality. You are in a good place in your life right now. Alternatively, it suggests that you are trying to escape and blend in with the rest of the crowd.<br/></p>", "deleted": false}, {"id": 21962, "name": "Fetishes", "definition": "<p>To dream that you have a fetish indicates a lack of maturity  or capabilities. It may also be symbolic of a fear.<br/></p>", "deleted": false}, {"id": 21963, "name": "Fetus", "definition": "<p>To see a fetus in your dream symbolizes a newly developing relationship or idea in your waking life. Something creative is happening. Alternatively, you may be expressing difficulties in some situation or relationship.<br/></p>", "deleted": false}, {"id": 21964, "name": "Feud", "definition": "<p>To dream that you are in the middle of a feud suggests that aspects of your personality are in conflict. In particular, if you dream of a family feud, then it indicates that you are struggling with your identity. The dream may also be a reflection of a waking strife between you and your family members.<br/></p>", "deleted": false}, {"id": 21965, "name": "Fever", "definition": "<p>To dream that you have a fever suggests that feelings of anger or hatred are threatening to come to your consciousness. You need to find a safe way to express these feelings. Alternatively, the dream may be analogous to blushing and thus represent some embarrassing situation.<br/></p>", "deleted": false}, {"id": 21966, "name": "Fez", "definition": "<p>To see or wear a fez in your dream signifies leisurely pursuits, ease and relaxation.<br/></p>", "deleted": false}, {"id": 21967, "name": "Fiancé", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see your fiancé in your dream symbolizes your waking relationship with him or her. Often dreams focus on suppressed feelings that you have yet to express to your fiancé.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream about your ex-fiancé means that you need to stop dwelling on the past and move forward. You need to accept that some things don't work out for a reason.</font></p>", "deleted": false}, {"id": 21968, "name": "Fictional Character", "definition": "<p>To see a fictional character in your dream implies that you are trying to escape from your own reality. Consider the qualities of the fictional character and how you may need to incorporate or acknowledge those qualities within yourself. Alternatively, the fictional character may be an archetypal symbol depending on the character.<br/></p>", "deleted": false}, {"id": 21969, "name": "Fiddle", "definition": "<p>To see a fiddle in your dream signifies harmony in the home.<br/></p>", "deleted": false}, {"id": 21970, "name": "Field", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see green fields in your dream symbolize great abundance, freedom, and happiness. You may also be going through a period of personal growth. Alternatively, this dream may simply be an expression for your love of nature.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see freshly plowed fields in your dream signify growth, early rise to wealth and fortunate advancements to places of honor.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see dead or barren fields signifies lack, pessimism and your jaded prospects for the future.</font></p>", "deleted": false}, {"id": 21971, "name": "Field Trip", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are on a field trip indicates that you need to incorporate what you have learned with your experiences. The dream represents a transitional phase. Consider the symbolism of what you see and how your felt during the field trip.</font></p>", "deleted": false}, {"id": 21972, "name": "Fiend", "definition": "<p>To see a fiend in your dream indicates that you need to confront your own demons and dark past. The dream also symbolizes your fears and anger.<br/></p>", "deleted": false}, {"id": 21973, "name": "Fife", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To hear the sound of a fife signifies that you will be unexpected call on to defend your honor.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are playing a fife suggests that your strong reputation will remain intact. You will bounce back from anything that may be said about you.</font></p>", "deleted": false}, {"id": 21974, "name": "Fig Leaf", "definition": "<p>To see a fig leaf in your dream represents a loss of innocence or a fall from grace.<br/></p>", "deleted": false}, {"id": 21975, "name": "Fighter Jet", "definition": "<p>To see or dream that you are in a fighter jet indicates that you are involved in some fast pace project.<br/></p>", "deleted": false}, {"id": 21976, "name": "Fighting", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are in a fight indicates inner turmoil. Some aspect of yourself is in conflict with another aspect of yourself. Perhaps an unresolved or unacknowledged part is fighting for its right to be heard. It may also parallel a fight or struggle that you are going through in your waking life. If you are fighting to the death, then it refers to your refusal to acknowledge some waking conflict or inner turmoil. You are unwilling to change your old attitudes and habits.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see others fighting in your dream suggests that you are unwilling to acknowledge your own problems and turmoil. You are not taking any responsibility or initiative in trying to resolve issues in your waking life.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\" size=\"3\"><span style=\"float: none;\">To dream that you are trying to fight, but cannot throw your arms as hard as you want signifies lack of self-esteem and self-confidence in some area of your waking life. You are unsure of your next move. This dream may also reflect your actual state of REM paralysis during the dream state.</span> </font></p>", "deleted": false}, {"id": 21591, "name": "X", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To see an X in your dream signify something that is forbidden. You are being prevented to do something. </font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream of a treasure map marked by a big X  indicates that your goals are in sight and you will soon be greatly rewarded.</font></p>", "deleted": false}, {"id": 21592, "name": "X-Ray", "definition": "<p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you are being x-rayed denotes that you are being deceived by a person or situation. You need to look beneath the surface of the person or situation. On the other hand, the dream means that you are working through a problem or issue that has been troubling you.</font></p><p style=\"font-size: medium;text-align: left;\"><font face=\"Arial\">To dream that you have x-ray vision suggests that you need to look pass the surface and focus on what is inside. Perhaps the dream is trying to tell you that looks aren't' everything.</font></p>", "deleted": false}, {"id": 21593, "name": "Xylophone", "definition": "<p>To see or play a xylophone in your dream indicates concerns for the environment. You need to be more environmentally conscious. Alternatively, the dream represents your ambition and your drive. It also provides motivation and inspirational insight into the future.<br/></p>", "deleted": false}, {"id": 21555, "name": "Y", "definition": "<p>To see the letter Y in your dream indicates some decision that you need to make. It may represent a fork in the road or a path that you need to choose. The letter Y may also be a pun on &#34;why&#34;. Perhaps there is something that you need to start questioning. <br/></p>", "deleted": false}, {"id": 21556, "name": "Yacht", "definition": "<p>To see a yacht in your dream symbolizes wealth, pleasure, and luxury. You are free of any worries and focused on a life of ease.  The dream may also be telling you that you need to devote more time to recreational pursuits. Just take it easy for a while.<br/></p>", "deleted": false}, {"id": 21557, "name": "Yak", "definition": "<p>To see a yak in your dream represents your uniqueness and dependability. The yak may also be a pun on &#34;yakking&#34; too much. Maybe you should stop talking and listen more.<br/></p>", "deleted": false}, {"id": 21558, "name": "Yam", "definition": "<p>To see or eat yams in your dream signify sensuality and virility. <br/></p>", "deleted": false}, {"id": 21559, "name": "Yantra", "definition": "<p>To see a yantra in your dream represents cosmic energy and emerging consciousness. It also indicates stability and constancy in your life.<br/></p>", "deleted": false}, {"id": 21560, "name": "Yard", "definition": "<p style=\"font-size: medium;\"><font face=\"Arial\">To see a neat and well-kept yard reflects your ability to maintain and organize aspects of your outside life, such as work and your social activities.</font></p><p style=\"font-size: medium;\"><font face=\"Arial\">To see a messy and unkempt yard denotes that aspects of your life are out of your control.</font></p><p style=\"font-size: medium;\"><font face=\"Arial\">In particular, to see your front yard represents what you choose to let other see. It is symbolic of your social personal. Consider the condition of the yard and any objects in the yard. For example, if there is a ball in the front yard, then it may mean that you want others to get to know your playful side.</font></p>", "deleted": false}, {"id": 21561, "name": "Yard Sale", "definition": "<p>To hold or be at a yard sale in your dream indicates that you are recycling past experiences and finding use for your old skills and ideas. You are learning from your past and making productive use of the lessons you have learned. <br/></p>", "deleted": false}, {"id": 21562, "name": "Yardstick", "definition": "<p style=\"font-size: medium;\"><font face=\"Arial\">To see a yardstick in your dream. symbolizes rigidity and an unyielding personality. Alternatively, a yardstick represents good judgment and acceptance.</font></p>", "deleted": false}, {"id": 21563, "name": "Yarmulke", "definition": "<p>To see or wear a yarmulke in your dream symbolizes Judaism and the Jewish faith. Alternatively, the dream suggests that you are trying to shield yourself from some higher spirit or force.<br/></p>", "deleted": false}, {"id": 21564, "name": "Yarn", "definition": "<p>To see yarn in your dream symbolizes your connection and creativity. Alternatively, yarn in your dream means that you are stuck in a rut. You are going about your daily life in the same old tired pattern. If the yarn is tangled and knotted, then it implies that you are experiencing some emotional distress or confusion in a situation.<br/></p>", "deleted": false}, {"id": 21565, "name": "Yawning", "definition": "<p>To dream that you or someone is yawning suggests that you are lacking emotional and intellectual stimulation. You are also lacking energy and vitality in your life.<br/></p>", "deleted": false}, {"id": 21566, "name": "Year", "definition": "<p>To dream of a year signifies a passage of time. It represents a cycle of growth, learning and maturity.<br/></p>", "deleted": false}, {"id": 21567, "name": "Yearbook", "definition": "<p>To see your yearbook in your dream represents the old friends or old flames that you have lost touch with over the years. The dream may also serve to bring you back to a time where you had less responsibilities and less worries. Consider if anybody signed your yearbook and the messages written as it may provide some important advice to follow. <br/></p>", "deleted": false}, {"id": 21568, "name": "Yearn", "definition": "<p>To dream that you are yearning for something or someone indicates that there is a void that is lacking in your waking life. You are suppressing some old habit or denying yourself of something.  What are you yearning for in your dream? You need to fulfill this void.<br/></p>", "deleted": false}, {"id": 21569, "name": "Yeast", "definition": "<p>To see yeast in your dream indicates a spiritual quest.  You may need to do some soul searching and/or self-improvement. Alternatively, yeast is symbolic of growth, renewed energy or increased enthusiasm for an idea or project.<br/></p>", "deleted": false}, {"id": 21570, "name": "Yelling", "definition": "<p>To dream that you or someone is yelling represents repressed anger that needs to be expressed. If you are yelling and no one hears, then it suggests that you are being overlooked in some waking situation. You feel that your voice does not matter or that your opinion does not count. In particular, hearing demonic yelling in your dream means there is something you thought you have left in the past that is still haunting you.<br/></p>", "deleted": false}, {"id": 21571, "name": "Yellow Bird", "definition": "<p>To see a yellow bird in your dream represents a positive outlook in your professional life.<br/></p>", "deleted": false}, {"id": 21572, "name": "Yes", "definition": "<p>To dream that you are saying &#34;yes&#34; symbolizes reaffirmation or acceptance of a condition, situation or decision. The dream may also be giving you permission to do something that you are having doubts about in your waking life. <br/></p>", "deleted": false}, {"id": 21573, "name": "Yesterday", "definition": "<p>To dream about yesterday indicates that you need to stop reliving the past and learn to let go. Focus on the future. Alternatively, the dream symbolizes past regrets.<br/></p>", "deleted": false}, {"id": 21574, "name": "Yeti", "definition": "<p>To see a yeti in your dream suggests that you need to learn to find balance between your reasonable, rational side and your emotional, instinctual nature. <br/></p>", "deleted": false}, {"id": 21575, "name": "Yew Tree", "definition": "<p>To see a yew tree in your dream symbolizes mourning and death. The dream may also be a metaphor to mean &#34;you&#34;, the dreamer.<br/></p>", "deleted": false}, {"id": 21576, "name": "Yield", "definition": "<p style=\"font-size: medium;\"><font face=\"Arial\">To dream that you yield to someone else refers to your willingness to sacrifice your authority in order to maintain calmness in your domestic life or personal relationship.</font></p><p style=\"font-size: medium;\"><font face=\"Arial\">To see a yield sign in your dream suggests that you need to be more flexible in your thinking. Don't be so structured or hard.</font></p>", "deleted": false}, {"id": 21577, "name": "Yin Yang", "definition": "<p>To see the yin yang in your dream symbolizes a balance of opposites. It represents the feminine and the masculine, the spiritual and the physical, and the emotional and the rational. <br/></p>", "deleted": false}, {"id": 21578, "name": "YMCA", "definition": "<p>To see or dream that you are at the YMCA indicates that you are feeling spiritually and physically empowered. Alternatively, the dream may be a metaphor for &#34;why&#34;. There is something that you need to question. YMCA may also refer to the song by the Village People and thus the dream is about a specific period of time or memory that the song brings back for you.<br/></p>", "deleted": false}, {"id": 21579, "name": "Yodel", "definition": "<p style=\"font-size: medium;\"><font face=\"Arial\">To hear yodeling in your dream represents a cryptic message from your subconscious. Listen carefully to the tones and syllables. </font></p><p style=\"font-size: medium;\"><font face=\"Arial\">To yodel in your dream represents the connection between your mind and your heart.</font></p>", "deleted": false}, {"id": 21580, "name": "Yoga", "definition": "<p>To dream that you are performing yoga symbolizes unity, balance, harmony, calmness, and self-discipline. You have complete control of your mind and body. Alternatively, the dream indicates that you are stressed and overwhelmed. You need to take a breather.<br/></p>", "deleted": false}, {"id": 21581, "name": "Yogurt", "definition": "<p style=\"font-size: medium;\"><font face=\"Arial\">To see or eat yogurt in your dream suggests that you need to learn to behave appropriately for the different situations and various circumstances you find yourself in.</font></p>", "deleted": false}, {"id": 21582, "name": "Yoke", "definition": "<p style=\"font-size: medium;\"><font face=\"Arial\">To see a yoke in your dream signifies your unwillingness to conform to the customs and wishes of others.</font></p><p style=\"font-size: medium;\"><font face=\"Arial\">To dream that you are yoking an oxen indicates acceptance. You need to heed the advice of others.</font></p>", "deleted": false}, {"id": 21583, "name": "Yolk", "definition": "<p>To see an egg yolk in your dream represents life, ideas, and creativity. <br/></p>", "deleted": false}, {"id": 21584, "name": "Yorkshire Terrier", "definition": "<p>To see a Yorkie in your dream is telling you not to underestimate someone's small size. Alternatively, the dream may imply that you are being too loud or too vocal. You need to listen more.<br/></p>", "deleted": false}, {"id": 21585, "name": "Young", "definition": "<p style=\"font-size: medium;\"><font face=\"Arial\">To see young people in your dream indicates a fresh outlook on your life. It may also represent a more youthful aspect of yourself. Perhaps you need to be more playful and carefree.</font></p><p style=\"font-size: medium;\"><font face=\"Arial\">To dream that you are young again indicates that you are behaving childish or immaturely. Alternatively, it represents your failed attempts to rectify past mistakes. You are dwelling too much on past regrets and lost opportunities. It is time to move on toward the future.</font></p>", "deleted": false}, {"id": 21586, "name": "Yourself", "definition": "<p>To see yourself in your dream is a reflection of how you act and behave in your waking life. Consider what you are doing and how you are feeling in the dream for additional significance.<br/></p>", "deleted": false}, {"id": 21587, "name": "YouTube", "definition": "<p>To dream that you are watching YouTube signifies subconscious thoughts and ideas that are flowing in your mind. Consider the content of the video that you are watching. If you are watching a &#34;how to&#34; video, then it means that you want to expand your own knowledge. You are open to new experiences. If you are watching a music video, then the song or video may parallel what is going on in your waking life. Alternatively, watching YouTube means that you have control over your own thoughts.<br/></p>", "deleted": false}, {"id": 21588, "name": "Yoyo", "definition": "<p>To see or play with a yoyo in you dream signifies the ups and downs of your life. Alternatively, the dream indicates that you are not taking life's issues and problems seriously enough. You see things too trivially.<br/></p>", "deleted": false}, {"id": 21589, "name": "Yucca", "definition": "<p>To see a yucca plant in your dream indicates that you need to think outside the box or outside of convention. Alternately, the dream suggests that you need to be more flexible and yielding in your thinking in order to move further toward your goals.<br/></p>", "deleted": false}, {"id": 21590, "name": "Yule Log", "definition": "<p style=\"font-size: medium;\"><font face=\"Arial\">To see a Yule log in your dream signifies a positive turn of events in the coming year.</font></p><p style=\"font-size: medium;\"><font face=\"Arial\">To dream of burning a Yule log warns that you should not set your sights too high. You need to be more realistic.</font></p>", "deleted": false}, {"id": 21534, "name": "Z", "definition": "<p>To see the letter &#34;Z&#34; in your dream suggests that you need to get more &#34;Zzzz's&#34; or rest.<br/></p>", "deleted": false}, {"id": 21535, "name": "Zamboni", "definition": "<p>To see a Zamboni in your dream implies that you are closing yourself off to new ideas and opinions. You tend to be emotionally rigid.<br/></p>", "deleted": false}, {"id": 21536, "name": "Zebra", "definition": "<p style=\"font-size: medium;\"><font face=\"Arial\">To see a zebra in your dream represents perfect balance, unity and harmony. It also indicates that opposites attract. Alternatively, a zebra suggests that you are spending too much time in trivial matters. You need to establish a clear timeline and lay your groundwork for success.</font></p><p style=\"font-size: medium;\"><font face=\"Arial\">To dream that a zebra is running implies that you are trying to escape from a dangerous relationship or situation.</font></p>", "deleted": false}, {"id": 21537, "name": "Zen", "definition": "<p>To dream of being Zen symbolizes your quest for spiritual balance and harmony. You are at peace of yourself. Perhaps you need to practice meditation.<br/></p>", "deleted": false}, {"id": 21538, "name": "Zenith", "definition": "<p style=\"font-size: medium;\"><font face=\"Arial\">To dream of staring up into the zenith symbolizes your potential.  You are pushing your limits and overcoming obstacles in the pursuit of your goals.</font></p><p style=\"font-size: medium;\"><font face=\"Arial\">To dream that you have reached the zenith of your profession indicates you are in a dead-end job. It is time for a career change.</font></p>", "deleted": false}, {"id": 21539, "name": "Zephyr", "definition": "<p>To dream of zephyrs symbolize your desire for love and happiness over wealth and fortune. You will sacrifice fortune in order to obtain the object of your affection. Alternatively, the dream represents your satisfaction and general contentment with life.<br/></p>", "deleted": false}, {"id": 21540, "name": "Zero", "definition": "<p>Zero symbolizes nothingness and emptiness. You are experiencing a void in your life. The symbol may also share the same significance as a circle and thus denotes infinity, eternity, completeness, absolute freedom and holiness. Alternatively, the dream forewarns that you are going around in circles and headed no where. Perhaps your actions have been counterproductive. It also represents timelessness and the super-conscious.<br/></p>", "deleted": false}, {"id": 21541, "name": "Zeus", "definition": "<p style=\"font-size: medium;\"><font face=\"Arial\">To see or dream that you are Zeus suggests that you have total control over your life. You are looking for better control. </font></p>", "deleted": false}, {"id": 21542, "name": "Zig-Zag", "definition": "<p>To see zig-zags in your dream represent your erratic behavior. It may also indicate that you are being defensive about something.<br/></p>", "deleted": false}, {"id": 21543, "name": "Zinc", "definition": "<p style=\"font-size: medium;\"><font face=\"Arial\">To see zinc in your dream suggests that your professional or educational pursuits will go through a process of positive renewal and energetic progress.</font></p><p style=\"font-size: medium;\"><font face=\"Arial\">To taste zinc in your dream is your subconscious telling you that you are lacking in an essential vitamin or mineral. Be aware of developing heath problems.</font></p>", "deleted": false}, {"id": 21544, "name": "Zinnias", "definition": "<p>To see zinnias in your dream symbolize laughter, friendships, and joy. It is also signals summer pleasures.<br/></p>", "deleted": false}, {"id": 21545, "name": "Zip Code", "definition": "<p>To see a zip code in your dream represents your identity and your sense of being grounded.  Add up the digits of the zip code and determine the significance of that number.<br/></p>", "deleted": false}, {"id": 21546, "name": "Zip Line", "definition": "<p>To dream that you are zip lining implies that you need to get a new perspective of some situation. The dream may literally mean an &#34;overview&#34;. If you are going too fast, then the dream is telling you that you are letting life pass you by. If you are stuck on a zip line, then it implies that you need to examine a situation more carefully. <br/></p>", "deleted": false}, {"id": 21547, "name": "Ziploc Bag", "definition": "<p>To see or use a Ziploc bag in your dream represents a reserve a energy that you are waiting to exert. Consider the significance of the bag contents.<br/></p>", "deleted": false}, {"id": 21548, "name": "Zipper", "definition": "<p style=\"font-size: medium;\"><font face=\"Arial\">To see a zipper in your dream implies sexuality and sexual innuendos. If you are unzipping, then it indicates that you are opening up. If you are zipping up, then it suggests that you are closing yourself off emotionally.  Alternatively, the dream may be a pun that you need to keep your mouth &#34;zipped.&#34; You are talking too much. </font></p><p style=\"font-size: medium;\"><font face=\"Arial\">To see a broken or stuck zipper in your dream refers to your difficulties in expressing your sexual desires or feelings. You are frustrated about not being able to resolve a situation or problem. You may also have difficulty in maintaining your composure, especially in an awkward or public situation.</font></p>", "deleted": false}, {"id": 21549, "name": "Zither", "definition": "<p>To see or hear a zither in your dream suggests that you are seeking the truth.<br/></p>", "deleted": false}, {"id": 21550, "name": "Zodiac", "definition": "<p style=\"font-size: medium;\"><font face=\"Arial\">To see the zodiac in your dream  represents the various aspects of your conscious being and how you connect to the universe. Alternatively, the zodiac may appear in a dream to denote the passage of time.</font></p><p style=\"font-size: medium;\"><font face=\"Arial\">If you dream of a particular zodiac sign, then look at the particular traits and attributes associated with the given sign.</font></p>", "deleted": false}, {"id": 21551, "name": "Zombie", "definition": "<p style=\"font-size: medium;\"><font face=\"Arial\">To see or dream that you are a zombie suggests that you are physically and/or emotionally detached from people and situations that are currently surrounding you. You are feeling out of touch. Alternatively, a zombie means that you are feeling dead inside. You are just going through the motions of daily living.</font></p><p style=\"font-size: medium;\"><font face=\"Arial\">To dream that you are attacked by zombies indicate that you are feeling overwhelmed by forces beyond your control. You are under tremendous stress in your waking life. Alternatively, the dream represents your fears of being helpless and overpowered.</font></p><p style=\"font-size: medium;\"><font face=\"Arial\">To see someone as a zombie implies that your feelings for them is dead. You have not emotional attachment towards them.</font></p><p style=\"font-size: medium;\"><font face=\"Arial\">If you dream that you ate a zombie, then it means that you are holding onto a relationship that is dead. Eating a zombie in your dream may also point to how you distance yourself from others as a way of protecting your own feelings</font><font face=\"Arial\">.</font></p>", "deleted": false}, {"id": 21552, "name": "Zoo", "definition": "<p style=\"font-size: medium;\"><font face=\"Arial\">To dream that you are at a zoo symbolizes loss of freedom. Alternatively, a zoo suggests that your abilities and talents are going unnoticed. You or an aspect of your life feels caged in. The zoo may also represent chaos and confusion as implied by the common phrase &#34;this place is a zoo!&#34; You may need to tidy up some situation in your life.</font></p><p style=\"font-size: medium;\"><font face=\"Arial\">To dream that animals escape from the zoo implies that your hidden desires can no longer be contained and must be acknowledged or expressed. </font></p>", "deleted": false}, {"id": 21553, "name": "Zookeeper", "definition": "<p>To see a zookeeper in your dream suggests that you are on the verge of losing control over some aspect of your life. Some situation or emotion is threatening to come to the surface.<br/></p>", "deleted": false}, {"id": 21554, "name": "Zoomorphism", "definition": "<p>To dream that you are changing into the form of an animal indicates that you are becoming less civilized, less restrained and becoming more free and instinctive. You may be expressing your newfound freedom/independence and experiencing a lack of boundaries. Alternatively, taking the form of an animal suggests that your primal desires and/or repressed sexual urges are coming to the surface and needing to be satisfied. Consider also the animal that your turn into.<br/></p>", "deleted": false}]}